{"status": "ok", "totalResults": 5795, "articles": [{"source": {"id": null, "name": "Lifehacker.com"}, "author": "Melanie Pinola and Claire Lower", "title": "The Best Cheeses to Eat If You're Lactose Intolerant", "description": "Being lactose-intolerant can feel like you’ve been cursed to a life without cheese, but not all cheeses contain high levels of the sugar. To see which cheeses are your friend (and which will give you trouble), just take a peek at the nutrition label. Read mor…", "url": "https://lifehacker.com/the-best-cheeses-to-eat-if-youre-lactose-intolerant-1563386663", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--3fxpNYQe--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/v6ivfybrsywwnbkv4ah1.png", "publishedAt": "2019-06-04T15:50:00Z", "content": "Being lactose-intolerant can feel like youve been cursed to a life without cheese, but not all cheeses contain high levels of the sugar. To see which cheeses are your friend (and which will give you trouble), just take a peek at the nutrition label.\r\nI am not… [+3089 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert", "title": "Get Free Artificial-Free Pet Food at Petco This Weekend", "description": "If you’ve been wanting to upgrade your dog or cat’s diet but were waiting for the perfect opportunity, this weekend might be your chance. Petco will take your artificial-ingredient-ridden food off your hands in exchange for a free bag of artificial-free food.…", "url": "https://lifehacker.com/get-free-artificial-free-pet-food-at-petco-this-weekend-1834844058", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--jLFG4ASH--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/aefagquavamxqs3uee3r.jpg", "publishedAt": "2019-05-17T20:15:00Z", "content": "If youve been wanting to upgrade your dog or cats diet but were waiting for the perfect opportunity, this weekend might be your chance. Petco will take your artificial-ingredient-ridden food off your hands in exchange for a free bag of artificial-free food. \r… [+849 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Offspring, shared by Meghan Moravcik Walbert to Lifehacker", "title": "Why You Might Not Want to Buy European Baby Formulas", "description": "One of a parent’s first major decisions is how—or what—to feed their baby. For those who  formula feed, the pressure to find a high-quality product that is as nutritious as possible can be daunting. And that may be why some parents are turning to European bra…", "url": "https://offspring.lifehacker.com/why-you-might-not-want-to-buy-european-baby-formulas-1835410453", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--nYb-nxr7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/gw5tzki2tnj5gw8trq2j.jpg", "publishedAt": "2019-06-11T18:30:00Z", "content": "One of a parents first major decisions is howor whatto feed their baby. For those who formula feed, the pressure to find a high-quality product that is as nutritious as possible can be daunting. And that may be why some parents are turning to European brands … [+2441 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Help Reduce School Lunch Debt", "description": "Earlier this month, one Rhode Island school district made headlines after giving some of its students—those with unpaid balances for school meals—cold sun butter and jelly sandwiches (along with milk and veggies) instead of hot meal items, available to all ot…", "url": "https://lifehacker.com/how-to-help-reduce-school-lunch-debt-1835449227", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gKtCwyiK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/c6ocrnevdid6akpfvcnj.jpg", "publishedAt": "2019-06-12T18:15:00Z", "content": "Earlier this month, one Rhode Island school district made headlines after giving some of its studentsthose with unpaid balances for school mealscold sun butter and jelly sandwiches (along with milk and veggies) instead of hot meal items, available to all othe… [+4079 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Stefanie Sabar", "title": "Would you try this wellness app for $1?", "description": "There is no one-size-fits-all approach to health and wellness, just as there is no one right answer for the best flavor of cake. Personalized to fit your lifestyle, Noom is a digital wellness program that believes it’s important to have your cake and eat it, …", "url": "https://mashable.com/ad/article/wellness-app-health-noom/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F07%252F8c%252F9e7a8cf46c8c41c882f5595dec4f5e99.82c53.jpg%252F1200x630.jpg?signature=Cf-OlZMC6qeQrH6n-02wfEuhtJY=", "publishedAt": "2019-06-07T17:14:14Z", "content": "There is no one-size-fits-all approach to health and wellness, just as there is no one right answer for the best flavor of cake. Personalized to fit your lifestyle, Noom is a digital wellness program that believes its important to have your cake and eat it, t… [+1723 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "New study adds evidence to link between nutrition and breast cancer risk - The Globe and Mail", "description": "New study adds evidence to link between nutrition and breast cancer risk The Globe and Mail While such studies don't prove cause and effect, eating more vegetables, more fibre and less red meat, for example, has been linked to a lower risk. iStockPhoto...", "url": "https://www.theglobeandmail.com/life/health-and-fitness/article-new-study-adds-evidence-to-link-between-nutrition-and-breast-cancer/", "urlToImage": "https://www.theglobeandmail.com/resizer/Dsrg8OoKza9KLiFl83Cg1Ej-f0Q=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/N4LYUQAURZDBNLY2DGSC4EUWAA.jpg", "publishedAt": "2019-05-19T16:00:00Z", "content": "While such studies dont prove cause and effect, eating more vegetables, more fibre and less red meat, for example, has been linked to a lower risk.\r\niStockPhoto / Getty Images\r\nDiet may play a role in preventing breast cancer, some observational studies have … [+5006 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Miller Kern", "title": "AncestryDNA kits are $40 off for Father's Day", "description": "TL;DR: The popular and fun AncestryDNA DNA kits are $40 off for Father's Day — gift your dad something exciting and educational. Your dad is special, so make sure you get him a Father’s Day gift that shows him that. Stray away from the whiskey stones and ties…", "url": "https://mashable.com/shopping/deal-june-7-ancestry-dna-kits-on-sale/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F07%252Fae%252F8c2f41daa8424290a3d17383a1731361.f3d6d.jpg%252F1200x630.jpg?signature=vWYDbIHG31kkdMu_IVx-3gP6cns=", "publishedAt": "2019-06-07T14:46:37Z", "content": "TL;DR: The popular and funAncestryDNA DNA kits are $40 off for Father's Day gift your dad something exciting and educational.\r\nYour dad is special, so make sure you get him a Fathers Day gift that shows him that. Stray away from the whiskey stones and ties th… [+1082 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Joseph Green", "title": "Kindles, Bose headphones, Microsoft laptops, Huawei fitness trackers, Philips electric toothbrushes, and more on sale for May 16 in the UK", "description": "This selection of deals is all about health, fitness, and self-improvement (not that you need it). We have tracked down the best fitness and grooming deals from top brands like Oral-B, Philips, Huawei, Honor, and eufy. This is your best chance to save on a wi…", "url": "https://mashable.com/uk/shopping/best-deals-amazon-bose-microsoft-huawei-may-16/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F16%252Fd5%252F699270f1055843bfbedd795dcb2e53ea.49294.png%252F1200x630.png?signature=SW0dNjfyiCBU4kqijLEUTLYIPqk=", "publishedAt": "2019-05-16T13:26:52Z", "content": "This selection of deals is all about health, fitness, and self-improvement (not that you need it). We have tracked down the best fitness and grooming deals from top brands like Oral-B, Philips, Huawei, Honor, and eufy.\r\nThis is your best chance to save on a w… [+734 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Miller Kern", "title": "Nutri Ninja personal blender with FreshVac is $50 off at Amazon", "description": "TL;DR: The Nutri Ninja blender with FreshVac removes oxygen from produce to maximize nutrition, and it's on sale for $79.88 at Amazon, saving you $50. Hot weather calls for cold beverages. As summer rolls around, you might find yourself cracking open a cold b…", "url": "https://mashable.com/shopping/deal-june-13-nutri-ninja-freshvac-personal-blender-amazon/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F13%252F92%252F533facbe7f3244c59d8af6ffbf7f10db.0a0fd.jpg%252F1200x630.jpg?signature=bm24G9DR-SDNiR3gGTjHPZuVlOg=", "publishedAt": "2019-06-13T15:08:26Z", "content": "TL;DR: The Nutri Ninja blender with FreshVac removes oxygen from produce to maximize nutrition, and it's on sale for $79.88 at Amazon, saving you $50.\r\nHot weather calls for cold beverages. As summer rolls around, you might find yourself cracking open a cold … [+1387 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Amazon’s new rewards card targets those with bad credit", "description": "Amazon this morning announced the launch of Amazon Credit Builder, a new secured credit card offered in partnership with Synchrony Bank. As the name implies, the card is aimed at those who are looking to build their credit history — either to recover from bad…", "url": "http://techcrunch.com/2019/06/10/amazons-new-rewards-card-targets-those-with-bad-credit/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2015/11/5dfd8eba82f34032a08bad06c1e224f1.jpg?w=661", "publishedAt": "2019-06-10T15:49:59Z", "content": "Amazon this morning announced the launch of Amazon Credit Builder, a new secured credit card offered in partnership with Synchrony Bank. As the name implies, the card is aimed at those who are looking to build their credit history — either to recover from bad… [+4077 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "NEIL IRWIN", "title": "How to Prepare for the Next Recession: Automate the Rescue Plan", "description": "Solar panels at Nellis Air Force Base in the Las Vegas area. In 2009, the Obama administration pointed to the project as a success it wanted to emulate with its stimulus plan.", "url": "https://www.nytimes.com/2019/05/16/upshot/how-to-prepare-for-the-next-recession-automate-the-rescue-plan.html", "urlToImage": "https://static01.nyt.com/images/2019/05/16/upshot/16up-arra1/16up-arra1-facebookJumbo.jpg", "publishedAt": "2019-05-16T08:46:41Z", "content": "Economists like to talk about automatic stabilizers, a term for programs that expand automatically when the economy is weak. Some of these already exist. Think of unemployment insurance benefits, which pump more money into the economy when joblessness is high… [+1568 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Food insecurity in Nunavut increased since introduction of federal program: report - The Globe and Mail", "description": "Food insecurity in Nunavut increased since introduction of federal program: report The Globe and Mail Food insecurity rising in Nunavut since launch of Nutrition North: study CBC News Nunavut's Food Insecurity Grows Despite Federal Program: Study HuffPost Can…", "url": "https://www.theglobeandmail.com/canada/article-food-insecurity-in-nunavut-increased-since-introduction-of-federal/", "urlToImage": "https://www.theglobeandmail.com/resizer/lFXzvhzbeaSJ0L25BjMdfI7QW24=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/6MAV57QV6NCMRHOA3HBA3PZMCM.jpg", "publishedAt": "2019-05-21T04:01:00Z", "content": "Access to affordable food in Nunavut worsened after the introduction of Nutrition North Canada the federal governments program meant to lower the prices for nutritious food in remote northern communities according to a new study.\r\nThe study, published Tuesday… [+3473 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Allison Aubrey", "title": "The Swap: Less Processed Meat, More Plant-Based Foods May Boost Longevity", "description": "A new study of 80,000 people finds that those who ate the most red meat — especially processed meats such as bacon and hot dogs — had a higher risk of premature death compared with those who ate less.", "url": "https://www.npr.org/sections/thesalt/2019/06/12/732061499/the-swap-less-processed-meat-more-plant-based-foods-may-boost-longevity", "urlToImage": "https://media.npr.org/assets/img/2019/06/12/gettyimages-494330628-1-_wide-3740c39a1315619114e795ca4342ed6e44404828.jpg?s=1400", "publishedAt": "2019-06-12T22:31:10Z", "content": "Processed meats, including hot dogs and bacon, cook in a frying pan. A new study of 80,000 people finds that those who ate the most red meat especially processed meats such as bacon and hot dogs had a higher risk of premature death compared with those who cut… [+3656 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Natural News—hawker of vitamins and far-right conspiracies—banned from Facebook", "description": "Conspiracist founder compares Zuckerberg to Hitler, urges Trump to declare war.", "url": "https://arstechnica.com/science/2019/06/natural-news-hawker-of-vitamins-and-far-right-conspiracies-banned-from-facebook/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/04/GettyImages-541789842-760x380.jpg", "publishedAt": "2019-06-10T17:17:08Z", "content": "29 with 24 posters participating\r\nFacebook on Sunday removed the prominent health and conspiracy site Natural News from its platform and banned its incendiary founder from posting content.\r\nThough Facebook did not immediately respond to Ars request for commen… [+3272 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ni'Kesia Pannell", "title": "13 athletes who have become successful owners of fast-food franchises", "description": "Some athletes retire and go into business. These 13 athletes now find success in the food and beverage industry. Former NBA player Mike Miller owns 10 BugerFi locations. San Francisco 49ers cornerback Richard Sherman owns two Wingstop locations in Seattle. Fo…", "url": "https://www.businessinsider.com/athletes-who-own-fast-food-franchises-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cfe9d942689160f3e793e64-1920-960.jpg", "publishedAt": "2019-06-10T18:40:04Z", "content": "Former NBA champ Mike Miller ended his career with the Denver Nuggets in 2017. Now, he's an owner of the all-natural, fast-casual burger joint BurgerFi. \r\n \"I was first introduced to the BurgerFi concept when one of my partners became a franchisee in Alabama,… [+680 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "The Oracles", "title": "Sam Bakhtiar's Secret to Making Life Interesting and Keeping Your Brain Young", "description": "Most of us stop doing this when we become adults.", "url": "https://www.entrepreneur.com/article/333731", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190514153504-Sam-Bakhtiar.jpeg", "publishedAt": "2019-05-17T17:00:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nIn this series called Member Showcase, we publish interviews with members of The Oracles. This interview is with Dr. Sam Bakhtiar, CEO and co-founder of The Camp Transformation Centers and CEO of… [+3793 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Anna Medaris Miller", "title": "Researchers have found the 2 diet mistakes most linked to new cancer cases. Here's what to avoid.", "description": "A new study found that a \"suboptimal diet\" may account for 5.2 percent of all new invasive cancer cases in the U.S. each year. It adds to the body of research connecting poor diets and cancer risk by quantifying how much different eating behaviors are linked …", "url": "https://www.insider.com/diet-mistakes-most-linked-to-new-cancer-cases-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce5c4734cf27028d17a6779-2732-1366.jpg", "publishedAt": "2019-05-23T13:00:00Z", "content": "Sorry, keto devotees: New research has found that skimping on cereal and whole-wheat sandwiches may be a dicey idea when it comes to slashing your cancer risk. \r\n Specifically, a new study found that \"insufficient whole grain consumption\" is the eating behavi… [+4059 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "More evidence that no best diet exists: A study of 1,100 people shows how everyone responds differently to common foods", "description": "A new study followed 1,100 people for two weeks in the US and the UK, and found that no two people's bodies responded exactly the same way to common foods. Lead researcher Tim Spector said a good general rule is still to eat a variety of plants, including nut…", "url": "https://www.businessinsider.com/what-is-the-best-diet-no-such-thing-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cfe643911e205076213e522-960-480.jpg", "publishedAt": "2019-06-11T19:18:00Z", "content": "There are many different ways to eat, and plenty of people who will tell you that their plan is the best way to stay fit. \r\n But a new study is calling their bluff. \r\n Scientists had 1,100 adults in the US and UK eat the same common foods (like muffins for br… [+6840 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ivan De Luce", "title": "The 6 best industries for small businesses to thrive in, from food trucks to health to micromobility", "description": "Starting a small business is no small task. 20% of small businesses fold in their first year, in part because they didn't find the right niche in their industry. These six industries — among them health, personal nutrition, and mobility — offer an ideal clima…", "url": "https://www.businessinsider.com/the-best-industries-for-small-businesses-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf69bf911e20547be6b6837-1920-960.jpg", "publishedAt": "2019-06-05T12:51:19Z", "content": "Being a personal trainer means branding yourself as a business and gaining the right clients to spread the word. It's very easy to start out small— you can make a website and begin right away. \r\n Between traditional gyms, boutique fitness clubs, and personal … [+541 chars]"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Liam Casey", "title": "Prominent labels and taxes on sugary products reduce consumption, Ontario study suggests - CP24 Toronto's Breaking News", "description": "Prominent labels and taxes on sugary products reduce consumption, Ontario study suggests CP24 Toronto's Breaking News Sugar tax and prominent labels can lower sugar consumption: study CTV News View full coverage on Google News", "url": "https://www.cp24.com/lifestyle/prominent-labels-and-taxes-on-sugary-products-reduce-consumption-ontario-study-suggests-1.4442834", "urlToImage": "https://www.cp24.com/polopoly_fs/1.4442837.1559162809!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2019-05-29T20:47:00Z", "content": "Prominent nutrition labels and taxes on sugary products can help consumers opt for healthier options, researchers said Wednesday -- a day after the federal government ruled out imposing a tax on sugary drinks.\r\nThe years-long study from researchers at the Uni… [+3798 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nicole Dieker", "title": "If You Want to Build New Habits, Build Fewer Habits", "description": "The more habits you try to create, the harder it is to keep them all going. Read more...", "url": "https://lifehacker.com/if-you-want-to-build-new-habits-build-fewer-habits-1835099898", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--ABp6_J8D--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vltavwcfezaqcrjrobxq.jpg", "publishedAt": "2019-05-30T14:30:00Z", "content": "The more habits you try to create, the harder it is to keep them all going.\r\nIve known this for a while. Last year, I set up a spreadsheet to help me track a bunch of life metrics (sleep, nutrition, etc.) as well as the activities and habits that I wanted to … [+3551 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Yessenia Funes on Earther, shared by Maddie Stone to Gizmodo", "title": "Scientists Say Octopus Farms Would Be 'Unethical' and Awful for the Planet", "description": "I still remember the first time I tasted octopus. After an exhausting day reporting the troubles in Puerto Rico post-Hurricane Maria, Gizmodo video producer Raúl Marrero and I headed to a seaside restaurant where I tried ensalada de pulpo as an appetizer. It …", "url": "https://earther.gizmodo.com/scientists-say-octopus-farms-would-be-unethical-and-awf-1834725705", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--1qRSInwB--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/c2ygkuh4ym0flwln81d6.jpg", "publishedAt": "2019-05-13T20:00:00Z", "content": "I still remember the first time I tasted octopus. After an exhausting day reporting the troubles in Puerto Rico post-Hurricane Maria, Gizmodo video producer Raúl Marrero and I headed to a seaside restaurant where I tried ensalada de pulpo as an appetizer. It … [+2703 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Aly Walansky", "title": "5 signs that a child might be experiencing malnutrition", "description": "Many people around the world suffer from malnutrition, and many of them are children. Malnutrition often shows itself in weight loss. It can also be seen in cognitive impairment. Visit INSIDER's homepage for more stories. Around 2 billion people in the world …", "url": "https://www.insider.com/signs-of-malnutrition-and-malnourishment-in-children-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf7c3ccf2f47949bd09a4ba-960-480.jpg", "publishedAt": "2019-06-05T13:28:30Z", "content": "Around 2 billion people in the world suffer from some form of malnutrition, or lack of proper nutrients, according to the Global Alliance for Improved Nutrition (GAIN), and a large number of those are children. Malnutrition is the cause of death in 2.6 millio… [+5770 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "My favorite snack bar has 20 grams of protein and very little sugar — and it comes in fun flavors like blueberry cobbler and maple-glazed donut", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/one-protein-bar-review", "urlToImage": "https://amp.businessinsider.com/images/5cc753e8b14bf440a318b6b3-1920-960.jpg", "publishedAt": "2019-05-20T21:57:00Z", "content": "Insider Pickswrites about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4327 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Eillie Anzilotti", "title": "Dehydration makes these snacks a food-waste solution of the future", "description": "With its exclusive drying technology, Treasure8 sucks the moisture from fruits, vegetables, and food scraps that would otherwise go to waste and transforms them into next-generation snacks. Ground Rules chips have the crisp, crunchy texture you might expect f…", "url": "https://www.fastcompany.com/90356134/dehydration-makes-these-snacks-a-food-waste-solution-of-the-future?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-90356134-dehydrated-produce-is-the-snack-food-and-food-waste-solution-of-the-future.jpg", "publishedAt": "2019-05-29T14:30:21Z", "content": "Ground Rules chips have the crisp, crunchy texture you might expect from biting into a potato chip from a greasy bag, but the similarities pretty much end there. These chips, which come in three flavors–apple, beet, and sweet potato–are made with only one ing… [+2516 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Julia Naftulin", "title": "Kids and teens are experiencing such severe side effects from weight loss and sexual function pills, they're ending up in the hospital", "description": "Young people in the US are experiencing severe side effects after using supplements for weight loss, sexual function, energy, and muscle gain, according to a new retrospective study. Supplements send an estimate 23,000 people to the hospital each year in the …", "url": "https://www.insider.com/weight-loss-sex-supplements-danger-kids-teens-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5ceebb384cf27072a702a38f-2732-1366.jpg", "publishedAt": "2019-06-07T18:14:00Z", "content": "Supplements send an estimated 23,000 people to the hospital each year in the United States, and a new study suggests children and young adults comprise a significant number of these visits. Even more alarming, supplements for weight loss, muscle gain, and sex… [+3085 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Eating better can improve your mental well-being, particularly if you have depression - The Globe and Mail", "description": "Eating better can improve your mental well-being, particularly if you have depression The Globe and Mail It's thought that inflammatory immune compounds can communicate with the brain, affecting mood, behaviour and energy levels.", "url": "https://www.theglobeandmail.com/life/health-and-fitness/article-eating-better-can-improve-your-mental-well-being-particularly-if-you/", "urlToImage": "https://www.theglobeandmail.com/resizer/osIE2yjXS-_MRKRasux9dH5G7Mw=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/7HRD64M4CZCJ5J4EALFYSD565E.jpg", "publishedAt": "2019-06-09T19:30:42Z", "content": "There are many reasons why people change their diet: Lose weight, lower blood pressure, ease digestive upset and improve athletic performance are a few of them.\r\nEating better can also improve your mental well-being, something thats not commonly recognized. M… [+5604 chars]"}, {"source": {"id": null, "name": "Nextavenue.org"}, "author": "The American Federation for Aging Research", "title": "Next Avenue: The Mediterranean diet and your brain—could nutrition help delay or prevent dementia?", "description": "Some evidence indicates the Mediterranean diet supports brain health as well as heart health.", "url": "https://www.nextavenue.org/can-the-mediterranean-diet-delay-or-prevent-dementia/", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HK538_na_med_ZG_20190530125109.jpg", "publishedAt": "2019-06-05T08:59:59Z", "content": "This article is reprinted by permission from NextAvenue.org. It is part of an editorial partnership between Next Avenue and The American Federation for Aging Research. \r\nBefore earning her doctorate in public health nutrition from Queens University Belfast in… [+7115 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Todd Bates-Rutgers", "title": "Gene discovery could boost corn’s nutrition", "description": "A new discovery could make corn more nutritious.", "url": "https://www.futurity.org/corn-nutrition-genetic-regulators-2070122/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/05/eating-corn-holding-baby_1600.jpg", "publishedAt": "2019-05-23T12:32:52Z", "content": "A new discovery could improve the nutritional value and crop yields of corn, report researchers.\r\nThe research could benefit millions of people who rely on corn for nutrition in South America, Africa, and elsewhere.\r\nThe world’s corn supply depends on improvi… [+2189 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Robert Anderson", "title": "Apple Watches, LG 4K TVs, Remington beard trimmers, Philips electric toothbrushes, and more on sale for June 7 in the UK", "description": "Finding the best deals from across the internet doesn't need to be a boring slog, as we've done the hard part for you. Help is at hand, as we've tracked down the very best deals on big brands like Apple, Huawei, LG, and more. There's everything from dazzling …", "url": "https://mashable.com/uk/shopping/best-deals-apple-lg-panasonic-philips-june-7/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F07%252F5a%252Fddacc9374d0f47ce93b8a11ba4367404.52b3e.png%252F1200x630.png?signature=S-KTPHT5p8-bsdxc-SbuEj9Iqo8=", "publishedAt": "2019-06-07T13:57:34Z", "content": "Finding the best deals from across the internet doesn't need to be a boring slog, as we've done the hard part for you. \r\nHelp is at hand, as we've tracked down the very best deals on big brands like Apple, Huawei, LG, and more. There's everything from dazzlin… [+918 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Joseph Green", "title": "Nintendo Switch consoles, Philips 4K TVs, Sony speakers, Oral-B electric toothbrushes, and more on sale for May 29 in the UK", "description": "There really is something for everyone in this deals round up. Need an electric toothbrush? We have something for you. What about a pack of memory sticks? Yep, we have that too. How about a hot tub for the garden? You guessed it, we have it. You can save on a…", "url": "https://mashable.com/uk/shopping/best-deals-nintendo-switch-philips-4k-tv-sony-may-29/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F29%252Fe0%252Fb364d97bc49f4f1aafca2cbf836d46d9.686f9.png%252F1200x630.png?signature=TplAnvkouGH9DGEbd2Q0BloX3PE=", "publishedAt": "2019-05-29T13:53:27Z", "content": "There really is something for everyone in this deals round up. Need an electric toothbrush? We have something for you. What about a pack of memory sticks? Yep, we have that too. How about a hot tub for the garden? You guessed it, we have it.\r\nYou can save on … [+774 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nicole Dieker", "title": "Don't Let Boredom Get in the Way of Your Goals", "description": "We all know how exciting it is to start a new habit. Today we’re going to be the type of person who wakes up early! Packs their lunch before work! Goes to the gym! Read more...", "url": "https://lifehacker.com/dont-let-boredom-get-in-the-way-of-your-goals-1834948816", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--6Xh8FdeC--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/x36t2lmhigmgtwtuucpe.jpg", "publishedAt": "2019-05-22T15:45:00Z", "content": "We all know how exciting it is to start a new habit. Today were going to be the type of person who wakes up early! Packs their lunch before work! Goes to the gym!\r\nWe also know how exciting it is to experience something that pulls us away from the daily grind… [+5818 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "P. Sridhar, P SridharBHADRADRI-KOTHAGUDEM", "title": "Nutrition boost to tribal welfare students’ diet", "description": "Drumstick leaf powder is an inexpensive supplement, says ITDA officer", "url": "https://www.thehindu.com/news/national/telangana/nutrition-boost-to-tribal-welfare-students-diet/article27189904.ece", "urlToImage": "https://www.thehindu.com/news/national/telangana/po938z/article27189902.ece/ALTERNATES/LANDSCAPE_615/HY21DRUMSTICK", "publishedAt": "2019-05-20T17:54:52Z", "content": "The Integrated Tribal Development Agency (ITDA), Bhadrachalam, is toying with the idea of introducing powder of the iron-rich drumstick (Moringa oleifera) leaf, a storehouse of nutrients, as an ingredient for culinary use in the tribal welfare hostels as a nu… [+1731 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Mark Wilson", "title": "You’re probably being tricked by “health washing” at the grocery store", "description": "Here’s how to avoid this sleight-of-hand move by packaging designers. Organic. All natural. High protein. Such tantalizing words seem to adorn every package at the grocery store. Even Lucky Charms, a cereal that’s largely dyed candy, promises that it has “who…", "url": "https://www.fastcompany.com/90347891/youre-probably-being-tricked-by-health-washing-at-the-grocery-store?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcodesign%2Ffeed+%28Co.Design%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-90347891-the-trick-food-labels-use-to-look-healthier-than-they-really-are.jpg", "publishedAt": "2019-05-14T08:00:32Z", "content": "Organic. All natural. High protein. Such tantalizing words seem to adorn every package at the grocery store. Even Lucky Charms, a cereal that’s largely dyed candy, promises that it has “whole grains” and is “gluten free” right beside the sugary sparkle “now w… [+3785 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "There's evidence for the first time that processed foods cause us to eat more and gain weight. Ultra-processed items like muffins and quesadillas are major culprits.", "description": "Processed foods have long been linked to shorter life spans and increased cancer cases. Groundbreaking research from the US National Institutes of Health suggests for the first time that the relationship is causal: no matter how nutritious they are, processed…", "url": "https://www.businessinsider.com/how-processed-foods-lead-to-weight-gain-nih-study-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cdc85d6021b4c06a7592abe-960-480.jpg", "publishedAt": "2019-05-16T15:00:00Z", "content": "Too much sugar, too much salt, and too much fat. \r\n We've all been told for years that these are the culprits responsible for soaring obesity rates and expanding waistlines. \r\n But new groundbreaking research performed at a state-of-the-art nutrition lab in M… [+5766 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "John Boitnott", "title": "These Strategies Help Entrepreneur Combat Anxiety and Depression", "description": "The same character traits make people choose entrepreneurship can make them vulnerable to depression and anxiety.", "url": "https://www.entrepreneur.com/article/333636", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190513180816-GettyImages-521983717.jpeg", "publishedAt": "2019-05-14T11:30:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nEntrepreneurs are not strangers to anxiety and depression. They’re just as susceptible as the rest of the population, if not more so, to mental illnesses such as bipolar disorder, sociopathy, sch… [+5868 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "White Meat May Be as Bad as Red Meat for Cholesterol", "description": "Switching from red meat to chicken to keep your cholesterol down may not be a great strategy, according to a new study this Tuesday. It found that people’s blood cholesterol levels rose similarly when they ate a diet filled with either red or white meat, comp…", "url": "https://gizmodo.com/white-meat-may-be-as-bad-as-red-meat-for-cholesterol-1835238764", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--JE1Ui5CY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/fgxi6fsqtiytw9permlb.jpg", "publishedAt": "2019-06-04T17:50:00Z", "content": "Switching from red meat to chicken to keep your cholesterol down may not be a great strategy, according to a new study this Tuesday. It found that peoples blood cholesterol levels rose similarly when they ate a diet filled with either red or white meat, compa… [+3895 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "UoM to hold workshop on personalised nutrition in August", "description": "The University of Mysore’s Department of Studies in Food Science and Nutrition will hold a workshop on personalised nutrition to tackle the disease burden arising out of obesity and diabetes.Though th", "url": "https://www.thehindu.com/news/national/karnataka/uom-to-hold-workshop-on-personalised-nutrition-in-august/article27120670.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-05-13T18:58:04Z", "content": "The University of Mysores Department of Studies in Food Science and Nutrition will hold a workshop on personalised nutrition to tackle the disease burden arising out of obesity and diabetes.\r\nThough the workshop, titled From nutrigenetics to personalised nutr… [+1966 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Lindsay Dodgson", "title": "Here's the truth about whether you should drink coffee and tea while pregnant", "description": "Some people avoid caffeine completely during pregnancy But according to research and doctors, it's safe to drink tea and coffee in moderation. Caffeine is a stimulant, so in excess it can cause blood pressure and heart rate to go up. \"When looked at together,…", "url": "https://www.insider.com/can-you-drink-coffee-when-pregnant-caffeine-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce80452f2f47938081dbf52-1536-768.jpg", "publishedAt": "2019-05-26T10:44:00Z", "content": "It's commonly recommended that women should avoid certain things when they're pregnant, like raw shellfish, soft blue cheese, and undercooked meat. Some also choose to stay away from caffeine for the entirety of their pregnancy too. \r\n But according to Dr Isi… [+2280 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Cerulli", "title": "The best dental products you can buy for cats", "description": "Providing your cat with dental health-care at home can help to reduce or even avoid expensive dental treatments at the vet. Our top pick, Virbac C.E.T. Oral Hygiene Chews for Cats, appeals to cats, easy to provide on a daily basis, and supplements other denta…", "url": "https://www.businessinsider.com/best-cat-dental-product", "urlToImage": null, "publishedAt": "2019-05-24T22:00:00Z", "content": "You've carefully chosen a nutritious food for your cat, make sure it stays active, and keep up-to-date on vaccines and vet appointments. But if you're not keeping up with your cat's dental health, your cat could face health issues in the future. Gum disease a… [+1873 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Julia Naftulin", "title": "Over 100 bubble tea balls got stuck in a teen’s digestive tract and made her constipated for nearly a week. Here’s how that’s possible.", "description": "Doctors found over 100 bubble tea balls in a 14-year-old girl's digestive system after she complained of stomach pain and couldn't poop for five days straight, according to Chinese outlet Shaoxing News. She told doctors that she drank one cup of bubble tea fi…", "url": "https://www.insider.com/can-you-digest-bubble-tea-boba-balls-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5d016ff6f2f47930101f30f4-1920-960.jpg", "publishedAt": "2019-06-12T21:34:00Z", "content": "Doctors found over 100 bubble tea balls in the digestive tract of 14-year-old Chinese girl, raising questions about the health implications of consuming the sugary drink and its accompanying balls. \r\n The girl complained about having stomach pain and being co… [+1979 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Gut microbes react to a meal — but have no use for nutrition labels", "description": "Changes in microbial populations are more closely associated with food type than the nutrient profile listed on the packet.", "url": "https://www.nature.com/articles/d41586-019-01850-y?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01850-y/d41586-019-01850-y_16786484.jpg", "publishedAt": "2019-06-13T00:00:00Z", "content": "Nearly 10,000 years ago, the rise of farming paved the way for large settlements in a swathe of the Middle East and might have protected one such settlement from certain parasites.\r\nPiers Mitchell at the University of Cambridge, UK, and his colleagues analyse… [+985 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Gut microbes react to a meal — but have no use for nutrition labels", "description": "Changes in microbial populations are more closely associated with food type than the nutrient profile listed on the packet.", "url": "https://www.nature.com/articles/d41586-019-01850-y", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01850-y/d41586-019-01850-y_16786484.jpg", "publishedAt": "2019-06-13T00:00:00Z", "content": "Nearly 10,000 years ago, the rise of farming paved the way for large settlements in a swathe of the Middle East and might have protected one such settlement from certain parasites.\r\nPiers Mitchell at the University of Cambridge, UK, and his colleagues analyse… [+985 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "BlackRock's Holl on Investing in Nutrition", "description": null, "url": "https://www.bloomberg.com/news/videos/2019-05-17/blackrock-s-holl-on-investing-in-nutrition-video", "urlToImage": null, "publishedAt": "2019-05-17T07:08:28Z", "content": null}, {"source": {"id": null, "name": "Healthline.com"}, "author": null, "title": "New Study Finds the Limit to Human Endurance - Healthline", "description": "New Study Finds the Limit to Human Endurance Healthline Is There a Limit to Human Endurance? Science Says Yes Lab Manager Magazine Scientists found the upper limit to human endurance, right before your body starts eating itself Business Insider Scientists Jus…", "url": "https://www.healthline.com/health-news/how-much-exercise-is-too-much-2", "urlToImage": "https://post.healthline.com/wp-content/uploads/2019/06/Desert_Biking_1200x628-facebook.jpg", "publishedAt": "2019-06-07T22:27:42Z", "content": "Exercise long enough and everyone hits the same wall, but the human body still allows you to work hard now and rest later.\r\nShare on PinterestEndurance events can stress the body in extreme ways. Getty Images\r\nAthletes competing in endurance events like the I… [+5006 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Fats & oils: Your grandfather's diet may not suit you - Times of India", "description": "Fats & oils: Your grandfather's diet may not suit you Times of India Both quantity and quality of the cooking oil is important.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/fats-oils-your-grandfathers-diet-may-not-suit-you/articleshow/69740448.cms", "urlToImage": "https://static.toiimg.com/photo/msid-69740520/69740520.jpg?797117", "publishedAt": "2019-06-11T10:52:11Z", "content": "Swamped with patients who have diabetes and are obese, it is often difficult for physicians to dispense advice on a single food item. For instance, often, we give no specific diktat on edible oils.\r\nSometimes, a casual advice when patients are leaving the cli… [+5474 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Erica Sweeney", "title": "How To Cook Healthier Collard Greens Without Losing Tradition", "description": "Collard greens are traditionally cooked with fatty, indulgent meats. But you can make them healthier — and still authentic, dietitians say.", "url": "https://www.huffpost.com/entry/healthy-collard-greens-soul-food_l_5cf69c39e4b0e8085e41804f", "urlToImage": "https://img.huffingtonpost.com/asset/5cf7ecde2500005f0ddbf129.jpeg?cache=JmXN00qbQZ&ops=1200_630", "publishedAt": "2019-06-13T09:45:12Z", "content": "When Kristen Gradney was growing up, her favorite dish was the mustard greens that her grandmother cooked. Her grandma “smothered down” the greens with whole pieces of chicken or other meat and served them with rice, she remembers.\r\n“I absolutely loved them,”… [+5795 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Saundra  Young", "title": "New USDA Nutrition Guidelines Will Cover Infants", "description": "When the U.S. Department of Agriculture releases new nutritional guidelines for the country in 2020, it is expected to include advice for breastfeeding and feeding children up to age 2.", "url": "https://www.webmd.com/diet/news/20190523/new-usda-nutrition-guidelines-will-cover-infants", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/reference_guide/baby_nutrition_101_ref_guide/650x350_baby_nutrition_101_ref_guide.jpg", "publishedAt": "2019-05-23T14:59:23Z", "content": "Amico is keeping an eye on any potential conflicts of interest and says the center has already reviewed advisory committee members. Some have visible links to the food and beverage industry. Making sure that those potential conflicts are managed during the pr… [+1775 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Cherlynn Low", "title": "Samsung’s $100 Galaxy Fit tracker focuses on the basics", "description": "It's been more than a year since Samsung last updated its Fit line of activity-tracking bands, and it's high time for a refresh. After first announcing the new Galaxy Fit in February alongside the new Galaxy S10 and Galaxy Watch Active, the company is finally…", "url": "https://www.engadget.com/2019/06/14/samsung-galaxy-fit-hands-on/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D1600%252C1068%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1068%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-06%252F81d820f0-8e25-11e9-9eb3-ccab23587c91%26client%3Da1acac3e1b3290917d92%26signature%3D80b913e5b8d18973dd7227833900a2efda973504&client=amp-blogside-v2&signature=9b0b49b40a7ba1e54a4cc9a28d1a3d9a8c6b6291", "publishedAt": "2019-06-14T04:01:00Z", "content": "Samsung's interface is so simple it's almost fool-proof: Just keep swiping sideways from the home screen to scroll through pages that show your daily progress, start a workout, measure your stress, track your sleep and display your notifications. On each page… [+1480 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Shoba Sreenivasan, Ph.D., and Linda E. Weinberger, Ph.D.", "title": "Psychological Nutrition for Caregivers", "description": "It is easy to neglect your emotional health as a caregiver, but running on empty puts you at risk for psychological malnutrition and burnout.", "url": "https://www.psychologytoday.com/ca/blog/emotional-nourishment/201906/psychological-nutrition-caregivers", "urlToImage": null, "publishedAt": "2019-06-04T06:23:24Z", "content": null}, {"source": {"id": null, "name": "Npr.org"}, "author": "Michaeleen Doucleff", "title": "Which Countries Are Best At Preventing Low Birth Weight? Which Need To Do More?", "description": "For the first time, the World Health Organization has estimated how well the world is doing to prevent low-weight births. The progress too slow, researchers say.", "url": "https://www.npr.org/sections/goatsandsoda/2019/05/15/723290601/which-countries-are-best-at-preventing-low-birth-weight-which-need-to-do-more", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2019-05-15T22:31:27Z", "content": "Six years ago, I was traveling in India, working on a story about measles. I was visiting a public hospital in New Delhi, when I walked into the waiting room and saw the tiniest baby I had ever seen.\r\nAn elderly woman perhaps a grandma was cradling the newbor… [+3343 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "A New Diet Study Confirms Your Worst Suspicions About Ultra-Processed Foods", "description": "A U.S. government-led trial may confirm the worst fears of anyone whose diet starts and ends in the frozen food aisle. It suggests that people who mostly eat ultra-processed foods will take in more calories and gain more weight than those who stick to mostly …", "url": "https://gizmodo.com/a-new-diet-study-confirms-your-worst-suspicions-about-u-1834818556", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--CY_bFjFK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ljvbut4qgz7soobze79w.jpg", "publishedAt": "2019-05-16T19:30:00Z", "content": "A U.S. government-led trial may confirm the worst fears of anyone whose diet starts and ends in the frozen food aisle. It suggests that people who mostly eat ultra-processed foods will take in more calories and gain more weight than those who stick to mostly … [+6522 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Julia Naftulin", "title": "Low-fat diets could lower the risk of dying of breast cancer. That may be bad news for keto fans.", "description": "Eating fewer fatty foods and more fruits, vegetables, and grains could decrease a person's risk of dying from breast cancer, according to a new study. These findings differ from the trendy keto diet. which suggests people eat high amounts of fat and few carbo…", "url": "https://www.insider.com/low-fat-diets-risk-dying-of-breast-cancer-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cddaab4e9f08a5bd84a722c-1920-960.jpg", "publishedAt": "2019-05-16T18:22:00Z", "content": "The trendy ketogenic diet, a high-fat low-carbohydrate eating plan, has gained loyal followers who say the diet has helped them lose weight quickly, but a new study suggests eating too much fat may not be the best idea when dealing with breast cancer \r\n Resea… [+3331 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "Processed foods make us fatter, lead to cancer, and are linked with early death. But what, exactly, is a processed food?", "description": "A new study released Thursday provides the first evidence that processed foods aren't just bad for our health, they actually cause people to eat more and gain weight. Previous research has shown that processed foods are linked to higher rates of cancer and ea…", "url": "https://www.businessinsider.com/what-is-processed-food-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cddc543021b4c0e5914c742-1920-960.jpg", "publishedAt": "2019-05-17T15:05:00Z", "content": "They're quick, they're easy, they're cheap, and they're really bad for us. \r\n Processed foods are under fresh scrutiny this week after a groundbreaking study from National Institutes of Health revealed that people on ultra-processed diets eat more calories an… [+3775 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Julia Naftulin", "title": "If you choose white meat over dark for health reasons, new research suggests you're making a mistake", "description": "Researchers looked at the health effects of consuming white meat, dark meat, and plant-based protein and found that white and dark meats have similar heart disease risks associated with eating them. Study participants who ate diets high in saturated fat, rega…", "url": "https://www.insider.com/is-white-meat-healthier-than-dark-meat-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf9240ff2f4795e0a7a9d7f-2732-1366.jpg", "publishedAt": "2019-06-06T14:31:00Z", "content": "If you choose white meat over dark meat during meals to protect your health, you may want to rethink your decision. \r\n Most people believe eating white meat is a healthier choice because it contains less saturated fat than dark meat, but a small study, publis… [+2885 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Stephen J. Bronner", "title": "The Entrepreneur Behind This Million-Dollar Protein Snack Brand Says Patience Is the Key to His Success", "description": "Iwon Organics launched in 2016, but its products are already in 5,000 stores.", "url": "https://www.entrepreneur.com/article/333846", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190516153254-IWONorganics-AllSnacks.jpeg", "publishedAt": "2019-05-20T13:00:00Z", "content": "Mark Samuel, founder of protein snack maker Iwon Organics, used his connections in the fitness industry in 2016 to score a national rollout in Vitamin Shoppe's 800 stores. But Samuel doesn't recommend other entrepreneurs attempt the same feat.\r\n\"Most people w… [+2809 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Richard Feloni", "title": "\"We know enough now to make the gamut of meat flavors\": Impossible Foods CEO on synthetic steaks and a future beyond burgers", "description": "Pat Brown is the founder and CEO of Impossible Foods, valued at $2 billion and best known for its popular Impossible Burger. Brown is a chemist and passionate environmentalist. He said his company has the capability to produce meat alternatives to products li…", "url": "https://www.businessinsider.com/impossible-foods-ceo-pat-brown-on-his-plans-beyond-burgers-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce46d65021b4c651a63ec75-1334-667.jpg", "publishedAt": "2019-05-24T13:37:36Z", "content": "The Impossible Burger is at the forefront of the meat-alternative craze. \r\n The plant-based patty that looks and tastes like beef is in more than 7,000 restaurants worldwide and is slated to be in every Burger King location in America by the end of the year. … [+2484 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Flavor-packed chicken tacos can be made in your Dutch oven", "description": "Braising in a Dutch oven is often used for long, slow cooking, but it's also well suited for quick weeknight-friendly dinners like this flavor-packed chicken taco filling.", "url": "https://news.yahoo.com/flavor-packed-chicken-tacos-made-dutch-oven-184441624.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/JcxRPJdZKUtC9ZoSg0a5Zg--~B/aD0zMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/64c1a3bf7ecd4fc2b06cebaa44fee5e9.jpg", "publishedAt": "2019-06-03T18:44:41Z", "content": "Braising in a Dutch oven is often used for long, slow cooking, but it's also well suited for quick weeknight-friendly dinners like this flavor-packed chicken taco filling.\r\nWe built a savory, well-balanced braising base with smoky chipotle in adobo, aromatic … [+2448 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "James Hamblin", "title": "There Is No Single ‘Cancer Diet’", "description": "You can’t starve cancer, but you might help treat it with food.", "url": "https://www.theatlantic.com/health/archive/2019/05/food-cancer/589714/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/mt/2019/05/RTXWFLF/facebook.jpg?1558362845", "publishedAt": "2019-05-20T15:16:00Z", "content": "Cancer cells grow in distinctive patterns that defy normal limitations. That growth activity requires energy, and so, cancer cells metabolize nutrients in different ways from the healthy cells around them. In attempt to kill the tumor without killing the norm… [+7215 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shaun Wooller", "title": "Your weekly food bill could rise after plans to hike taxes on pizza, chocolate and crisps - The Sun", "description": "Your weekly food bill could rise after plans to hike taxes on pizza, chocolate and crisps The Sun NANNY state plans to hike taxes on the nation's favourite treats could increase the cost of the weekly food shop. The country's top doctor hopes to slash obesity…", "url": "http://www.thesun.co.uk/news/9189573/food-shop-cost-junk-food-tax-hike/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000488668764.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2019-05-30T22:52:00Z", "content": "NANNY state plans to hike taxes on the nations favourite treats could increase the cost of the weekly food shop.\r\nThe countrys top doctor hopes to slash obesity rates by making the likes of pizza, crisps and chocolate more expensive.\r\n The UK's top doctor wis… [+3077 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Hilary Brueck", "title": "There's even more evidence drinking juice raises your risk of death", "description": "Real fruit juice is loaded with purely natural sugars, but that doesn't mean it's healthy.", "url": "https://www.insider.com/drinking-juice-raises-your-risk-of-death-and-its-easy-to-see-why-2019-5", "urlToImage": "https://amp.insider.com/images/5ce15d0993a1525ab4242773-1334-667.jpg", "publishedAt": "2019-05-20T00:07:45Z", "content": "Drinking fruit juice may seem like a tasty way to stay healthy, but science suggests that fruit juice could actually be out to harm us if consumed over a lifetime. \r\n Researchers in the US have some of the newest evidence on this front: revealing in JAMA that… [+3871 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "The Conversation", "title": "High-tech fishing gear could help save critically endangered right whales", "description": "Many fish, marine mammals and seabirds that inhabit the world’s oceans are critically endangered, but few are as close to the brink as the North Atlantic right whale ( Eubalaena glacialis ) Only about 411 of these whales exist today, and at their current rate…", "url": "https://mashable.com/article/high-tech-fishing-gear-could-help-save-critically-endangered-right-whales/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F28%252Ffe%252Fbd1ad9095f214ec18d7a1b4a9b1ec914.ef2a2.jpg%252F1200x630.jpg?signature=VgwkmCyRCZK5yU5r3rIzrNaMK4o=", "publishedAt": "2019-05-28T20:05:52Z", "content": "Many fish, marine mammals and seabirds that inhabit the worlds oceans are critically endangered, but few are as close to the brink as the North Atlantic right whale (Eubalaena glacialis). Only about 411 of these whales exist today\r\n, and at their current rate… [+7484 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Shopping Content By Salon Marketplace", "title": "This DNA kit can help you make better health decisions", "description": "Get a diet and nutrition plan that's designed to work for your body", "url": "https://www.salon.com/2019/06/11/this-dna-kit-can-help-you-make-better-health-decisions/", "urlToImage": "https://media.salon.com/2019/06/sale_19790_primary_image.jpg", "publishedAt": "2019-06-11T07:00:47Z", "content": "Summer is here, and you might have spent the past few months working hard to get fit. It can be especially frustrating to feel as though no matter how well you stick to a diet and try any number of workouts that your friends swear by, you still don't get the … [+968 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "How do you fine tune a major winner? Meet the man preparing Koepka & Johnson for US Open", "description": "Fitness coach and biomechanics expert Joey Diovisalvi tells BBC Sport how he gets the best from Brooks Koepka and Dustin Johnson - the world's top two golfers.", "url": "https://www.bbc.co.uk/sport/golf/48578916", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/B95B/production/_107315474_dj_kopeka_getty.jpg", "publishedAt": "2019-06-12T22:33:25Z", "content": "Joey Diovisalvi works with the world's top two golfers in Brooks Koepka (right) and Dustin Johnson (left)\r\nThere will be big hitters and booming drives aplenty at Pebble Beach when the US Open begins on Thursday.\r\nProfessional golfers are now finely tuned ath… [+6525 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Anna Medaris Miller", "title": "A graphic comparing a bottle of soda to 6 donuts is going viral and it's making people want to eat more pastries", "description": "A viral graphic shows how many donuts-worth of sugar are in various drinks. Some Twitter users think the image makes donuts look relatively healthy. Nutrition professionals caution that added sugars are different than naturally occurring sugars, and that adde…", "url": "https://www.insider.com/graphic-chart-compares-soda-donuts-sugar-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ceda058f2f4795e8e144761-1920-960.jpg", "publishedAt": "2019-05-28T20:55:38Z", "content": "How many donuts are in your drink? It's not a question you've likely asked yourself before — unless you've accidentally dropped your cruller in your coffee. \r\n But a viral graphic Tweeted by Mark Mulligan, a physical therapist and founder of Anywhere Health, … [+2359 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Genzlinger", "title": "Leann Birch, Who Knew How to Get a Child to Eat Peas, Dies at 72", "description": "Her research into childhood nutrition and obesity shed new light on not just what children eat, but also why.", "url": "https://www.nytimes.com/2019/06/02/obituaries/leann-birch-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/05/31/obituaries/31Birch/merlin_155652882_ff331ec2-716f-4518-b16c-5ae07524657a-facebookJumbo.jpg", "publishedAt": "2019-06-02T17:11:31Z", "content": "Dr. Birch joined the faculty of the University of Illinois, Urbana-Champaign, in 1976. She taught both human development and nutritional sciences, an indication of the cross-disciplinary approach that would characterize her research. In 1992 she moved to Penn… [+1580 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "New pathogens in beef and cow's milk products", "description": "Researchers have presented findings on new infection pathogens that go by the name of 'Bovine Milk and Meat Factors' (BMMF). According to these findings, the previously unknown pathogen can cause inflammations.", "url": "https://www.sciencedaily.com/releases/2019/06/190611102708.htm", "urlToImage": null, "publishedAt": "2019-06-11T14:27:08Z", "content": "According to the DKFZ, they have been detected up to now in cow's milk, cow's milk products and the blood serum of healthy cattle. From the scientific findings made up to now, it seems possible that an indirect connection could be interpreted between the cons… [+1733 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "No onion, no garlic midday meals: Nutrition institute stands by its report", "description": "Fruits, vegetables can be used interchangeably, notes the report", "url": "https://www.thehindu.com/news/national/karnataka/no-onion-no-garlic-midday-meals-nutrition-institute-stands-by-its-report/article27135232.ece", "urlToImage": "https://www.thehindu.com/news/national/karnataka/8j7un/article27135231.ece/ALTERNATES/LANDSCAPE_615/MIDDAYMEALSTHNAK", "publishedAt": "2019-05-15T08:52:20Z", "content": "The National Institute of Nutrition said on Tuesday that it stands by its findings certifying mid-day meals sans onion and garlic provided by Akshay Patra Foundation (APF) in Karnataka schools as compliant with nutritional norms laid down by the State governm… [+2525 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Button batteries can rapidly damage stomach lining before symptoms appear", "description": "Damage to the lining of the stomach can occur quickly when children swallow button batteries; therefore, clinicians should consider prompt endoscopic removal, even when the child is symptom free and the battery has passed safely through the narrow esophagus, …", "url": "https://www.sciencedaily.com/releases/2019/05/190518172524.htm", "urlToImage": null, "publishedAt": "2019-05-18T21:25:24Z", "content": "Damage to the lining of the stomach can occur quickly when children swallow button batteries; therefore, clinicians should consider prompt endoscopic removal, even when the child is symptom free and the battery has passed safely through the narrow esophagus, … [+2460 chars]"}, {"source": {"id": null, "name": "Mindbodygreen.com"}, "author": "Caroline Muggia", "title": "Want To Eat Better? New Study Closely Links Good Sleep & Nutrition", "description": "Here's what you need to know about the link between sleep and nutrition.", "url": "https://www.mindbodygreen.com/articles/getting-more-sleep-each-night-may-be-the-key-to-better-nutrition", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/t62plyr6qjwm8u566.jpg", "publishedAt": "2019-06-09T17:45:00Z", "content": "There's nothing worse than not being able to function the day after a terrible night's sleep. You feel tired and almost sick, but it's more than just feeling \"off.\" Not getting enough sleepaka less than seven hoursmay negatively affect cognitive functioning, … [+2576 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Brittany A. Roston", "title": "Study links people who don’t get enough sleep to poor nutrition", "description": "Poor sleep has been linked to poor nutrition, but it’s unclear why the two may appear together. The association between the issues was revealed in a study that looked at National Health and Nutrition Examination Survey data, according to the American Society …", "url": "https://www.slashgear.com/study-links-people-who-dont-get-enough-sleep-to-poor-nutrition-09579778/", "urlToImage": "https://edge.slashgear.com/wp-content/uploads/2019/06/vitamin-d-gel-capsules-and-natural-sources-of_main.jpg", "publishedAt": "2019-06-09T13:27:43Z", "content": "Poor sleep has been linked to poor nutrition, but it’s unclear why the two may appear together. The association between the issues was revealed in a study that looked at National Health and Nutrition Examination Survey data, according to the American Society … [+1332 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Tom Frieden", "title": "Why it's time for a total ban on trans fat – the 'tobacco of nutrition'", "description": "Every day billions of people around the world unknowingly eat food that contains a toxic chemical additive.", "url": "https://www.telegraph.co.uk/news/0/time-total-ban-trans-fat-tobacco-nutrition/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/22/TELEMMGLPICT000004467108-xlarge_trans_NvBQzQNjv4BqnoTNfZEEKJkRDex-nOY8dbL67Ba0szicH_vB3nAfHm8.jpeg", "publishedAt": "2019-05-22T13:16:37Z", "content": "Every day billions of people around the world unknowingly eat food that contains a toxic chemical additive. And more than half a million die each year because of it.\r\nThis additive  artificial trans fat  clogs arteries and leads to heart attacks, and it doesn… [+715 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Adele Peters", "title": "Insects might be the key to making lab-grown meat take off", "description": "It sounds crazy, but insect cells grown in a lab could be made into futuristic foods like faux lobster–and they would leave very little environmental footprint in the process. Startups selling chips or protein bars made with crickets tout the environmental ad…", "url": "https://www.fastcompany.com/90358225/insects-might-be-the-key-to-making-lab-grown-meat-take-off?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/p-1-90358225-insects-might-be-the-key-to-making-lab-grown-meat-take-off.jpg", "publishedAt": "2019-06-03T14:00:05Z", "content": "Startups selling chips or protein bars made with crickets tout the environmental advantages of insects compared to raising cows or chickens. But the market for insects as food, while growing, is still tiny. A new study suggests that insects could enter mainst… [+2872 chars]"}, {"source": {"id": null, "name": "Goodmorningamerica.com"}, "author": "Catherine Thorbecke", "title": "7 dietary factors may increase your risk of cancer: Study", "description": "Low whole grain, low dairy intake and other dietary factors, may increase risk of cancer, according to a new study.", "url": "https://www.goodmorningamerica.com/wellness/story/dietary-factors-increase-risk-cancer-study-63215976", "urlToImage": "https://s.abcnews.com/images/Technology/carbs-gty-er-190319_hpMain_16x9_992.jpg", "publishedAt": "2019-05-23T13:15:21Z", "content": "Seven dietary factors may increase the risk of cancer for American adults aged 20 and over, according to a new study published in the JNCI Cancer Spectrum medical journal.\r\nThe study, conducted by researchers at Tuft's Friedman School of Nutrition Science and… [+2390 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Janaki Jitchotvisut", "title": "A man shopped only in convenience stores for a month to try and see what it's like to live in a food desert — here's what happened", "description": "One researcher, Mark Bonica, tried to eat solely from convenience stores for a month. It's possible to eat a somewhat healthy diet solely from convenience store food, but it often takes a lot of time, careful planning, food preparation, and shopping at multip…", "url": "https://www.insider.com/eating-in-simulated-food-desert-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce85a904cf2704d591a7b74-1920-960.jpg", "publishedAt": "2019-05-24T20:55:31Z", "content": "Living in food deserts — which the USDA defines as urban and rural areas where access to food that is both affordable and nutritious is severely limited— is a problem that is disproportionately faced by the poorest and most vulnerable communities among us. \r\n… [+10136 chars]"}, {"source": {"id": null, "name": "Behance.net"}, "author": null, "title": "Gymondo", "description": "In 2018 Gymondo ? Germany's #1 online fitness service catering to women who want to lead a fit & positive life ? updated their brand strategy. The old identity did not reflect the new direction & was in need of an update. The new identity is positive, energiz…", "url": "https://www.behance.net/gallery/80356475/Gymondo?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+behance%2Fvorr+%28Behance+Network+Featured+Projects%29", "urlToImage": null, "publishedAt": "2019-05-19T07:00:32Z", "content": null}, {"source": {"id": null, "name": "Instructables.com"}, "author": "koushikimehra", "title": "DIY Mini Garden - With Succulents and Cactus", "description": "<!--dda7bd42579b4dc0937c45f979fc5c69-->Mini Garden - An artistic project to make a miniature garden, with small plants, miniature furniture, birds or animal figures.Mini garden also can be kept in indoor or outdoor depending on the plants.But, I recommend for…", "url": "https://www.instructables.com/id/DIY-Mini-Garden-With-Succulents-and-Cactus/", "urlToImage": "https://cdn.instructables.com/ORIG/FYX/LRD5/JVUTFNZY/FYXLRD5JVUTFNZY.jpg?width=2100", "publishedAt": "2019-05-20T19:24:09Z", "content": "Succulents and cactus both need well draining soil, with some nutrients.\r\nMixture should be very porous, so that water flows easily. I made my succulents soil mix at home with 4 ingredients\r\nCoco peat\r\nSand or small stone chips\r\nperlite \r\nCompost \r\nFirst thre… [+903 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Charlotte Hsu", "title": "You are what you eat: How the pursuit of carbs changed mammals' genes and saliva", "description": "Starch, a complex carbohydrate, is a vital source of nutrition for many mammals. Humans farm it in the form of rice, wheat, corn, potatoes and oats. Rats comb our garbage piles for scraps of pizza and bread. Wild boars root for tubers.", "url": "https://phys.org/news/2019-05-pursuit-carbs-mammals-genes-saliva.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/youarewhatyo.png", "publishedAt": "2019-05-14T14:33:18Z", "content": "Starch, a complex carbohydrate, is a vital source of nutrition for many mammals. Humans farm it in the form of rice, wheat, corn, potatoes and oats. Rats comb our garbage piles for scraps of pizza and bread. Wild boars root for tubers.\r\nNow, a new study is pr… [+7179 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Tonight make salmon that flakes apart in buttery chunks", "description": "As we learned with recipes for beef, lamb, pork, and poultry, cooking en cocotte_cooking a protein in a covered pot with little to no liquid_concentrates flavor.", "url": "https://news.yahoo.com/tonight-salmon-flakes-apart-buttery-chunks-160209334.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/F.JczZZB0rhqW.zDb.ivWg--~B/aD0zMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/637fcd013a9940d38d6422d30843173f.jpg", "publishedAt": "2019-05-20T16:02:09Z", "content": "As we learned with recipes for beef, lamb, pork, and poultry, cooking en cocotte_cooking a protein in a covered pot with little to no liquid_concentrates flavor.\r\nWe were skeptical that the technique would successfully translate to fish. Fish cooks quickly; w… [+3104 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Teaching the Children to Cook", "description": "A professor of nutrition says the benefits are manifold.", "url": "https://www.nytimes.com/2019/06/07/opinion/letters/food-cooking-children.html", "urlToImage": "https://static01.nyt.com/images/2019/06/02/opinion/sunday/02tamarkin/merlin_155736003_58dae2b3-24d8-4c8e-b390-09d7d25e7fdf-facebookJumbo.jpg", "publishedAt": "2019-06-07T17:56:30Z", "content": "To the Editor:\r\nRe Dont Save Me From Cooking (Sunday Review, June 2): \r\nDavid Tamarkin makes some important points about the disadvantages of subscribing to home delivery food services rather than preparing food at home. Notwithstanding the questionable time … [+687 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "E.A. Crunden", "title": "Senate agriculture climate change hearing reinforces industry resistance to action", "description": "A Tuesday Senate hearing reviewing the impact of climate change on agriculture featured a strong defense of industry, at a time when the role of the sector in contributing to global warming is under growing scrutiny. The morning panel, hosted by the Senate Ag…", "url": "https://thinkprogress.org/agriculture-climate-change-industry-resistance-green-new-deal-farmers-3cf95d88c7ab/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/05/GettyImages-1128727689.jpg?w=1920&h=1080&crop=1", "publishedAt": "2019-05-21T17:08:08Z", "content": "A Tuesday Senate hearing reviewing the impact of climate change on agriculture featured a strong defense of industry, at a time when the role of the sector in contributing to global warming is under growing scrutiny.\r\nThe morning panel, hosted by the Senate A… [+5461 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Alicia Kelso, Contributor, Alicia Kelso, Contributor https://www.forbes.com/sites/aliciakelso/", "title": "McDonald's Hits Happy Meal Nutrition Goals Ahead Of Schedule", "description": "The company announced today the realization of its global commitments developed with the Alliance for a Healthier Generation in 2013 to better promote fruit, vegetables, low-fat dairy and water in 20 major markets representing about 85% of the system's sales.", "url": "https://www.forbes.com/sites/aliciakelso/2019/05/14/mcdonalds-hits-happy-meal-nutrition-goals-ahead-of-schedule/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Faliciakelso%2Ffiles%2F2019%2F05%2Fmcd-happy-meal-1200x800.jpg", "publishedAt": "2019-05-14T12:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nA McDonald's Happy Meal with milk and apple slices.\r\nSource: McDonald's\r\nMcDonalds latest Happy Meal iteration is complete, and well ahead of schedule. The company announced today the realization of its … [+13610 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Stephen J. Bronner", "title": "Online Grocery Recommendations Are Lacking. 3 Young Entrepreneurs Have Created an AI-Powered Solution.", "description": "Most grocer sites ask if you'd like some toilet paper with your carrots. Halla employs AI to recommend products that make sense.", "url": "https://www.entrepreneur.com/article/334976", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190607195903-GettyImages-507903484.jpeg", "publishedAt": "2019-06-11T13:00:00Z", "content": "Not many people buy their groceries online -- only about 3 percent of all food purchases are made through the internet, according to a report by Deutsche Bank. But those rates will steadily increase over the coming years, according to analysts, and one area o… [+4119 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Claudia Koerner", "title": "A Lunch Lady Served Food To A Student Who Couldn't Pay His Meal. Then She Was Fired.", "description": "After outcry, she was offered her job back — but she won't be taking it. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/claudiakoerner/lunch-lady-fired-after-student-pay-meal-job", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2019-05/17/22/campaign_images/buzzfeed-prod-web-03/a-lunch-lady-was-fired-for-serving-an-8-meal-to-a-2-25743-1558147589-0_dblbig.jpg", "publishedAt": "2019-05-18T02:52:20Z", "content": "A New Hampshire lunch lady served a high school student who couldn't pay for his meal $8 worth of food which cost her the job.\r\nBonnie Kimball, who had worked at Mascoma Valley Regional High School for four years, told the New Hampshire Union-Leader she knew … [+2231 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Sara Lindberg", "title": "6 embarrassing workout questions, answered", "description": "Exercise can bring up some embarrassing questions for athletes of all levels. Smelly workout clothes, gas during class, loads of sweat, and saddle sore are normal — and can be managed. Exercise can cause breakouts, but so can your post-workout brunch routine.…", "url": "https://www.insider.com/does-exercise-cause-acne-and-other-embarrassing-workout-questions-answered-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5d010fdff2f479293d658537-960-480.jpg", "publishedAt": "2019-06-12T14:44:07Z", "content": "Exercise produces a lot more than endorphins. It also stirs up a variety of questions — some more embarrassing than others. And whether you're new to working out or you hold the record for most consecutive days at the gym, you're bound to have a question or t… [+5134 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": "Robin Fears, Volker ter Meulen", "title": "[Correspondence] Scientific opportunities for nutrition security", "description": "In an Editorial1 about the policy brief by the Global Panel on Agriculture and Food Systems for Nutrition,2 the Editors note some important issues when addressing nutrient losses in food systems and, rightly, call for more to be done to motivate multisectoral…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)30223-5/fulltext?rss=yes", "urlToImage": "https://www.thelancet.com/cms/attachment/d0057039-9cbf-44e8-99cc-18afead380e4/fx1.jpg", "publishedAt": "2019-05-30T22:35:35Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2019 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Lara Walsh", "title": "Collagen supplements may not be as effective as you think, but there are other ways to incorporate this important protein into your diet", "description": "Even though research about the effectiveness of collagen supplements is still in its early stages, pills and powders that contain collagen have gained popularity in recent years. Collagen is an important part of one's skin — it provides structural support and…", "url": "https://www.insider.com/do-collagen-supplements-actually-work-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ceebb384cf27072a702a38f-2732-1366.jpg", "publishedAt": "2019-05-29T17:02:07Z", "content": "Collagen supplements are trendy wellness items that have been advertised as being able to give someone plump skin, shiny hair, and strong bones. \r\n According to findings from Nutrition Business Journal, US buyers spent an estimated $122 million on collagen su… [+5339 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Carlos Gil", "title": "How Entertainers and Influencers Can Earn Passive Income", "description": "Here's how to make money when you're not technically working.", "url": "https://www.entrepreneur.com/video/334241", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190523182959-JoshMartincopy.jpeg", "publishedAt": "2019-05-28T20:30:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nWhether you’re a professional athlete, a fitness expert, a musician or anyone else with a specific set of sought-after skills or products, you don’t always have to be grinding away to earn income… [+3812 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Cheyenne Lentz", "title": "Millions of kids go hungry in the US every summer without school lunches. These striking facts reveal the scale of the problem.", "description": "In the US, 22 million kids get free or reduced-price lunch during the school year. These school-lunch programs are an important source of food for many children. But during summer vacation, fewer than 4 million kids are able to access the summer meals program…", "url": "https://www.businessinsider.com/free-school-lunch-kids-summer-hunger-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ced5d8711e2050a4d5f9b24-2732-1366.jpg", "publishedAt": "2019-06-03T16:26:13Z", "content": "In the United States, over 12 million children live in food-insecure homes. That term refers to households in which there isn't enough food available for everyone in the family to lead a healthy life, according to national campaign No Kid Hungry. \r\n To suppor… [+5181 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "After a devastating failure, the CEO of the largest health system in New York wants to get back into the health insurance business", "description": "Northwell Health in 2013 launched a health plan for the Affordable Care Act's market in New York. A few years later, the largest health system in New York decided to exit the market, after experiencing major financial losses. Even so, CEO Michael Dowling hope…", "url": "https://www.businessinsider.com/northwell-health-ceo-michael-dowling-on-owning-a-health-plan-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cf828a611e20525992c5033-2732-1366.jpg", "publishedAt": "2019-06-13T14:42:00Z", "content": "Michael Dowling has tried his hand at operating an insurance plan. \r\n Dowling is the CEO of Northwell Health, which operates 23 hospitals and 750 other healthcare sites. The health system made $11.5 billion in revenue in 2018, making it the largest by revenue… [+3865 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Common food additive may harm gut health: Study", "description": "Published in the journal Frontiers in Nutrition, the study investigated the health impacts of food additive E171 (titanium dioxide nanoparticles) which is used in high quantities in foods and some medicines as a whitening agent.", "url": "https://indianexpress.com/article/lifestyle/health/common-food-additive-may-harm-gut-health-study-5726725/", "urlToImage": "https://images.indianexpress.com/2019/05/good-gut-759.jpg?w=759", "publishedAt": "2019-05-14T09:06:58Z", "content": "While nanoparticles have been commonly used in medicines, foods, clothing, and other applications, the possible impacts of nanoparticles, especially their long term effects, are still poorly understood. (Source: Getty Images/ Thinkstock)\r\nA common additive us… [+3095 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Parul", "title": "Chandigarh community kitchens: When food becomes building block for new ties", "description": ". For instance, at ‘Parshada’ in Sector 18, education-based activities, centred on food, wellness and nutrition get people from various walks of life together, encouraging them to share their experiences, expertise and recipes.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-community-kitchens-when-food-becomes-building-block-for-new-ties-5776599/", "urlToImage": "https://images.indianexpress.com/2019/06/chand-comm.jpg?w=759", "publishedAt": "2019-06-12T06:31:13Z", "content": "A community meal at Parshada. Express\r\nThe kitchen is the heart of many stories, shared memories, aromas and flavours that take you back in time and connect you with history, personal and collective. In Chandigarh, it seems to be the building block for small … [+3094 chars]"}, {"source": {"id": null, "name": "Stylemepretty.com"}, "author": "Lauren Megerdichian", "title": "How to Look Wedding Ready Without Cutting Carbs (Seriously!)", "description": "Who's sick of crazy no-carb diets and strict rules for every meal? We know WE sure are!! That being said, we couldn't be more grateful to celebrity nutritionist, Cara Clark, for creating a non-diet approach to nutrition. She truly believes that food can heal …", "url": "https://www.stylemepretty.com/2019/05/14/how-to-look-wedding-ready-without-cutting-carbs-seriously/", "urlToImage": "https://smp-is.stylemepretty.com/submissions/uploads/332583/5cc1e973636af$!900x467.JPG", "publishedAt": "2019-05-14T16:00:47Z", "content": null}, {"source": {"id": null, "name": "Rlslog.net"}, "author": "Silva", "title": "Better Nutrition – June 2019-P2P", "description": "The world’s leading health food store shopping magazine. We deliver the latest natural health information and natural healing advice from the country’s top natural health, nutrition, and lifestyle experts. Always look and feel your best naturally with the hel…", "url": "http://www.rlslog.net/better-nutrition-june-2019-p2p/", "urlToImage": null, "publishedAt": "2019-05-25T03:19:13Z", "content": "The world’s leading health food store shopping magazine. We deliver the latest natural health information and natural healing advice from the country’s top natural health, nutrition, and lifestyle experts. Always look and feel your best naturally with the hel… [+173 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Is it that time of the month again? How do periods affect athletes & why are they monitored?", "description": "Periods might not turn wine into vinegar but can they affect an athlete's performance? BBC Sport looks at how athletes and doctors cope with menstruation.", "url": "https://www.bbc.co.uk/sport/48243310", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/144CB/production/_106974138_quekmccolgangreenwood_getty.jpg", "publishedAt": "2019-05-21T05:13:46Z", "content": "Media playback is not supported on this device\r\nIs it that time of the month again? - Hockey players talk periods\r\nWhat can turn wine into vinegar, kill bees, cause bacon to become rancid, and even dull a steel sword?\r\nThe answer, according to various theorie… [+8474 chars]"}, {"source": {"id": "nhl-news", "name": "NHL News"}, "author": "Tom Gulitti", "title": "Chara will be leaned on by Bruins in Game 6 of Cup Final - NHL.com", "description": "Chara will be leaned on by Bruins in Game 6 of Cup Final NHL.com Bouwmeester likely to get first pass if Blues win Stanley Cup Sportsnet.ca This year’s Stanley Cup final is far more interesting than it appears, thanks to the St. Louis Blues The Globe and Mail…", "url": "https://www.nhl.com/news/zdeno-chara-will-be-leaned-on-by-bruins-in-game-6-of-cup-final/c-307762098", "urlToImage": "https://nhl.bamcontent.com/images/photos/307762860/1024x576/cut.jpg", "publishedAt": "2019-06-08T22:53:11Z", "content": "ST. LOUIS -- The Boston Bruins know they can count on Zdeno Chara to be there when they need him most.If there were any questions about that, the Bruins captain answered them when he played in Game 5 of the Stanley Cup Final against the St. Louis Blues on Thu… [+4264 chars]"}, {"source": {"id": null, "name": "Torontosun.com"}, "author": null, "title": "Is the 'dad bod' just a dressed-up beer belly? - Toronto Sun", "description": "Is the 'dad bod' just a dressed-up beer belly? Toronto Sun What the heck is a 'dad bod'?With Father's Day imminent, it seemed wise to investigate this odd phenomenon and find out if men with children are less fit than...", "url": "https://torontosun.com/news/local-news/is-the-dad-bod-just-a-dressed-up-beer-belly", "urlToImage": "https://postmediatorontosun.files.wordpress.com/2019/06/nico-alfieri-e1560103333122.jpeg", "publishedAt": "2019-06-09T18:03:00Z", "content": "What the heck is a ‘dad bod’?\r\nWith Father’s Day imminent, it seemed wise to investigate this odd phenomenon and find out if men with children are less fit than men without.\r\nLuckily, theNew York Times found out for us.\r\nTurns out fathers are generally about … [+3559 chars]"}, {"source": {"id": null, "name": "Theguardian.pe.ca"}, "author": "Liz Braun", "title": "Is the 'dad bod' just a dressed-up beer belly? - The Guardian", "description": "Is the 'dad bod' just a dressed-up beer belly? The Guardian Is the 'dad bod' just a dressed-up beer belly? Toronto Sun New dads can find it hard to access support. This is where other fathers meet mates to talk to ABC News View full coverage on Google News", "url": "https://www.theguardian.pe.ca/living/is-the-dad-bod-just-a-dressed-up-beer-belly-320348/", "urlToImage": "https://www.theguardian.pe.ca/media/photologue/photos/cache/httpsapipddataservicescomlistsfeedbd61e8a1-01c5-46dd-a2ce-8f45f225e363_medium", "publishedAt": "2019-06-09T18:54:21Z", "content": "What the heck is a ‘dad bod’?\r\nWith Father’s Day imminent, it seemed wise to investigate this odd phenomenon and find out if men with children are less fit than men without.\r\nLuckily, the New York Times found out for us.\r\nTurns out fathers are generally about… [+3601 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": "Shi Davidi", "title": "Guerrero Jr.’s importance to Blue Jays underscored by off-day controversy - Sportsnet.ca", "description": "Guerrero Jr.’s importance to Blue Jays underscored by off-day controversy Sportsnet.ca Injury-plagued Blue Jays drop home series with Red Sox as difficult month stretches on The Globe and Mail Steve Pearce leads Red Sox hit parade in rout of Blue Jays CBC.ca …", "url": "https://www.sportsnet.ca/baseball/mlb/guerrero-jr-s-importance-blue-jays-underscored-off-day-controversy/", "urlToImage": "https://assets2.sportsnet.ca/wp-content/uploads/2019/05/blue-jays-vlad-guerrero-jr-celebrates-home-run.jpg", "publishedAt": "2019-05-23T20:29:00Z", "content": "TORONTO In trying to rationalize the emotionally hypercharged reaction to Vladimir Guerrero Jr.s rest day this week, perhaps the most revelatory insight to be drawn is in precisely how important the slugging third baseman has already become to the teams fanba… [+4588 chars]"}, {"source": {"id": null, "name": "Lethbridgenewsnow.com"}, "author": null, "title": "Stephan family midwife/nurse called to testify on day one of re-trial - Lethbridge News Now", "description": "Stephan family midwife/nurse called to testify on day one of re-trial Lethbridge News Now David and Collet Stephan treated dying toddler with herbs and religious blessings, retrial hears CBC News Second trial to start for Alberta couple in son's meningitis de…", "url": "https://lethbridgenewsnow.com/2019/06/03/stephan-family-midwifenurse-called-to-testify-on-day-one-of-re-trial/", "urlToImage": "https://media.socastsrm.com/wordpress/wp-content/blogs.dir/2310/files/2019/06/e1055dd6-08b3-4495-9590-63081ddd2f70.jpg", "publishedAt": "2019-06-03T22:41:41Z", "content": "While on Friday, May 31, David Stephan told reporters he and his wife Collet were not prepared for the trial to begin, their previous trial lawyer, Shawn Buckley, arrived to help the couple with cross-examinations, to speak to the elements of the case, and to… [+3893 chars]"}]}