{"status": "ok", "totalResults": 3922, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iran will defend itself against any aggression: foreign minister", "description": "Iranian Foreign Minister Javad Zarif said on Sunday that Tehran would strongly defend itself against any military or economic aggression and called on European states to do more to preserve a nuclear agreement his country signed with them.", "url": "https://www.reuters.com/article/us-usa-iran-iraq-idUSKCN1SW07F", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190526&t=2&i=1391041992&w=1200&r=LYNXNPEF4P088", "publishedAt": "2019-05-26T08:14:49Z", "content": "BAGHDAD (Reuters) - Iranian Foreign Minister Javad Zarif said on Sunday that Tehran would strongly defend itself against any military or economic aggression and called on European states to do more to preserve a nuclear agreement his country signed with them.… [+547 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "What's So Special About Human Screams? Ask a Screamologist", "description": "A better understanding of the acoustics of screaming could help scientists understand how and why humans shriek—and add a new dimension to the surveillance state!", "url": "https://www.wired.com/story/whats-so-special-about-human-screams-ask-a-screamologist/", "urlToImage": "https://media.wired.com/photos/5cdb2b694ef5ad318eea392e/191:100/pass/science_scream_816816642.jpg", "publishedAt": "2019-05-15T14:00:00Z", "content": "I scream, you scream, we all scream. For ice cream, sure, but also for fear, excitement, sexual pleasure, pain, anger, andif online commenters are to be believedmemes . Screaming is exhibited by many animals, but no species uses this extreme vocalization in a… [+5872 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "SANDRA E. GARCIA", "title": "F.A.A. Warns U.S. Aircraft of ‘Increasing’ Risk Over Persian Gulf", "description": "Amid escalating tensions between the United States and Iran, the agency directed airliners to exercise caution when flying in the region to avoid “misidentification.”", "url": "https://www.nytimes.com/2019/05/18/world/middleeast/airlines-faa-persian-gulf.html", "urlToImage": "https://static01.nyt.com/images/2019/05/18/world/18xp-airspace-1/merlin_154176219_2f3c6dca-e40f-4991-a941-9ca700375ca7-facebookJumbo.jpg", "publishedAt": "2019-05-18T16:49:12Z", "content": "The unconfirmed attacks came as the United States tightened its sanctions against Iran and sent bombers, an aircraft carrier and an antimissile battery to the Persian Gulf to offset what the Trump administration called a heightened risk of Iranian aggression.… [+983 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Iranian vessel removed mine from damaged oil tanker, US officials say - Fox News", "description": "Iranian vessel removed mine from damaged oil tanker, US officials say Fox News Footage US military claims shows Iranian patrol boat removing limpet mine from tanker Guardian News Gulf of Oman tankers attacked: Live updates CNN The Iranian Tanker Attacks The W…", "url": "https://www.foxnews.com/us/fox-news-first-friday-june-14-2019", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/DOTCOM_1280X720_major_clue.png", "publishedAt": "2019-06-14T08:45:46Z", "content": "Good morning and welcome to Fox News First. Here's what you need to know today...\r\nIranian vessel removed unexploded mine from stricken oil tanker in Gulf of Oman, US officials sayAn Iranian vessel removed an unexploded mine that had been attached to a Japane… [+4648 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alan Blinder", "title": "Dozens Injured in Memphis Unrest After Man Is Killed by Marshals", "description": "At least one federal marshal opened fire on Wednesday night, killing a man, and more than two dozen police officers were injured in confrontations later.", "url": "https://www.nytimes.com/2019/06/13/us/memphis-shooting-frayser.html", "urlToImage": "https://static01.nyt.com/images/2019/06/13/us/13memphis/13memphis-facebookJumbo.jpg", "publishedAt": "2019-06-13T14:12:10Z", "content": "According to Mr. Rallings and local television stations, some of the demonstrators threw rocks and bricks. In at least one instance, a man repeatedly slammed a chair against a police car.\r\nWeve been very supportive of protests, but we will not allow any acts … [+1245 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/zachary-halaschak", "title": "Top Iranian official: Iran will 'defend against any war efforts' - Washington Examiner", "description": "Top Iranian official: Iran will 'defend against any war efforts' Washington Examiner Iraq vows to stand with Iran amid US-Iran tension Aljazeera.com Iranian foreign minister: 'We will defend against any war efforts' | TheHill The Hill George F. Will: Trump, O…", "url": "https://www.washingtonexaminer.com/news/top-iranian-official-iran-will-defend-against-any-war-efforts", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/3f4f7ec/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F56%2F37%2F6de8ef534ecabe2de7c5992137ff%2Fap-19146284908078.jpg", "publishedAt": "2019-05-26T19:02:00Z", "content": "Iranian Foreign Minister Mohammad Javad Zarif said Sunday his country would defend itself against any potential war that might arise between the U.S. and Iran. \r\nZarif, speaking in Baghdad alongside Iraqi Foreign Minister Mohammed al-Hakim, said that Iran wou… [+1157 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Ottawa News Bureau Online Producer", "title": "If Trudeau called about detainees, Chinese president wouldn't pick up: ex-ambassador - CTV News", "description": "If Trudeau called about detainees, Chinese president wouldn't pick up: ex-ambassador CTV News Trudeau says Chinese aggression ‘not something we need to continue to allow’ Global News Trudeau toughens tone against China as Canadian delegation presses for relea…", "url": "https://www.ctvnews.ca/politics/if-trudeau-called-about-detainees-chinese-president-wouldn-t-pick-up-ex-ambassador-1.4430809", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4431668.1558483913!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2019-05-22T00:17:00Z", "content": "Former Canadian Ambassador to China Guy Saint-Jacques says he has limited expectations a Canadian delegation currently on the ground in China will successfully lead to the release of two detained Canadians.\r\nDuring an interview on CTVs Power Play on Tuesday, … [+4344 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nico Lang", "title": "Queer Muslims Are Still Rare on TV. One Writer Wants to Change That.", "description": "A recent episode of the CBS drama “The Red Line” featured a gay romance involving a Muslim character. Fawzia Mirza, the episode’s writer, discusses how it came to be.", "url": "https://www.nytimes.com/2019/05/29/arts/television/the-red-line-gay-muslims.html", "urlToImage": "https://static01.nyt.com/images/2019/05/30/arts/28gaymuslimtv/merlin_155353467_3c8ea563-1153-4d06-874b-1d9a5a709a64-facebookJumbo.jpg", "publishedAt": "2019-05-30T17:07:56Z", "content": "I know they were really cognizant of not wanting to turn to the queer Muslim to be the expert, but knowing that all of my work is deeply informed by a very personal place and very much about identity, its something that I was really excited to bring to the ro… [+1625 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Rogers and Motoko Rich", "title": "For Trump’s Japan Trip, Abe Piles on the Flattery. But to What End?", "description": "Observers have their doubts about whether a trip filled with flattery will entice Mr. Trump to cooperate on trade and other matters of Japanese interest.", "url": "https://www.nytimes.com/2019/05/24/us/politics/trump-japan-abe-flattery.html", "urlToImage": "https://static01.nyt.com/images/2019/05/24/us/politics/24dc-prexy-japan/24dc-prexy-japan-facebookJumbo.jpg", "publishedAt": "2019-05-24T23:15:37Z", "content": "If thats the case, Mr. Trump told reporters in April of his decision to visit, Ill be there.\r\nMr. Abes efforts, of course, belie more strategic needs. As talks between the Trump administration and North Korea over nuclear disarmament stall, Japan will look to… [+2093 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Alex Wilhelm", "title": "What happens if there’s no Vision Fund II?", "description": "Recent headlines describe a world that might never see a Vision Fund II. Would it matter?", "url": "http://techcrunch.com/2019/06/09/what-happens-if-theres-no-vision-fund-ii/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2017/04/black_hole_in_the_universe.jpg?w=593", "publishedAt": "2019-06-09T17:34:19Z", "content": "While Id like to recommend panicking as a general response to the world, a smaller or fully neutered Vision Fund II wont crash everything in the sphere of giant private companies.\r\nRecent headlines describe a world that might never see a Vision Fund II. The W… [+2437 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Iran will defeat the American and Israeli alliance: Iranian defence minister", "description": "Iran will defeat the American and Israeli alliance, Iranian Defence Minister Amir Hatami said on Wednesday, according to the Islamic Republic News Agency (IRNA). \"We will defeat the American-Zionist front,\" he said. “Iran has the highest level of defense-mili…", "url": "https://news.yahoo.com/iran-defeat-american-israeli-alliance-iran-defense-minister-111756063.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-15T12:02:22Z", "content": "GENEVA (Reuters) - Iran will defeat the American and Israeli alliance, Iranian Defence Minister Amir Hatami said on Wednesday, according to the Islamic Republic News Agency (IRNA).\r\n\"We will defeat the American-Zionist front,\" he said.\r\nIran has the highest l… [+1209 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Why scientists believe Godzilla’s fictional growth is cause for real concern", "description": "A pair of scientists from prestigious Dartmouth University recently published research postulating why Godzilla has more than doubled in size since 1954. If you guessed a gym membership and a high-protein diet: you’re wrong. The King of the Monsters’ incredib…", "url": "https://thenextweb.com/?p=1210030", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F05%2Fgogogodzilla.jpg&signature=7c01cfb8c12646d96a88b3b04f313075", "publishedAt": "2019-05-31T23:31:53Z", "content": "A pair of scientists from prestigious Dartmouth University recently published research postulating why Godzilla has more than doubled in size since 1954. If you guessed a gym membership and a high-protein diet: youre wrong.\r\nThe King of the Monsters incredibl… [+5140 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Woman says she told Neymar 'Stop, stop. No!'", "description": "A woman who has accused Brazilian star Neymar of raping her in Paris last month spoke publicly for the first time in a television interview.", "url": "https://www.espn.com/soccer/neymar/story/3869130/woman-details-neymar-aggressive-incident", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0606%2Fr552807_1296x729_16%2D9.jpg", "publishedAt": "2019-06-06T04:37:59Z", "content": "A woman who has accused Brazilian football star Neymar of raping her in Paris last month spoke publicly for the first time in a television interview that aired Wednesday in Brazil.\r\nNajila Trindade Mendes de Souza told Brazilian TV SBT that she had agreed to … [+2338 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "John Rampton", "title": "12 Passive-Aggressive Phrases That Can Destroy Your Business", "description": "Maybe you think you're being polite, but everybody else thinks you're being a jerk.", "url": "https://www.entrepreneur.com/slideshow/308081", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20160616182014-GettyImages-97595983.jpeg", "publishedAt": "2019-05-20T21:02:45Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nI've been told that I'm a bit passive-aggressive. I didn't really get it until I started evaluating some of the simple-yet-destructive words I was saying. If you’ve encountered an act of passive-… [+710 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ROMILA THAPAR", "title": "They Pedal Myths and Call It History", "description": "Vishwa Hindu Parishad, a Hindu nationalist organization, celebrating 50 years of its existence at a public meeting in Kolkata, India in 2014.", "url": "https://www.nytimes.com/2019/05/17/opinion/india-elections-modi-history.html", "urlToImage": "https://static01.nyt.com/images/2019/05/17/opinion/17thapar/17thapar-facebookJumbo.jpg", "publishedAt": "2019-05-17T05:00:07Z", "content": "The other equally insistent Hindutva argument is that the Hindus were victimized by the Muslims and were slaves for the thousand years of Muslim rule. In demanding a Hindu Rashtra, or Hindu state, they claim to be asserting their historical rights and avengin… [+2851 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Queenie Wong", "title": "Houston Rockets' Twitter account suspended after copyright complaints - CNET", "description": "The Rockets allegedly violated Twitter's rules.", "url": "https://www.cnet.com/news/houston-rockets-twitter-account-suspended-after-copyright-complaints/", "urlToImage": "https://cnet2.cbsistatic.com/img/Df-wXKs9cQtmwdysrd38IWjGCJM=/756x567/2018/10/31/8fe465ee-4bc8-4033-a02b-6dc779090f66/twitter-hq-headquarters-02107.jpg", "publishedAt": "2019-05-21T00:11:25Z", "content": "Twitter's headquarters in San Francisco.\r\nJames Martin/CNET\r\nThe Houston Rockets appeared to have fouled on their Twitter account. \r\nThe basketball team's Twitter account was suspended following copyright complaints, Twitter said Monday. The tech company decl… [+1413 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Olivia Singh", "title": "Jada Pinkett Smith says she 'had an unhealthy relationship to porn'", "description": "Jada Pinkett Smith spoke about her \"unhealthy relationship to porn\" on the latest episode of her Facebook Watch series called \"Red Table Talk.\" The actress said that she had a reliance \"back in the day\" when she wasn't in a relationship and was practicing abs…", "url": "https://www.insider.com/jada-pinkett-smith-unhealthy-relationship-porn-red-table-talk-video-2019-5", "urlToImage": "https://static.businessinsider.com/image/5ce4105bf2f4790da1030319-750.jpg", "publishedAt": "2019-05-21T14:50:01Z", "content": "Jada Pinkett Smith opened up about her \"unhealthy\" reliance on pornography on the latest episode of her Facebook Watch series, \"Red Table Talk.\"\r\n Prior to sitting down with mother Adrienne Banfield Norris and daughter Willow Smith to discuss the effects of p… [+1262 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Olivia Singh", "title": "Will Smith says that he stopped watching Jada Pinkett Smith's hit talk show: 'They telling all our business'", "description": "Will Smith appeared on ABC's \"Jimmy Kimmel Live\" on Tuesday and spoke about the Facebook Watch series \"Red Table Talk,\" which is hosted by his wife Jada Pinkett Smith, daughter Willow Smith, and mother-in-law Adrienne Banfield Norris. The \"Aladdin\" star said …", "url": "https://www.insider.com/will-smith-jada-pinkett-smith-red-table-talk-kimmel-video-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce562b7f2f4791c1c058200-1136-568.jpg", "publishedAt": "2019-05-22T14:54:23Z", "content": "Will Smith says that he stopped watching his wife Jada Pinkett Smith's hit Facebook Watch series called \"Red Table Talk.\"\r\n \"I don't watch anymore,\" Smith said of the show, which is hosted by Pinkett Smith, Willow Smith (their daughter), and Adrienne Banfield… [+1489 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Stephen Johnson on Offspring, shared by Stephen Johnson to Lifehacker", "title": "Get Over Yourself and Play Video Games With Your Kid", "description": "You have to play video games with your children. It isn’t optional anymore. It’s your parental responsibility. Your child is growing up in an electronically mediated world, where the line between “virtual” and “real” life is becoming more and more blurred. Re…", "url": "https://offspring.lifehacker.com/get-over-yourself-and-play-video-games-with-your-kid-1835336813", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Op3AZr84--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/l3vq1g7k86ftr89afukq.jpg", "publishedAt": "2019-06-11T18:15:00Z", "content": "You have to play video games with your children. It isnt optional anymore. Its your parental responsibility. Your child is growing up in an electronically mediated world, where the line between virtual and real life is becoming more and more blurred. \r\nLike i… [+6024 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Associated Press, Associated Press", "title": "Accuser of Brazil's soccer star Neymar appears in TV interview: 'I was the victim of rape'", "description": "On same day Neymar suffered an apparent injury, the woman accusing the Brazilian soccer star of rape appeared in a TV interview.", "url": "https://www.usatoday.com/story/sports/soccer/2019/06/05/neymar-brazil-soccer-star-accuser-tv-interview/1362594001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/06/06/USAT/85e3d77a-f0ca-40eb-9ef1-547b08e27410-AP_Brazil_Qatar_Soccer.JPG?crop=4532,2549,x0,y1099&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-06T02:28:33Z", "content": "BRASILIA, Brazil (AP) — A woman who has accused Brazilian soccer star Neymar of raping her in a Paris hotel went on television in an interview aired Wednesday to reaffirm her allegation against him in her first public comments on the case.\r\nTalking to Brazili… [+2780 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Justin T. Westbrook", "title": "Europeans Have Just Three Months Left to Experience the Freedom of a Chevy V8", "description": "Bad news, Europe; you’re about to lose two examples of American V8 aggression as GM claims the new European Union emissions regulations are forcing it to stop selling its 6.2-liter V8 Chevy Corvette and Camaro. Read more...", "url": "https://jalopnik.com/europeans-have-just-three-months-left-to-experience-the-1835375746", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--PNLraZcp--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/yvrl3l5dl7lzffn6kifb.jpg", "publishedAt": "2019-06-10T20:20:00Z", "content": "Bad news, Europe; youre about to lose two examples of American V8 aggression as GM claims the new European Union emissions regulations are forcing it to stop selling its 6.2-liter V8 Chevy Corvette and Camaro.\r\nSoon the V8 Corvette and Camaro will just be the… [+1609 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Bill Chappell", "title": "At Least 24 Memphis Police Officers Hurt In Protests After Deadly Shooting", "description": "The shooting occurred around 7 p.m. local time, as officers from the U.S. Marshals Service tried to take a man into custody.", "url": "https://www.npr.org/2019/06/13/732289724/at-least-24-memphis-police-officers-hurt-in-protests-after-deadly-shooting", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2019-06-13T11:54:19Z", "content": "At least 24 Memphis Police Department officers were injured during a large protest Wednesday night, Mayor Jim Strickland says. The violence erupted in response to a deadly shooting by officers of the U.S. Marshals Service.\r\nThe shooting occurred around 7 p.m.… [+2374 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "The US is sending fighter jets and 1,500 more troops to the Middle East to defend against Iran threat", "description": "The US is deploying 1,500 additional troops to the Middle East to defend US forces and allies from Iran, officials said. The deployment will include a Patriot missile battalion to combat missile threats, reconnaissance aircraft, an engineer element to harden …", "url": "https://www.businessinsider.com/us-is-sending-fighter-jets-1500-more-troops-to-middle-east-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce82a6fa7999b75c5719722-960-480.jpg", "publishedAt": "2019-05-24T17:32:25Z", "content": "PENTAGON — The US is deploying 1,500 additional troops to the Middle East to defend US forces and allies from Iran, defense officials said Friday, saying the additional forces are needed after intelligence suggested that Iranian-backed forces were preparing t… [+2099 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Mike Pesca", "title": "Terrorism Might Be Scarier, But Russia and China Pose the Real Threat to the U.S.", "description": "CNN’s Jim Sciutto sheds light on what he calls “The Shadow War.”", "url": "https://slate.com/news-and-politics/2019/05/jim-sciutto-new-book-the-shadow-war-russia-china.html", "urlToImage": "https://compote.slate.com/images/8401ab32-6e6c-4277-8e86-288101ba0f5b.jpeg?width=780&height=520&rect=4104x2736&offset=85x0", "publishedAt": "2019-05-31T00:39:29Z", "content": "Listen to Slates The Gist:\r\nSlate Plus members get extended, ad-free versions of our podcastsand much more. Sign up today and try it free for two weeks.\r\nJoin Slate Plus\r\nListen to The Gist via Apple Podcasts, Overcast, Spotify, Stitcher, or Google Play. \r\nOn… [+851 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": null, "title": "Could tension in Gulf escalate into an open conflict?", "description": "Houthi rebels attack Saudi oil facilities over 'aggression' in Yemen as Middle East tensions continue to rise.", "url": "https://www.aljazeera.com/programmes/insidestory/2019/05/tension-gulf-escalate-open-conflict-190515192700839.html", "urlToImage": null, "publishedAt": "2019-05-15T20:08:03Z", "content": null}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Japan's Abe urges Iran to play constructive role for peace", "description": "After talks with Japanese PM, Rouhani says Iran will never initiate war but will give crushing response to aggression.", "url": "https://www.aljazeera.com/news/2019/06/japan-abe-urges-iran-play-constructive-role-peace-190612170917120.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/6/12/d4d3f31a27cb49ac83ea2526077d2071_18.jpg", "publishedAt": "2019-06-12T19:40:29Z", "content": "Japanese Prime Minister Shinzo Abe has urged Iran to keep abiding by international nuclear rules and to play a \"constructive role\" for regional security, on his two-day visit to the country, with Iranian President Hassan Rouhani saying tensions in the Middle … [+2960 chars]"}, {"source": {"id": null, "name": "Raptorshq.com"}, "author": "Dylan Litman", "title": "2019 NBA Playoffs: Three Questions from the Raptors ahead of Game 2 vs. the Bucks - RaptorsHQ", "description": "2019 NBA Playoffs: Three Questions from the Raptors ahead of Game 2 vs. the Bucks RaptorsHQ Fatigue setting in on Raptors core as rotation expansion unlikely Sportsnet.ca By The Numbers: Raptors vs. Bucks Game 2 TSN Raptors need a better way to manage the loa…", "url": "https://www.raptorshq.com/2019/5/17/18628824/2019-nba-playoffs-toronto-raptors-milwaukee-bucks-game-2-questions", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hkmX6eEiTvCr-KUDqt-qHOSSKs4=/211x59:2328x1167/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16282968/usa_today_12711582.jpg", "publishedAt": "2019-05-17T14:00:00Z", "content": "After a heartbreaking Raptors loss against the Bucks in Game, Kyle Carr of Brew Hoop was kind enough to answer three questions about the series:\r\n*****\r\nDid the Raptors need to win this game, or was there enough encouraging play to signal a competitive series… [+1857 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Heather Dockray", "title": "Welcome to 'Deep Bookstagram,' where dark, book-based comedy thrives", "description": "Instagram has always been a safe haven for book lovers, a place where people can show off their private libraries full of white oak bookshelves, novels organized by color, aloe plants, and inspirational coffee mugs. But there's a deeper, stranger, and far mur…", "url": "https://mashable.com/article/best-weird-bookstagram/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F05%252F7a%252F9873af35f1b54fd7b9aee0a180f00591.3dcf8.jpg%252F1200x630.jpg?signature=-5_hHoNVzAJdF6EJtZtrSKtxu8M=", "publishedAt": "2019-06-10T21:44:37Z", "content": "Instagram has always been a safe haven for book lovers, a place where people can show off their private libraries full of white oak bookshelves, novels organized by color, aloe plants, and inspirational coffee mugs. \r\nBut there's a deeper, stranger, and far m… [+5393 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Iran will defend itself against any aggression: FM Zarif", "description": "FM Zarif says Iran seeks balanced relations with its Gulf Arab neighbours and proposes signing a non-aggression pact.", "url": "https://www.aljazeera.com/news/2019/05/iran-defend-aggression-fm-zarif-190526091112937.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/26/0c7ad3f7b90e401f868befc47dd16c89_18.jpg", "publishedAt": "2019-05-26T10:25:55Z", "content": "Iran's Foreign Minister Mohammad Javad Zarif says Tehran will defend itself against any military or economic aggression and calls on European states to do more to preserve a nuclear deal his country signed with them.\r\nSpeaking in a news conference in Baghdad … [+4647 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi king blasts Iran for 'naked aggression' in the Gulf", "description": "King Salman also pressed the international community to 'use all means' to stop Tehran from regional meddling.", "url": "https://www.aljazeera.com/news/2019/05/saudi-king-blasts-iran-naked-aggression-gulf-190530200800718.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/30/cab6c4f0cedb4329b060052cb42feea7_18.jpg", "publishedAt": "2019-05-30T21:19:35Z", "content": "Saudi Arabia delivered a strong message to Iran saying its nuclear and missile programmes were a threat to global stability while accusing Tehran of orchestrating a series of attacks on oil assets in the Gulf. \r\nAddressing Arab and Muslim leaders late Thursda… [+4190 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Australia fight back to beat West Indies in World Cup", "description": "Australia recover from an awful start to beat West Indies by 15 runs in a wonderful World Cup encounter at Trent Bridge.", "url": "https://www.bbc.co.uk/sport/cricket/48548079", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/DEB0/production/_107280075_maxwellsmith.jpg", "publishedAt": "2019-06-06T17:39:00Z", "content": "Media playback is not supported on this device\r\n'Wonderful cricket' - Cottrell takes staggering catch to remove Smith\r\nICC Men's Cricket World Cup, Trent Bridge\r\nAustralia 288 (49 overs): Coulter-Nile 92, Smith 73, C Brathwaite 3-67\r\nWest Indies 273-9 (50 ove… [+5141 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Neymar gives statement to police in Brazil amid rape allegation", "description": "The Brazil footballer visits a police station in Rio after a woman accused him of rape in Paris.", "url": "https://www.bbc.co.uk/news/world-latin-america-48552904", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/46EE/production/_107285181_mediaitem107285178.jpg", "publishedAt": "2019-06-07T08:11:23Z", "content": "Image copyrightReutersImage caption\r\n Neymar visited a police station in Rio de Janeiro\r\nBrazil football star Neymar has attended a police station in Rio de Janeiro to make a statement following a rape allegation, his lawyer says.\r\nThe star denies raping Naji… [+5213 chars]"}, {"source": {"id": null, "name": "Deadspin.com"}, "author": "Chris Thompson", "title": "Brook Lopez Leads The Bucks Over Kyle Lowry And The Raptors, Just As We All Saw Coming", "description": "In an epic matchup of global basketball superstars, Brook Lopez led his top-seeded Milwaukee Bucks over Kyle Lowry and the second-seeded Toronto Raptors, 108–100, in Game 1 of the Eastern Conference Finals. Lowry led the Raptors to an early lead and kept them…", "url": "https://deadspin.com/brook-lopez-leads-the-bucks-over-kyle-lowry-and-the-rap-1834801854", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--9qzpEAFo--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zf4f6mfjyhfjcytu8emq.jpg", "publishedAt": "2019-05-16T03:47:00Z", "content": "In an epic matchup of global basketball superstars, Brook Lopez led his top-seeded Milwaukee Bucks over Kyle Lowry and the second-seeded Toronto Raptors, 108100, in Game 1 of the Eastern Conference Finals. Lowry led the Raptors to an early lead and kept them … [+2389 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Alanna Vagianos", "title": "Unfortunately, Meryl Streep Has Zero Idea What Toxic Masculinity Means", "description": "“We hurt our boys by calling something toxic masculinity,” the \"Big Little Lies\" star said during a Q&A.", "url": "https://www.huffpost.com/entry/meryl-streep-toxic-masculinity_n_5cf172f2e4b0a1997b6a2260", "urlToImage": "https://img.huffingtonpost.com/asset/5cf174ed210000e108e6865c.jpeg?cache=wwVjbaM7F6&ops=1200_630", "publishedAt": "2019-05-31T20:14:58Z", "content": "Meryl Streep does have flaws. Well, just one: The “Big Little Lies” actress has no idea what the term “toxic masculinity” means. \r\nDuring a Q&amp;A with the “Big Little Lies” cast at the women’s working space The Wing, Streep told moderator Radhika Jones she … [+1418 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Jim Sciutto", "title": "Russia Is Waging a New Kind of War", "description": "Election interference is one front in Moscow’s larger campaign to undermine the U.S. without prompting a military response.", "url": "https://www.theatlantic.com/ideas/archive/2019/05/jim-sciutto-kremlin-waging-new-kind-war/589387/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/mt/2019/05/RTS2DYBQ/facebook.jpg?1557780300", "publishedAt": "2019-05-14T10:00:00Z", "content": "What are Americans supposed to think when their leaders contradict each other on the most basic question of national security—who is the enemy? This is happening every day on the floors of the House and the Senate, in committee hearing rooms, on television ne… [+8816 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ritoban Mukherjee", "title": "India's Monkeys Keep Killing People, so Scientists Are Trying Radical New Sterilization Strategies", "description": "One evening last November, a young woman named Neha was feeding her infant son inside their house in Runkata, a small town in the outskirts of Agra, India. Suddenly, a monkey broke into the house, snatched the baby boy from her arms, and made away with him. N…", "url": "https://gizmodo.com/indias-monkeys-keep-killing-people-so-scientists-are-t-1835014036", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--C-gkvdd1--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/uyn4eun0n0oiqtpsuqer.jpg", "publishedAt": "2019-05-25T13:00:00Z", "content": "One evening last November, a young woman named Neha was feeding her infant son inside their house in Runkata, a small town in the outskirts of Agra, India. Suddenly, a monkey broke into the house, snatched the baby boy from her arms, and made away with him. N… [+6848 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "How Does a Chimpanzee Eat a Tortoise? By Smashing It Like a Coconut", "description": "As omnivorous creatures, chimpanzees eat all sorts of things, including fruits, termites, tiny rodents, and even full-grown monkeys. As for chimps eating reptiles, that’s completely unheard of—until now. Unprecedented observations have uncovered a community o…", "url": "https://gizmodo.com/how-does-a-chimpanzee-eat-a-tortoise-by-smashing-it-li-1834958754", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--POEMHvn2--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/gvemrcsuzvzlkruqkytz.jpg", "publishedAt": "2019-05-23T13:06:00Z", "content": "As omnivorous creatures, chimpanzees eat all sorts of things, including fruits, termites, tiny rodents, and even full-grown monkeys. As for chimps eating reptiles, thats completely unheard ofuntil now. Unprecedented observations have uncovered a community of … [+6405 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Jason Weisberger", "title": "Gen Xers, and their kids, play Fortnite together", "description": "Fortnite Over Forty has become a booming little community of mature video game enthusiasts who are positive, supportive and inclusive. Mostly we play Fortnite. A while back some friends and I were looking to play squads in Fortnite that we're not populated by…", "url": "https://boingboing.net/2019/05/21/gen-xers-and-their-kids-play.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/05/0-89.jpg", "publishedAt": "2019-05-21T16:43:08Z", "content": "Fortnite Over Forty has become a booming little community of mature video game enthusiasts who are positive, supportive and inclusive. Mostly we play Fortnite.\r\nA while back some friends and I were looking to play squads in Fortnite that we're not populated b… [+2805 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Morgan Winsor", "title": "Dozens of officers injured by protesters after man shot dead by US Marshals Service", "description": "A crowd of protesters clashed with authorities at the scene of an officer-involved shooting in Memphis on Wednesday night.", "url": "https://abcnews.go.com/US/dozens-officers-injured-rowdy-protesters-man-shot-dead/story?id=63682056", "urlToImage": null, "publishedAt": "2019-06-13T12:13:59Z", "content": "A crowd of protesters clashed with authorities at the scene of an officer-involved shooting in Memphis on Wednesday night.\r\nSome people hurled rocks and bricks at Memphis Police Department officers and Shelby County Sheriff's deputies, who were armed with pla… [+1607 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANNABELLE LIANG / AP", "title": "South Korea Urges Restraint After Recent North Korea Missile Tests", "description": "South Korea fended off calls to step up pressure on North Korea after it test-fired missiles last month.", "url": "http://time.com/5599415/south-korea-north-korea-missile-test/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/ap19152075005232.jpg?quality=85", "publishedAt": "2019-06-01T14:24:22Z", "content": "SINGAPORE — South Korea’s Defense Minister Jeong Kyeong-doo on Saturday fended off calls to step up pressure on North Korea after it test-fired missiles last month.\r\nJeong told an annual security conference in Singapore that the tests were being investigated … [+2303 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Margaret Farrell", "title": "Pip Blom: Boat", "description": "The Dutch quartet undercut their perky, grunge-lite melodies with just the right amount of pop-fuzz aggression.", "url": "https://pitchfork.com/reviews/albums/pip-blom-boat/", "urlToImage": "https://media.pitchfork.com/photos/5ce3202f5a46c2dfb9098687/2:1/w_1000/PipBlom_Boat.jpg", "publishedAt": "2019-06-01T05:00:00Z", "content": "Since the dawn of the internet, multitasking has become a way of life. In her namesake four-piece band, 23-year-old Amsterdam native Pip Blom cleverly weaponizes lapses in concentration to craft perky, grunge-lite melodies. Ill watch a documentary while playi… [+2735 chars]"}, {"source": {"id": null, "name": "Discoversociety.org"}, "author": "discoversociety", "title": "The Helpful Bystander: Current Evidence from CCTV-Captured Public Conflicts", "description": "Lasse Suonperä Liebst, Richard Philpot, Poul Poder, & Marie Rosenkrantz Lindegaard Walking through the city centre late at night, many of us may have witnessed examples of public space aggressi…", "url": "https://discoversociety.org/2019/06/05/the-helpful-bystander-current-evidence-from-cctv-captured-public-conflicts/", "urlToImage": "https://discoversociety.org/wp-content/uploads/2019/05/Feature-8.jpg", "publishedAt": "2019-06-05T22:32:26Z", "content": "Lasse Suonperä Liebst, Richard Philpot, Poul Poder, &amp; Marie Rosenkrantz Lindegaard\r\nWalking through the city centre late at night, many of us may have witnessed examples of public space aggression in which an individual is assaulted. Seeing such incidents… [+11084 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Why England are favourites for the Cricket World Cup - and who might stop them", "description": "BBC Sport analyses the key reasons why England are favourites to win the World Cup on home soil this summer.", "url": "https://www.bbc.co.uk/sport/cricket/48125031", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/6BC6/production/_107109572_morgann.jpg", "publishedAt": "2019-05-28T08:12:46Z", "content": "Eoin Morgan will lead England into the World Cup for a second time - since the last World Cup his side have beaten every country competing in the tournament, bar Afghanistan, in a one-day series\r\nICC Men's Cricket World Cup 2019\r\nDates: 30 May - 14 July, 2019… [+6798 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "AP", "title": "Lawyers say ‘aggression’ was initial charge against Neymar", "description": "The Brazilian lawyers who first represented an unidentified woman who has accused Neymar of rape say her initial complaint cited \"aggression\" by the player, though they add that doesn't mean authorities couldn't pursue a rape prosecution.", "url": "https://indianexpress.com/article/sports/football/lawyers-say-aggression-was-initial-charge-against-neymar-5765932/", "urlToImage": "https://images.indianexpress.com/2019/04/neymar-759.jpg?w=759", "publishedAt": "2019-06-05T06:08:02Z", "content": "Neymar denies any wrongdoing. (Source: AP)\r\nThe Brazilian lawyers who first represented an unidentified woman who has accused soccer star Neymar of rape said Tuesday that her initial complaint charged she was a victim of “aggression,” or “physical violence,” … [+4546 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Peter Helman", "title": "The Armed – “FT. FRANK TURNER”", "description": "Detroit hardcore collective the Armed put out one of the best albums of 2018 in Only Love. And today, they're back with their first new material since then. \"FT. FRANK TURNER,\" the 42nd installment of the current Adult Swim Singles program, does not feat Fran…", "url": "https://www.stereogum.com/2046639/the-armed-ft-frank-turner/music/", "urlToImage": "https://static.stereogum.com/uploads/2019/06/thearmed_ftfrankturner-1559753378-608x608.jpg", "publishedAt": "2019-06-05T17:09:36Z", "content": "Detroit hardcore collective the Armed put out one of the best albums of 2018 in Only Love. And today, they’re back with their first new material since then. “FT. FRANK TURNER,” the 42nd installment of the current Adult Swim Singles program, does not feat Fran… [+114 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Why Ukraine has become ensnared in US collusion claims", "description": "A Kiev prosecutor revives allegations that Ukraine worked with Democrats to damage the Trump campaign.", "url": "https://www.bbc.co.uk/news/world-europe-48268762", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12237/production/_106959247_composite_image_ukraine_manafort_giuliani_biden.jpg", "publishedAt": "2019-05-17T23:35:23Z", "content": "Image copyrightGetty Images / ReutersImage caption\r\n Mr Trump's lawyer Rudy Giuliani, jailed campaign manager Paul Manafort, and Democrat front-runner Joe Biden are all part of the story\r\nThis was a story long thought dead and buried, but the allegation that … [+7965 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Our Foreign Staff", "title": "Iran 'reconsiders' aggression in the Gulf after US intervention, says Bolton", "description": "John Bolton on Thursday declared that recent US actions against Iran had proved an effective &lsquo;deterrent&rsquo; against further attacks on America and its allies in the Gulf Region.", "url": "https://www.telegraph.co.uk/news/2019/05/30/iran-reconsiders-aggression-gulf-us-intervention-says-bolton/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/30/TELEMMGLPICT000198942349-xlarge_trans_NvBQzQNjv4Bqd5_sWj-Hu5YV1uSoc_Px3vPScD4-cs68PIMm6jv25XA.jpeg", "publishedAt": "2019-05-30T17:32:06Z", "content": "John Bolton on Thursday declared that recent US actions against Iran had proved an effective deterrent against further attacks on America and its allies in the Gulf Region.\r\nI dont think this threat is over, said Donald Trumps national security adviser at  a … [+995 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "‘I do not agree’: Mamata tweets poem after BJP’s double-digit win in Bengal", "description": "\"I am a humble servant of the gentle renaissance raised in Bengal. I do not believe in selling religious aggression.\"", "url": "https://indianexpress.com/elections/lok-sabha-election-results-day-after-saffron-surge-in-west-bengal-mamata-banerjee-tweets-poem-i-do-not-agree-5747173/", "urlToImage": "https://images.indianexpress.com/2019/05/mamata-13.jpg?w=759", "publishedAt": "2019-05-24T14:38:57Z", "content": "Prime Minister Narendra Modi and West Bengal Chief Minister Mamata Banerjee. (File Photo)\r\nWest Bengal Chief Minister Mamata Banerjee Friday shared a poem titled ‘I do not agree’ a day after the Trinamool Congress was faced with a stunning competition from th… [+2332 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Taiwan holds military drills, vows to defend against Chinese aggression", "description": "Fighter jets launched strikes and warships opened fired to destroy an enemy beachhead, while more than 3,000 soldiers took part in the live-fire drill in the southern county of Pingtung.", "url": "https://economictimes.indiatimes.com/news/defence/taiwan-holds-military-drills-vows-to-defend-against-chinese-aggression/articleshow/69573002.cms", "urlToImage": "https://img.etimg.com/thumb/msid-69573013,width-1070,height-580,imgsize-128164,overlay-etdefence/photo.jpg", "publishedAt": "2019-05-30T05:58:56Z", "content": "PINGTUNG, TAIWAN: Taiwan's air, sea and land forces conducted a drill to repel an invading force on Thursday, as its defence minister pledged to defend the self-ruled island against China's rising military threat.\r\nFighter jets launched strikes and warships o… [+1697 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "China Thinks Russia's New Stealth Fighter 'Trashes' the F-35", "description": "The Su-57 completely 'trashes' the latest American fighters like the F-35—at least, according to Chinese media.Earlier this month, Chinese defense news outlet Mil.news.sina published an analytical piece on the state of Russia’s arsenal. The article looked to …", "url": "https://news.yahoo.com/china-thinks-russias-stealth-fighter-220000237.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2j0_oeu80YglEynkGD6NBQ--~B/aD05NjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/634cad1d76995c257d67e9c5822f5839", "publishedAt": "2019-05-30T22:00:00Z", "content": "Mark Episkopos\r\nSecurity, Europe\r\nThanks to some unique technology.\r\nChina Thinks Russia's New Stealth Fighter 'Trashes' the F-35\r\nThe Su-57 completely 'trashes' the latest American fighters like the F-35at least, according to Chinese media.\r\nEarlier this mon… [+847 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Reuters World News Summary", "description": "Following is a summary of current world news briefs. Several Kurdish lawmakers and thousands of prison inmates in Turkey have ended their hunger strike after a call from jailed militant leader Abdullah Ocalan, one of the MPs said on Sunday, 200 days after the…", "url": "https://news.yahoo.com/reuters-world-news-summary-125924569.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-26T12:59:24Z", "content": "Following is a summary of current world news briefs.\r\nKurdish MPs, inmates end hunger strike in Turkey after militant leader call\r\nSeveral Kurdish lawmakers and thousands of prison inmates in Turkey have ended their hunger strike after a call from jailed mili… [+4968 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Taiwan holds military drills, vows to defend against Chinese aggression", "description": "Taiwan's air, sea and land forces conducted a drill to repel an invading force on Thursday, as its defense minister pledged to defend the self-ruled island against China's rising military threat.", "url": "https://www.reuters.com/article/us-taiwan-drills-idUSKCN1T00H3", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190530&t=2&i=1392394577&w=1200&r=LYNXNPEF4T0EO", "publishedAt": "2019-05-30T05:50:59Z", "content": "PINGTUNG, Taiwan (Reuters) - Taiwan’s air, sea and land forces conducted a drill to repel an invading force on Thursday, as its defense minister pledged to defend the self-ruled island against China’s rising military threat. \r\nFighter jets launched strikes an… [+1831 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Matt McGarry", "title": "Yemen's Houthi rebels target Saudi city as tensions are high in the Middle East", "description": "Yemen's Houthi rebels target Saudi Arabian city with drone as tensions in the Middle East rise.", "url": "https://abcnews.go.com/International/yemens-houthi-rebels-target-saudi-arabian-city-drone/story?id=63171873", "urlToImage": "https://s.abcnews.com/images/Politics/yemen-1-gty-er-190225_hpMain_16x9_992.jpg", "publishedAt": "2019-05-21T16:40:16Z", "content": "Air defense crews raced to action in the southern Saudi Arabian city of Najran Tuesday night to intercept an attack from Iran-backed Yemeni Houthi rebels as tensions remain high between Tehran and the United States.\r\nThe attack on Najran, about 10 miles north… [+2419 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Elizabeth McLaughlin and Luis Martinez", "title": "F-35 fighters to conduct flyover of White House during Polish president's visit", "description": "Two F-35 Marine Corps fighters will conduct a flyover of the White House on Wednesday to mark Polish president Andrzej Duda's visit, according to U.S. officials.", "url": "https://abcnews.go.com/Politics/marine-corps-35-stealth-fighters-conduct-flyover-white/story?id=63658472", "urlToImage": "https://s.abcnews.com/images/Politics/marine-corps-ht-jpo-190612_hpMain_16x9_992.jpg", "publishedAt": "2019-06-12T15:46:14Z", "content": "Two F-35 Marine Corps fighters will conduct a flyover of the White House on Wednesday to mark Polish president Andrzej Duda's visit, according to U.S. officials.\r\nThe rare White House flyover is the first for the U.S. military's most advanced aircraft. It cou… [+2497 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Behavioral correlations of the domestication syndrome are decoupled in modern dog breeds", "description": "A new study used behavioral data from more than 76,000 dogs, to test the hypothesis that key behaviors in the domestication syndrome are correlated.", "url": "https://www.sciencedaily.com/releases/2019/06/190607110446.htm", "urlToImage": null, "publishedAt": "2019-06-07T15:04:46Z", "content": "Scientists since Darwin have been intrigued by the simultaneous alteration of multiple morphological, physiological and behavioural traits across a wide range of domesticated animals, such as horses, pigs and dogs. For instance, reduced brain size, floppy ear… [+3598 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Key Sun Ph.D.", "title": "Why Are Some People Habitually Aggressive?", "description": "Instrumental aggression in human interaction appears ubiquitous. Why are some people habitually aggressive?", "url": "https://www.psychologytoday.com/ca/blog/the-justice-and-responsibility-league/201905/why-are-some-people-habitually-aggressive", "urlToImage": null, "publishedAt": "2019-05-13T22:34:52Z", "content": null}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Frank T. McAndrew Ph.D.", "title": "Hot and Bothered: Does Heat Make People Aggressive?", "description": "The relationship between heat and aggression is complicated. What does science have to say about it?", "url": "https://www.psychologytoday.com/ca/blog/out-the-ooze/201905/hot-and-bothered-does-heat-make-people-aggressive", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-05/shutterstock_thermometer.jpg?itok=1OnXIi48", "publishedAt": "2019-05-17T21:07:24Z", "content": "Yesterday, we had the first really hot, humid day of the year in Western Illinois.  This followed a very long, difficult winter and a cold, rainy spring.  Given how much I looked forward to warmer weather, one would think I would have relished the heat.\r\nInst… [+3782 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "The Latest: Iraq to try help end crisis between US and Iran", "description": "BAGHDAD (AP) — The Latest on developments in the Persian Gulf region and elsewhere in the Mideast amid heightened tensions between the U.S. and Iran (all times local):", "url": "https://news.yahoo.com/latest-iraq-try-help-end-crisis-between-us-081953444.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/f5cl3Aphnm3jLcCB52oerw--~B/aD0zMjk3O3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/d4a732a90eda4360a8d29b7b4e4694b4.jpg", "publishedAt": "2019-05-26T08:19:53Z", "content": "BAGHDAD (AP) The Latest on developments in the Persian Gulf region and elsewhere in the Mideast amid heightened tensions between the U.S. and Iran (all times local):11:15 a.m.Iraq's foreign minister says Baghdad wants to mediate between the United States and … [+3562 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Bert Gambini-Buffalo", "title": "Marijuana increases odds of couples feeling intimate", "description": "Marijuana can bring certain couples closer together, researchers say.", "url": "https://www.futurity.org/marijuana-couples-intimacy-events-2070182/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/05/couple-under-blanket-on-cliff_1600.jpg", "publishedAt": "2019-05-23T00:06:06Z", "content": "For couples who frequently use the drug, episodes of marijuana use increase the likelihood couples will experience “intimacy events,” according to new research.\r\nThe study’s definition of intimacy events included love, caring, and support.\r\n“We found robust s… [+3475 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Leon Hoffman M.D.", "title": "Thoughts about Fatherhood and Father’s Day in the #Metoo Era", "description": "Fathers can encourage the development of autonomy and assertion rather than destructive aggression in both boys and girls", "url": "https://www.psychologytoday.com/us/blog/beyond-freud/201905/thoughts-about-fatherhood-and-father-s-day-in-the-metoo-era", "urlToImage": "", "publishedAt": "2019-05-30T01:58:19Z", "content": "Thoughts about Fatherhood and Fathers Day in the #Metoo Era\r\nLeon Hoffman, MD\r\nA fathers responsiveness to his children and his emotional availability are key characteristics that facilitate childrens development. Children whose fathers participate in the emo… [+3839 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Leon Hoffman M.D.", "title": "Thoughts about Fatherhood and Father’s Day in the #Metoo Era", "description": "Fathers can encourage the development of autonomy and assertion rather than destructive aggression in both boys and girls", "url": "https://www.psychologytoday.com/ca/blog/beyond-freud/201905/thoughts-about-fatherhood-and-father-s-day-in-the-metoo-era", "urlToImage": null, "publishedAt": "2019-05-30T01:58:19Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Mat Smith", "title": "'Doom Eternal' is guns, gore and sophistication", "description": "The 2016 remake of Doom reinvigorated the series. It added new gameplay quirks and systems that rewarded your aggression as humanity's savior, the slayer. Depending on how you maneuvered and ended the lives of demons and other threats, you'd pick up...", "url": "https://www.engadget.com/2019/06/14/doom-eternal-hands-on-e3-2019/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fmedia-mbst-pub-ue1.s3.amazonaws.com%2Fcreatr-uploaded-images%2F2019-06%2Fb9824ba0-8e2c-11e9-93dd-1e5c7b0a6db5&client=amp-blogside-v2&signature=b7dfb250b52b26dcba896eaed3aec0425d1f04a8", "publishedAt": "2019-06-14T14:00:00Z", "content": "Hugo Martin, creative director at id Software, told us to expect fewer health packs and ammo dumps dotted around levels, with item distribution \"tuned and tightened\" across Doom Eternal. The game also introduces flame belch, a new companion attack that sets d… [+2598 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Krok", "title": "2020 Cadillac CT4-V and CT5-V get uncovered in Detroit - Roadshow", "description": "Caddy's replacements for the high-performance ATS-V and CTS-V have arrived.", "url": "https://www.cnet.com/roadshow/news/2020-cadillac-ct4-v-ct5-v-debut/", "urlToImage": "https://cnet1.cbsistatic.com/img/dJjU-LZ1_0MYUA1AQss5p5PDrzc=/2019/05/30/1af0d54e-2fc0-47f4-8c2c-669f70198d07/ct-v-ogi.jpg", "publishedAt": "2019-05-30T22:51:08Z", "content": "On the eve of the Detroit Grand Prix, Cadillac has brought not one, but two new V-Series performance sedans to the Motor City.\r\nCadillac on Thursday debuted both the CT4-V and CT5-V. While the CT5 was first introduced to the world at the New York Auto Show, t… [+3707 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Trump says U.S. may send 2,000 troops from Germany to Poland", "description": "President Donald Trump said on Wednesday he is considering sending 2,000 U.S. troops from Germany to Poland, a step sought by Warsaw to deter potential aggression from Russia.", "url": "https://www.reuters.com/article/us-usa-poland-idUSKCN1TD27O", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2019-06-12T17:10:02Z", "content": "WASHINGTON (Reuters) - President Donald Trump said on Wednesday he is considering sending 2,000 U.S. troops from Germany to Poland, a step sought by Warsaw to deter potential aggression from Russia. \r\n“We’re talking about it,” Trump told reporters in the Oval… [+1167 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Jon Ryan", "title": "Bloodlines 2: Third Clan Revealed", "description": "Paradox reveals a new vampiric clan and their abilities in Bloodlines 2.", "url": "https://ca.ign.com/articles/2019/05/15/bloodlines-2-clans-toreador-reveal", "urlToImage": "https://assets1.ignimgs.com/2019/05/15/vtmb2-toreadorbr-1557944609253_1280w.jpg", "publishedAt": "2019-05-15T18:25:58Z", "content": "The Clan of the Rose is back. \r\nBy Jon RyanParadox Interactive has revealed yet another clan appearing in Vampire: The Masquerade - Bloodlines 2.\r\nClans are vampiric factions sharing a bloodline, and the Toreador's is one of the oldest and most influential of… [+2395 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Syria, Israel exchange fire amid regional tension, 1 killed", "description": "DAMASCUS, Syria (AP) — Syria said an Israeli attack against a military post in the country's south on Monday killed a soldier and injured another. Israel, in a rare statement acknowledging firing into Syria, said it was responding to an anti-aircraft fire fro…", "url": "https://news.yahoo.com/syrian-tv-israeli-rocket-strike-kills-soldier-injures-190440636.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-27T19:41:49Z", "content": "DAMASCUS, Syria (AP) Syria said an Israeli attack against a military post in the country's south on Monday killed a soldier and injured another. Israel, in a rare statement acknowledging firing into Syria, said it was responding to an anti-aircraft fire from … [+1767 chars]"}, {"source": {"id": null, "name": "Smithsonianmag.com"}, "author": "Joseph Stromberg", "title": "The Neuroscientist Who Discovered He Was a Psychopath (2013)", "description": "While studying brain scans to search for patterns that correlated with psychopathic behavior, James Fallon found that his own brain fit the profile", "url": "https://www.smithsonianmag.com/science-nature/the-neuroscientist-who-discovered-he-was-a-psychopath-180947814/", "urlToImage": "https://thumbs-prod.si-cdn.com/JNB4ya03LLzgTQFgKtPsIbp9buc=/fit-in/1600x0/https://public-media.si-cdn.com/filer/Surprising-Science-neuroscientist-psychopath.jpg", "publishedAt": "2019-05-28T05:33:08Z", "content": "One afternoon in October 2005, neuroscientist James Fallon was looking at brain scans of serial killers. As part of a research project at UC Irvine, he was sifting through thousands of PET scans to find anatomical patterns in the brain that correlated with ps… [+4995 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Congress social media head Divya Spandana off Twitter, goes incommunicado", "description": "Divya is often credited with turning around the Congress’s social media presence by giving it aggression as it battled the BJP, which has a much formidable team and presence on the social media.", "url": "https://indianexpress.com/article/india/congress-social-media-head-divya-spandana-off-twitter-goes-incommunicado-5761598/", "urlToImage": "https://images.indianexpress.com/2019/05/divya-spandana-1231.jpg?w=759", "publishedAt": "2019-06-02T20:51:04Z", "content": "Her vanishing act comes at a time when the party is in a flux following its defeat in the elections.\r\nAdding to the confusion and uncertainty within the Congress after its Lok Sabha poll defeat, the partys social media department head Divya Spandana on Sunday… [+1230 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Stanley Coren PhD., DSc, FRSC", "title": "Do Puppy Classes Have an Effect on Later Dog Behavior?", "description": "Puppy classes seem to have a lasting impact on some aspects of aggression, fearfulness, and trainability which can be observed later in adult dogs.", "url": "https://www.psychologytoday.com/us/blog/canine-corner/201905/do-puppy-classes-have-effect-later-dog-behavior", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-05/puppy_class_teaser.jpg?itok=6l49qaXF", "publishedAt": "2019-05-22T16:37:04Z", "content": "Puppy classes are now available in most larger urban centers. The rationale for enrolling puppies in such classes is based on research which shows that dogs who don't have adequate contact with other dogs and people during the early months of their first year… [+7104 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Stephen Curry is wowing the NBA world all over again, and some think he's playing the best basketball of his life", "description": "Stephen Curry has been on fire since Kevin Durant's injury. Curry averaged 36 points per game in the Warriors' sweep of the Portland Trail Blazers, leaving some to wonder if it was the best series of his career. It's as if Durant's injury has allowed Curry to…", "url": "https://www.businessinsider.com/steph-curry-best-basketball-nba-career-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce6ee37f85e163ebd1f0894-1136-568.jpg", "publishedAt": "2019-05-23T20:09:30Z", "content": "Stephen Curry has been one of the NBA's most dominant players of the last five years, but it took an ill-timed injury to Kevin Durant to remind the basketball world how good he is. \r\n In the five full games that Durant has missed since injuring his calf in th… [+4077 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Cat declawing: Should it be banned, and why does it happen in the US?", "description": "New York might become the first US state to ban cat declawing - but it's been illegal in Europe for years.", "url": "https://www.bbc.co.uk/news/world-us-canada-48528968", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/E7B3/production/_107251395_gettyimages-921684140.jpg", "publishedAt": "2019-06-05T23:51:09Z", "content": "Image copyrightGetty Images\r\nNew York might become the first US state to ban cat declawing.\r\nIn a bipartisan move on Tuesday, lawmakers voted to make the procedure illegal, except where it is medically necessary for the cat. \r\nThe governor, Andrew Cuomo, need… [+9882 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "Jamil Zaki", "title": "Making Empathy Central to Your Company Culture", "description": "Highlight the right behaviors.", "url": "https://hbr.org/2019/05/making-empathy-central-to-your-company-culture", "urlToImage": "https://hbr.org/resources/images/article_assets/2019/05/May19_30_534247252.jpg", "publishedAt": "2019-05-30T13:00:00Z", "content": "In Tim Cooks 2017 MIT commencement address, he warned graduates, People will try to convince you that you should keep empathy out of your career.  Dont accept this false premise. The Apple CEO is not alone in recognizing and emphasizing the importance of empa… [+5387 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": null, "title": "Trump says he hopes there is no war with Iran — a more cautious tone than his advisers - Global News", "description": "Trump says he hopes there is no war with Iran — a more cautious tone than his advisers Global News John Bolton, the Saudis and the hawkish forces pushing the White House toward a war with Iran CBC News Trump says he hopes for no war as U.S.-Iran tensions esca…", "url": "https://globalnews.ca/news/5287661/iran-donald-trump-hope-no-war-advisers/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2018/11/wx110-723_2018_103943.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2019-05-17T13:50:00Z", "content": "U.S. President Donald Trump says he hopes the U.S. is not on a path to war with Iran amid fears that his two most hawkish advisers could be angling for such a conflict with the Islamic Republic.\r\nAsked Thursday if the U.S. was going to war with Iran, the pres… [+5077 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Iran vows to defend itself against military and economic aggression - CBS Evening News", "description": "Iran’s foreign minister said today that Tehran would defend itself against any military or economic aggression. Javad Zarif spoke on a high-profile visit to ...", "url": "https://www.youtube.com/watch?v=RePihh94nH8", "urlToImage": "https://i.ytimg.com/vi/RePihh94nH8/maxresdefault.jpg", "publishedAt": "2019-05-26T22:32:06Z", "content": "Irans foreign minister said today that Tehran would defend itself against any military or economic aggression. Javad Zarif spoke on a high-profile visit to Iraq. Roxana Saberi reports.\r\nSubscribe to the \"CBS Evening News\" Channel HERE: http://bit.ly/1S7DhikWa… [+871 chars]"}, {"source": {"id": null, "name": "Yankodesign.com"}, "author": "Sarang Sheth", "title": "This Jeep SUV concept looks like nothing I’ve seen before!", "description": "This Jeep SUV concept looks like nothing I’ve seen before! With the demeanor of a more aggressive brand like Lamborghini (the Urus, specifically), the Jeep Ayastigi Trackhawk Coupe concept aims at giving the Jeep aesthetic a...", "url": "https://www.yankodesign.com/2019/05/27/this-jeep-suv-concept-looks-like-nothing-ive-seen-before/", "urlToImage": null, "publishedAt": "2019-05-28T00:00:45Z", "content": "With the demeanor of a more aggressive brand like Lamborghini (the Urus, specifically), the Jeep Ayastigi Trackhawk Coupe concept aims at giving the Jeep aesthetic a revival. The dual-colored setup, says designer Dejan Hristov, is reminiscent of Cherokee warr… [+1638 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Patricia Zengerle", "title": "U.S. lawmakers see tamping down of Trump rhetoric on Iran", "description": "U.S. officials who briefed Congress about Iran on Tuesday sought to convince lawmakers that President Donald Trump's administration wants to deter Tehran's aggression, not attack the Islamic republic, members of Congress said.", "url": "https://www.reuters.com/article/us-usa-iran-congress-idUSKCN1SR2CA", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190521&t=2&i=1389564025&w=1200&r=LYNXNPEF4K1WC", "publishedAt": "2019-05-21T20:07:02Z", "content": "WASHINGTON (Reuters) - U.S. officials who briefed Congress about Iran on Tuesday sought to convince lawmakers that President Donald Trump’s administration wants to deter Tehran’s aggression, not attack the Islamic republic, members of Congress said. \r\n“I hope… [+2193 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": "Dominic Tarason", "title": "CrossCode adds arena battles, new quests and pettable pets today", "description": "Yes, you can now pet the dog in lovely action-RPG CrossCode. There are also now dogs to pet, as of today’s massive Version 1.1 update for the game. Developers Radical Fish have made good on their post-launch plans, and gone above and beyond with this one. The…", "url": "https://www.rockpapershotgun.com/2019/05/15/crosscode-now-lets-you-pet-the-dog-which-also-exists-now/", "urlToImage": "https://assets.rockpapershotgun.com/images/2019/05/Crosscode.jpg", "publishedAt": "2019-05-15T18:41:34Z", "content": "Yes, you can now pet the dog in lovely action-RPG CrossCode. There are also now dogs to pet, as of today’s massive Version 1.1 update for the game. Developers Radical Fish have made good on their post-launch plans, and gone above and beyond with this one. The… [+1778 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Trump says US will deploy 1,000 additional troops to Poland", "description": "Trump says Poland agreed to build base for 1,000 US troops at its own cost and will buy dozens of F-35 jets.", "url": "https://www.aljazeera.com/news/2019/06/trump-deploy-1000-additional-troops-poland-190612190707426.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/6/12/6afc9bff1c2d412eb0a9e9803be3cfea_18.jpg", "publishedAt": "2019-06-12T21:54:51Z", "content": "US President Donald Trump pledged to Polish President Andrzej Duda on Wednesday that he will deploy 1,000 US troops to Poland, a step sought by Warsaw to deter potential aggression from Russia.\r\nTrump announced the troop deployment at a joint news conference … [+1648 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Palmer column: Was Hamilton's win really a 'miracle'?", "description": "Just how tough was Lewis Hamilton's \"miracle\" victory in Monaco? Jolyon Palmer takes a look.", "url": "https://www.bbc.co.uk/sport/formula1/48428176", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/5219/production/_106471012_hamilton_vettel_getty.jpg", "publishedAt": "2019-05-28T06:16:31Z", "content": "Former F1 driver Jolyon Palmer, who left Renault during the 2017 season, is part of the BBC team and offers insight and analysis from the point of view of the competitors\r\nLewis Hamilton won the Monaco Grand Prix with a perfectly measured drive - but was it r… [+8464 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "'We were humiliated & jealous' - how Morgan made England the world's best one-day team", "description": "England captain Eoin Morgan tells one of his predecessors Michael Vaughan how he helped turn around the one-day fortunes of the World Cup favourites.", "url": "https://www.bbc.co.uk/sport/cricket/48367125", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1422F/production/_107097428_morganindex.jpg", "publishedAt": "2019-05-27T05:24:08Z", "content": "Eoin Morgan is seen as the man behind England's rise to best in the world\r\nICC Men's Cricket World Cup 2019\r\nDates: 30 May - 14 July, 2019\r\nLive coverage: Ball-by-ball commentary on Test Match Special, plus text commentary, clips and highlights on the BBC Spo… [+9073 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "By betsy.woodruff@thedailybeast.com (Betsy Woodruff) adam.rawnsley@thedailybeast.com (Adam Rawnsley)", "title": "Trump Admin Moves Fueled Iran’s Aggression, U.S. Intel Says", "description": "Photo Illustration by The Daily Beast/Getty Trump administration hawks have spent the last two weeks decrying an increased threat from Iran. But U.S. intelligence officials assess that Iran’s aggressive moves came in response to the administration’s own actio…", "url": "https://www.thedailybeast.com/trump-admin-moves-fueled-irans-aggression-us-intel-says", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1558050827/190516-Woodruff-Rawnsley-Iran-tease-_sk8c95", "publishedAt": "2019-05-17T00:10:35Z", "content": "Trump administration hawks have spent the last two weeks decrying an increased threat from Iran. But U.S. intelligence officials assess that Irans aggressive moves came in response to the administrations own actions. \r\nThree U.S. government officials familiar… [+7945 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Randall Colburn on News, shared by Randall Colburn to The A.V. Club", "title": "Feel young again as Lori Beth Denberg revives her Loud Librarian for the All That reboot", "description": "All That returns to Nickelodeon next month with a brand new cast of pint-sized comics, but they won’t be without a few mentors. As we reported earlier this month, previous cast members Kel Mitchell, Josh Server, and Lori Beth Denberg will join the newbies in …", "url": "https://news.avclub.com/feel-young-again-as-lori-beth-denberg-revives-her-loud-1834986692", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--vILEeCEm--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/buoya3vhbxubcebtwvjy.png", "publishedAt": "2019-05-23T19:28:00Z", "content": "All That returns to Nickelodeon next month with a brand new cast of pint-sized comics, but they wont be without a few mentors. As we reported earlier this month, previous cast members Kel Mitchell, Josh Server, and Lori Beth Denberg will join the newbies in a… [+954 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "James Bricknell", "title": "What we know about Call of Duty: Mobile Battle Royale", "description": "Be prepared to face off with up to 100 other combatants in this mixing pot of a game mode. Activision is going all-in on its latest addition to the Call of Duty franchise. Called Call of Duty: Mobile it looks to be a fully-fledged Call of Duty game made speci…", "url": "https://www.androidcentral.com/call-duty-mobile-battle-royale-mode", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/cod-mobile-br-3rd-person.jpg?itok=Qn3U7cbm", "publishedAt": "2019-05-24T13:15:02Z", "content": "Activision is going all-in on its latest addition to the Call of Duty franchise. Called Call of Duty: Mobile it looks to be a fully-fledged Call of Duty game made specifically for mobile devices.\r\nIn their latest press release, Activision has released informa… [+6527 chars]"}, {"source": {"id": "the-american-conservative", "name": "The American Conservative"}, "author": "Daniel Larison", "title": "Iran Won’t Reward Trump’s Aggression", "description": "As the North Koreans have also learned, no one can successfully negotiate with a person as unreliable and moody as Trump.", "url": "https://www.theamericanconservative.com/larison/iran-wont-reward-trumps-aggression/", "urlToImage": "https://www.theamericanconservative.com/wp-content/uploads/2018/09/trump-rouhani.png", "publishedAt": "2019-05-28T15:52:13Z", "content": "In case there was any doubt, the Iranian government made clear that they were not interested in talking to Trump:\r\nIran sees no prospect of negotiations with the United States, a foreign ministry spokesman said on Tuesday, a day after U.S. President Donald Tr… [+3257 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Bradley Brownell", "title": "TRD Has the Carbon Aero and 19\" Wheels You Want For Your Supra", "description": "This weekend marked a gathering called “The Supra Is Back To Japan Fes” a gathering of Supra enthusiasts celebrating the return of the Toyota sports car. Doing their part, TRD used this event as an opportunity to display a new Supra with the carbon aero piece…", "url": "https://jalopnik.com/trd-has-the-carbon-aero-and-19-wheels-you-want-for-you-1834873449", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--h13cs6TE--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/utiavicsdkci2xcqown6.jpg", "publishedAt": "2019-05-19T15:00:00Z", "content": "This weekend marked a gathering called The Supra Is Back To Japan Fes a gathering of Supra enthusiasts celebrating the return of the Toyota sports car. Doing their part, TRD used this event as an opportunity to display a new Supra with the carbon aero pieces … [+1334 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "G2 Sweeps Team Liquid for Mid Season Invitational Victory", "description": "This weekend Riot Games took to Taipei, Taiwan for its annual League of Legends Mid-Season Invitational (MIS) leading up to Worlds 2019. Following a pair of upsets which saw favored teams Invictus Gaming and SK Telecom T1, Team Liquid and G2 came together for…", "url": "https://hypebeast.com/2019/5/league-of-legends-mid-season-invitational-g2-victory-news", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F05%2FTW-league-of-legends-mid-season-invitational-g2-victory-news.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2019-05-19T12:19:20Z", "content": "This weekend Riot Games took to Taipei, Taiwan for its annual League of Legends Mid-Season Invitational (MIS) leading up to Worlds 2019. Following a pair of upsets which saw favored teams Invictus Gaming and SK Telecom T1, Team Liquid and G2 came together for… [+1548 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "US pilots warned about flying over Iranian territory amid rising tensions in Middle East", "description": "US airlines have been warned by diplomats that their planes face a risk of being “misidentified” as they fly over the Gulf amid heightened tensions between America and Iran, A notice from the Federal Aviation Association (FAA) published on 16 May underlined t…", "url": "https://news.yahoo.com/us-pilots-warned-flying-over-195457629.html", "urlToImage": null, "publishedAt": "2019-05-18T19:54:57Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Taiwan Has Only 1 Way To Stop China's Navy In a War", "description": "Taipei and Beijing are seemingly sliding into an escalatory spiral amid a flurry of veiled threats and accusations.Just last week, China’s defense minister invoked Abraham Lincoln to justify the Chinese Communist Party’s (CCP) increasingly aggressive reunific…", "url": "https://news.yahoo.com/taiwan-only-1-way-stop-132200049.html", "urlToImage": null, "publishedAt": "2019-06-04T13:22:00Z", "content": null}, {"source": {"id": "the-american-conservative", "name": "The American Conservative"}, "author": "Doug Bandow", "title": "Iran Says ‘Hell No!’ to Trump’s Aggression", "description": "They're doing exactly what we would do in their situation and we should change course before it gets worse.", "url": "https://www.theamericanconservative.com/articles/iran-says-hell-no-to-trumps-aggression/", "urlToImage": "https://www.theamericanconservative.com/wp-content/uploads/2018/09/trump-rouhani.png", "publishedAt": "2019-05-16T03:08:47Z", "content": "President Donald Trump says he wishes Iran would call him. All he wants, he insists, is a deal, a fair deal. Apparently, he’s realized he was wrong to believe that the regime he’s attempting to overthrow would grovel before him. So now the White House has ann… [+8989 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Jen Kirby", "title": "Poland and US beef up security cooperation with additional troop rotations", "description": "Poland will also buy 32 F-35 fighter jets, Trump said Wednesday.", "url": "https://www.vox.com/2019/6/12/18663242/poland-us-security-cooperation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/36lPoSIMra41h6GkvyOLsrqEBsI=/0x332:4000x2426/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16336203/1149497257.jpg.jpg", "publishedAt": "2019-06-12T21:30:00Z", "content": "Poland will also buy 32 F-35 fighter jets, Trump said Wednesday. The Trump administration is sending approximately 1,000 additional US troops to rotate through Poland to strengthen security ties between the two countries — though whether they will be housed i… [+3707 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "AP", "title": "Lawyers say ‘aggression’ was initial charge against Neymar", "description": "Lawyers say 'aggression' was initial charge against Neymar", "url": "https://www.foxsports.com/other/story/lawyers-say-aggression-was-initial-charge-against-neymar-060419", "urlToImage": "https://b.fssta.com/uploads/2019/06/afdaee5dee4840079edaadc3723f2373.vresize.1200.630.high.79.jpg", "publishedAt": "2019-06-05T02:58:09Z", "content": "RIO DE JANEIRO (AP) — The Brazilian lawyers who first represented an unidentified woman who has accused soccer star Neymar of rape said Tuesday that her initial complaint charged she was a victim of “aggression,” or “physical violence,” by the player, though … [+4518 chars]"}, {"source": {"id": null, "name": "Nintendoenthusiast.com"}, "author": "Chris Hinton", "title": "What is video game photography and why should Nintendo embrace it? - NintendoEnthusiast", "description": "What is video game photography and why should Nintendo embrace it? NintendoEnthusiast 30 Minutes With Super Mario Maker 2 Is Not Nearly Enough Kotaku Super Mario Maker 2: Building Levels, Destroying Friendships IGN Super Mario Maker 2 hands-on preview with mu…", "url": "https://www.nintendoenthusiast.com/2019/05/27/what-is-video-game-photography-and-why-should-nintendo-embrace-it/", "urlToImage": "https://www.nintendoenthusiast.com/wp-content/uploads/2019/05/Lakitu_Bro._Intro_-_Super_Mario_64.jpg", "publishedAt": "2019-05-27T14:05:56Z", "content": "Imagine traveling across the colorful vistas of Mushroom Kingdom or of the other numerous kingdoms within Marios epic journey in Super Mario Odyssey and thinking to yourself, ‘I want to capture this moment.’ In fact, not only do you want to take a quick snap … [+6343 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Robert Mueller’s Legacy Will Haunt Donald Trump", "description": "Here are all the ways that Trump and his Administration will have to deal with the fallout from the Russia investigation.", "url": "http://time.com/5598470/robert-mueller-investigation-haunt-donald-trump/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/donald-trump-robert-mueller-russia.jpg?quality=85", "publishedAt": "2019-05-31T15:08:17Z", "content": "When Robert Mueller spoke publicly this week for the first time since his appointment as special counsel, he said that his report released in April speaks for itself and that he was resigning from the Justice Department to return to private life. But while Mu… [+5924 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Johannes Lenhard", "title": "Homeless people aren't just sitting around – they actively strive to improve their lives", "description": "When I first met Daniel in front of Shoreditch High Street station in London, I didn't know how exhausting begging was. He was constantly moving, often through cold and rain. He addressed random passers-by all day long, mostly facing ignorance from their side…", "url": "https://phys.org/news/2019-05-homeless-people.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/homelesspeop.jpg", "publishedAt": "2019-05-16T14:20:01Z", "content": "When I first met Daniel in front of Shoreditch High Street station in London, I didn't know how exhausting begging was. He was constantly moving, often through cold and rain. He addressed random passers-by all day long, mostly facing ignorance from their side… [+5930 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Summer Said", "title": "SAUDI OIL TANKER SABOTAGE...", "description": "An initial U.S. assessment indicated Iran likely was behind the attack on two Saudi Arabian oil tankers and two other vessels damaged over the weekend near the Strait of Hormuz, a U.S. official said, a finding that, if confirmed, would further inflame militar…", "url": "https://www.wsj.com/articles/saudi-oil-tankers-attacked-before-entering-persian-gulf-11557725971", "urlToImage": "https://images.wsj.net/im-73866/social", "publishedAt": "2019-05-14T01:40:36Z", "content": "An initial U.S. assessment indicated Iran likely was behind the attack on two Saudi Arabian oil tankers and two other vessels damaged over the weekend near the Strait of Hormuz, a U.S. official said, a finding that, if confirmed, would further inflame militar… [+278 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Scyld Berry", "title": "England must beware the fearless aggression of Afghanistan in World Cup warm-up match", "description": "Any team not at their best - and England have so many injuries that again they will not be at full strength for their second World Cup warm-up - is going to be vulnerable when confronted by Afghanistan&rsquo;s unique style of cricket.", "url": "https://www.telegraph.co.uk/cricket/2019/05/26/england-must-beware-fearless-aggression-afghanistan-world-cup/", "urlToImage": "https://www.telegraph.co.uk/content/dam/cricket/2019/05/26/TELEMMGLPICT000198494503-xlarge_trans_NvBQzQNjv4BqaRL1kC4G7DT9ZsZm6Pe3PUPXbRlaI4_qh_dM2Z5d688.jpeg", "publishedAt": "2019-05-26T12:27:05Z", "content": "Any team not at their best - and England have so many injuries that again they will not be at full strength for their second World Cup warm-up - is going to be vulnerable when confronted by Afghanistans unique style of cricket.\r\nPakistans spontaneous surge, u… [+1101 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Telegraph Video", "title": "The Duke of Sussex steps into the ring with Anthony Joshua and Nicola Adams", "description": "The Duke of Sussex has joined the launch of an ambitious project to raise &pound;40 million to boost the work of charities delivering sport in disadvantaged communities.", "url": "https://www.telegraph.co.uk/news/2019/06/12/duke-sussex-steps-ring-anthony-joshua-nicola-adams/", "urlToImage": "https://www.telegraph.co.uk/content/dam/PortalPictures/June2019/JOSHUA-HARRY-88-xlarge.png", "publishedAt": "2019-06-12T16:04:45Z", "content": "\"This is about community, this is about providing opportunity to young people all over the place to actually be part of something, something they might not be getting at home, within their own community.\"\r\nWhen Harry first walked into the boxing gym, he watch… [+490 chars]"}, {"source": {"id": null, "name": "Readwrite.com"}, "author": "Amelia Grant", "title": "How Does Color Affect Your Potential Customers?", "description": "Color design can be an effective marketing tool if used correctly. Acting directly on the subconscious of the site visitor, the color in web design can form a positive attitude to the product, trust, and positive emotions that cause a person to make a purchas…", "url": "https://readwrite.com/2019/06/05/how-does-color-affect-your-potential-customers/", "urlToImage": "https://images.readwrite.com/wp-content/uploads/2019/05/How-Does-Color-Affect-Your-Potential-Customers.jpg", "publishedAt": "2019-06-05T18:00:04Z", "content": "Color design can be an effective marketing tool if used correctly. Acting directly on the subconscious of the site visitor, the color in web design can form a positive attitude to the product, trust, and positive emotions that cause a person to make a purchas… [+6743 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Reuters", "title": "Rafael Nadal Wins Record-Stretching 12th French Open Title", "description": "The Spanish tennis superstar beat Dominic Thiem in a three-hour match.", "url": "https://www.huffpost.com/entry/rafael-nadal-french-open_n_5cfd5860e4b02ee34778dd40", "urlToImage": "https://img.huffingtonpost.com/asset/5cfd5910250000590ddc1cd5.jpeg?ops=1910_1000", "publishedAt": "2019-06-09T19:11:22Z", "content": "PARIS, June 9 (Reuters) Defying the years and one of the most fierce onslaughts he has ever faced at Roland Garros, Rafael Nadal won his 12th French Open crown on Sunday, leaving Dominic Thiem crushed and a packed Parisian stadium shaking their heads in wonde… [+3762 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi-UAE coalition carries out deadly air raids on Yemen's Sanaa", "description": "At least six killed and dozens injured, sources tell Al Jazeera, as coalition jets hit residential areas in the capital.", "url": "https://www.aljazeera.com/news/2019/05/saudi-uae-coalition-carries-deadly-air-raids-yemen-sanaa-190516072613862.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/16/9578a26fb78c440686be297049159ca7_18.jpg", "publishedAt": "2019-05-16T09:11:06Z", "content": "At least six civilians, including a child, have been killed and dozens wounded in Saudi-UAE led coalition air raids on residential areas and Houthi rebel military targets in Yemen's capital, Sanaa.\r\nNine military sites in and around Sanaa were targeted on Thu… [+2606 chars]"}]}