{"status": "ok", "totalResults": 2206, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Julia Jacobs", "title": "After Dethroning a ‘Jeopardy!’ Giant, Emma Boettcher Relinquishes the Crown", "description": "The 27-year-old librarian who defeated James Holzhauer went on her own small streak, but it came to an end on Thursday.", "url": "https://www.nytimes.com/2019/06/06/arts/television/jeopardy-emma-boettcher-loses.html", "urlToImage": "https://static01.nyt.com/images/2019/06/06/arts/06jeopardy1/06jeopardy1-facebookJumbo.jpg", "publishedAt": "2019-06-06T23:52:42Z", "content": "Before Final Jeopardy on Thursday, Boettcher was trailing the leading player, Brendan Roach, by only $200. But when the host, Alex Trebek, said the final clue had to do with American music legends, Boettcher said, she knew it would be difficult for her. \r\nThe… [+984 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "RYOT Studio", "title": "Listen To Firsthand Accounts Of The Stonewall Riots In Augmented Reality", "description": "Fed up with years of abuse and oppression, the LGBTQ community fought back after a police raid. RYOT has creatively reimagined the events that took place...", "url": "https://www.huffpost.com/entry/experience-june-28-1969-at-the-stonewall-inn_n_5d014b63e4b0dc17ef0352c1", "urlToImage": "https://img.huffingtonpost.com/asset/5d014c97240000300f87759e.jpeg?cache=hykqdq070d&ops=1910_1000", "publishedAt": "2019-06-13T09:45:12Z", "content": "When the NYPD barged into the Stonewall Inn arresting LGBTQ patrons on June 28, 1969, they did not expect the community to fight back. But fed up with years of abuse and oppression, thats exactly what the community did rioting and occupying the streets into t… [+2238 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Sage Anderson", "title": "The best 'straight pride' memes for when you want to dunk on bigots", "description": "What's a pride parade without the rainbows, the public displays of LGBTQ love and community, and a history of resisting oppression spanning decades? A straight parade. Straight pride is neither real nor necessary. But every year during Pride month, like clock…", "url": "https://mashable.com/article/straight-pride-parade-memes/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F06%252F09%252F972616895cf647888f254123d52fd0ca.32a14.jpg%252F1200x630.jpg?signature=kI_nga4O9fez_N__npoKUZHipKU=", "publishedAt": "2019-06-06T17:56:39Z", "content": "What's a pride parade without the rainbows, the public displays of LGBTQ love and community, and a history of resisting oppression spanning decades? A straight parade.\r\nStraight pride is neither real nor necessary. But every year during Pride month, like cloc… [+2633 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "JON CARAMANICA", "title": "Album Review: For Jamila Woods, History Is Today’s Inspiration and Tomorrow’s Blueprint", "description": "The Chicago singer and poet pays tribute to creative titans and offers lessons on how to triumph over the challenges of everyday life on “Legacy! Legacy!”", "url": "https://www.nytimes.com/2019/05/15/arts/music/jamila-woods-legacy-legacy-review.html", "urlToImage": "https://static01.nyt.com/images/2019/05/15/arts/15ALBUM-WOODS/15ALBUM-WOODS-facebookJumbo.jpg", "publishedAt": "2019-05-15T19:29:52Z", "content": "There are people who raise you up close, and people who raise you from afar. Thats how we build our personal histories: by observing whats happening around us and learning to maneuver with (or around) it, and by allowing ourselves to dream, taking in art and … [+1990 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "MEENA KANDASAMY", "title": "Dalit Struggles in Modi’s India", "description": "The Bharatiya Janata Party’s rule came with an attack on Dalits and the minorities. Now Dalit leaders are fighting back to defeat the Hindu nationalists.", "url": "https://www.nytimes.com/2019/05/15/opinion/india-elections-dalits.html", "urlToImage": "https://static01.nyt.com/images/2019/05/16/opinion/15kandasamy/15kandasamy-facebookJumbo.jpg", "publishedAt": "2019-05-15T05:00:06Z", "content": "Likewise, education is an urgent issue for Indias Dalits and other marginalized people, because without modern education we wouldnt have been able to overcome the limitations imposed by the caste system.\r\nMr. Modi and his Hindu nationalist colleagues time and… [+2164 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "AOC calls Alabama's abortion ban 'a brutal form of oppression'", "description": "“Abortion bans aren’t just about controlling women’s bodies,” Rep. Alexandria Ocasio-Cortez, D-N.Y., tweeted. “They’re about controlling women’s sexuality. Owning women.”", "url": "https://news.yahoo.com/aoc-calls-alabamas-abortion-ban-a-brutal-form-of-oppression-152137572.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/vQDYnE50OHXV8JIHhQ0iag--~B/aD0yOTA0O3c9NDM1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cdd7be02400006f077f0650.jpeg", "publishedAt": "2019-05-16T15:21:37Z", "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., who has emerged as a leader among progressive Democrats, denounced Alabamas abortion ban after it was signed into law on Wednesday night.\r\nShe was joined by most of the partys presidential candidates.\r\nAbortion bans aren… [+3158 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Cyberpunk 2077 doesn’t look weird enough to be edgy", "description": "Cyberpunk 2077, the latest game from Witcher studio CD Projekt Red, is trying to build a bizarre dystopian world — but its disappointingly bland demo at E3 downplayed weirdness at every turn.", "url": "https://www.theverge.com/2019/6/14/18663534/cyberpunk-2077-cd-projekt-red-demo-interview-e3-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/yJ80BDcDwtQ39vVqJkHLfODxDGw=/205x0:2871x1396/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16329039/Screen_Shot_2019_06_09_at_4.22.17_PM.png", "publishedAt": "2019-06-14T14:54:12Z", "content": "At E3 2019, there are two versions of Cyberpunk 2077. First, there’s the version that developer CD Projekt Red — best known for the Witcher series — is teasing in interviews, presentations, swag, and posters lining the walls of its promotional booth. It’s a n… [+7824 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Patrick Howell O'Neill", "title": "IBM Sells Face Recognition Surveillance to a Dictatorship: Report", "description": "The United Arab Emirates is one of the 21st century’s most modern and forward thinking surveillance states. Read more...", "url": "https://gizmodo.com/ibm-sells-face-recognition-surveillance-to-a-dictatorsh-1835101881", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Wjs38OJp--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ajjqg0aodupzeroeyaca.jpg", "publishedAt": "2019-05-29T21:57:00Z", "content": "The United Arab Emirates is one of the 21st centurys most modern and forward thinking surveillance states.\r\nOne of the strongest economies in the Middle East, the UAE has for years invested heavily in being in the cutting edge of surveillance and repression. … [+3611 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Facial recognition smart glasses could make public surveillance discreet and ubiquitous", "description": "Facial recognition is becoming more common in public spaces, from airports and concert halls to train stations and arenas. But facial recognition-enabled smart glasses, like these built by Dubai-based company NNTC, would make the technology more ubiquitous an…", "url": "https://www.theverge.com/2019/6/10/18659660/facial-recognition-smart-glasses-sunglasses-surveillance-vuzix-nntc-uae", "urlToImage": "https://cdn.vox-cdn.com/thumbor/E7c0nvBnKY2uDJar7x0rZXNeRnw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10003615/nstatt_180108_2236_0022.jpg", "publishedAt": "2019-06-10T16:27:57Z", "content": "From train stations and concert halls to sport stadiums and airports, facial recognition is slowly becoming the norm in public spaces. But new hardware formats like these facial recognition-enabled smart glasses could make the technology truly ubiquitous, abl… [+4789 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Jason Weisberger", "title": "Petition the moron with a swastika in his El Sobrante front yard to knock it off", "description": "Reasonable folks in El Sobrante do not like living with a symbol of hatred and oppression out in the open. A petition asking the idiot who cemented a swastika in his yard to remove it has been created. A protest has been planned. Mr. Swastika thinks it is fun…", "url": "https://boingboing.net/2019/06/13/petition-the-moron-with-a-swas.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/06/swastika-AM.png", "publishedAt": "2019-06-13T14:25:16Z", "content": "Some folks in El Sobrante do not like living with a symbol of hatred and oppression out in the open. A petition asking the idiot who cemented a swastika in his yard to remove it has been created. A protest has been planned.\r\nMr. Swastika thinks it is funny th… [+1025 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Lee Moran", "title": "Ocasio-Cortez Breaks Down What ‘Horrifying’ Abortion Bans Are Really All About", "description": "\"Abortion bans aren’t just about controlling women’s bodies,\" the lawmaker tweeted.", "url": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-abortion-law-alabama_n_5cdd0d9ce4b0b4728ba31daf", "urlToImage": "https://img.huffingtonpost.com/asset/5cdd0efd24000032007f03c6.jpeg?cache=idehmhotih&ops=1910_1000", "publishedAt": "2019-05-16T07:35:55Z", "content": "Rep. Alexandria Ocasio-Cortez (D-N.Y.) joined the widespread and growing chorus of criticism of Alabamas strict new abortion law as she broke down what the effective banning of the procedure is really all about.\r\nThe lawmaker tweeted early Thursday that abort… [+1956 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mahita Gajanan", "title": "Emma Boettcher’s Jeopardy! Run Ends 3 Games After She Bested James Holzhauer", "description": "Emma Boettcher, the Jeopardy! champion who ended James Holzhauer's run, lost after a three-game streak.", "url": "https://time.com/5602877/emma-boettcher-loses-jeopardy/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/emma-boettcher-jeopardy.jpg?quality=85", "publishedAt": "2019-06-07T12:53:41Z", "content": "Emma Boettcher, the Jeopardy! champion who ended James Holzhauer’s legendary run on the quiz show just as he was set to break a significant record, lost after a three-game streak, coming in third in the episode that aired Thursday.\r\n“Being on Jeopardy! had to… [+1038 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Ryan Reed", "title": "Watch LGBTQ Activists Talk Stonewall Uprising in ‘Generation Woodstock’ Clip", "description": "\"We all decided to break off the shackles of 2,000 years of oppression. And that night, the police represented that oppression,\" eyewitness Mark Segal recalls in clip for 'ABC News' special", "url": "https://www.rollingstone.com/culture/culture-news/lgbtq-activists-stonewall-uprising-generation-woodstock-837651/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2019/05/stonewall-woodstock-generation.jpg", "publishedAt": "2019-05-20T19:07:04Z", "content": "LGBTQ activists document how they translated oppression into “joyous” rebellion in a trailer for Generation Woodstock, an upcoming ABC News special about the late Sixties counterculture movement that spawned both the titular music festival and the Stonewall U… [+2153 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "ltorres@businessinsider.com (Libby Torres), Libby Torres", "title": "A star of Nickelodeon's 'Henry Danger' opens up about his transgender experience: 'I transitioned'", "description": "Michael D. Cohen, star of Nickelodeon's longest-running live-action show \"Henry Danger,\" revealed in an interview with Time that he transitioned from female to male nearly 20 years ago. Cohen doesn't identify as transgender, saying that he has always felt tha…", "url": "https://www.insider.com/michael-d-cohen-nickelodeon-henry-danger-transgender-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce6f82f4cf27039097f97e1-1920-960.jpg", "publishedAt": "2019-05-23T19:42:35Z", "content": "Nickelodeon star Michael D. Cohen revealed in a new interview with Time magazine that he transitioned from female to male nearly 20 years ago. \r\n \"I was misgendered at birth,\" Cohen told TIME. \"I identify as male, and I am proud that I have had a transgender … [+2007 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "U.S. Considers Export Ban on Surveillance Company That Helps Send Muslims to China's Concentration Camps: Report", "description": "The U.S. government is considering a tech export ban that would target Hikvision, a Chinese video surveillance company that’s been instrumental in sending anywhere from 1 million to 3 million Muslims into China’s network of secretive concentration camps, acco…", "url": "https://gizmodo.com/u-s-considers-export-ban-on-surveillance-company-that-1834942021", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--l0JYaZNA--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/i2mtnzcv1i47uqzi8ojm.jpg", "publishedAt": "2019-05-22T11:40:00Z", "content": "The U.S. government is considering a tech export ban that would target Hikvision, a Chinese video surveillance company thats been instrumental in sending anywhere from 1 million to 3 million Muslims into Chinas network of secretive concentration camps, accord… [+4497 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Grace Panetta", "title": "Alabama's new anti-abortion law compares abortion to the Holocaust and other genocides", "description": "The text of Alabama's newly-passed abortion ban, HB 314, compares abortion to a number of genocide and historical ethnic cleansing events, including the Holocaust. Over the past several decades, opponents of abortion have frequently invoked emotionally charge…", "url": "https://www.businessinsider.com/alabama-abortion-ban-compares-abortion-to-the-holocaust-genocides-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cddab27021b4c12966d2672-1920-960.jpg", "publishedAt": "2019-05-16T18:39:57Z", "content": "The text of Alabama's newly-passed abortion ban, HB 314, compares abortion to a number of genocide and historical ethnic cleansing events including the Holocaust, Stalin's gulags, the Chinese \"Great Leap Forward,\" the Rwandan genocide, and the Cambodian genoc… [+2443 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Kimberly Yam", "title": "‘Krusty Krab Is Unfair’ Sign Already Won The NBA Finals", "description": "The finals already have their MVP.", "url": "https://www.huffpost.com/entry/krusty-krab-is-unfair-sign-already-won-the-nba-finals_n_5cf13c55e4b0e346ce7d1344", "urlToImage": "https://img.huffingtonpost.com/asset/5cf145fc2400005e078563cd.jpeg?ops=1200_630", "publishedAt": "2019-05-31T16:24:17Z", "content": "The NBA Finals between the Toronto Raptors and the Golden State Warriors may not be over yet, but the game has already been won. \r\nViewers spotted a passionate protester in the crowd this week at Jurassic Park, a Raptors’ fan area outside the team’s arena, ho… [+1250 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Jack Morse", "title": "Here's why San Francisco's vote to ban facial-recognition tech matters", "description": "San Francisco just voted to ban facial-recognition technology. The city that has for many come to symbolize the power of tech, both in all its terror and glory, took an important step on Tuesday to rein in some of that power. The city's Board of Supervisors v…", "url": "https://mashable.com/article/san-francisco-bans-facial-recognition-technology/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F14%252Fa0%252Fca80e61527cc418296fc02bf9ca2647c.5789f.jpg%252F1200x630.jpg?signature=fi1zfVJ4nIL8t0uPWSp32VK1HeY=", "publishedAt": "2019-05-14T21:59:18Z", "content": "San Francisco just voted to ban facial-recognition technology.\r\nThe city that has for many come to symbolize the power of tech, both in all its terror and glory, took an important step on Tuesday to rein in some of that power. The city's Board of Supervisors … [+5803 chars]"}, {"source": {"id": null, "name": "Longform.org"}, "author": "editors", "title": "Living Amid Fear and Oppression in Xinjiang", "description": "My wife is not a terrorist.", "url": "https://longform.org/posts/living-amid-fear-and-oppression-in-xinjiang", "urlToImage": "https://longform.org/uploads/post/key_image/12827/landscape_190417160558-kashgar-xinjiang-camp-exlarge-169.jpg", "publishedAt": "2019-05-14T14:15:19Z", "content": "Great new articles, every day."}, {"source": {"id": null, "name": "Chemistryworld.com"}, "author": "", "title": "Jury awards $2bn damages in US glyphosate trial - Chemistry World", "description": "Jury awards $2bn damages in US glyphosate trial Chemistry World Monsanto parent company Bayer faces thousands of Roundup-cancer cases after $2 billion verdict NBC News No Better Time To Buy Bayer Seeking Alpha Consumers looking for alternatives to popular wee…", "url": "https://www.chemistryworld.com/news/jury-awards-2bn-damages-in-us-glyphosate-trial/3010511.article", "urlToImage": "https://d1w9csuen3k837.cloudfront.net/Pictures/2000x2000fit/8/6/8/142868_shutterstock_1156814209.jpg", "publishedAt": "2019-05-20T13:40:24Z", "content": "Bayer vows to appeal third defeat over Monsantos Roundup weedkiller, while experts suggest damages will likely be reducedBayer has faced its third legal defeat in the US in cases claiming glyphosate-based weedkiller Roundup causes cancer. A California jury or… [+2924 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Suyin Haynes", "title": "Transgender Activists at the Center of Stonewall Riots Will Be Honored With a Monument in New York", "description": "A monument near the Stonewall Inn will commemorate Sylvia Rivera and Marsha P. Johnson, two transgender activists who took part in the riots", "url": "http://time.com/5598110/sylvia-rivera-marsha-johnson-monument-stonewall/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/sylvia-rivera-stonewall.jpg?quality=85", "publishedAt": "2019-05-30T15:58:17Z", "content": "Two transgender activists and key figures of the 1969 Stonewall riots will be honored with a monument dedicated to them in New York City, officials announced Thursday.\r\nWidely considered to be pioneers of the LGBTQ rights movement, the Associated Press report… [+1749 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Glenn Kenny", "title": "‘Funan’ Review: An Unflinching, Animated Story of Survival", "description": "Denis Do tells a grim tale of captivity and oppression in 1970s Cambodia.", "url": "https://www.nytimes.com/2019/06/06/movies/funan-review.html", "urlToImage": "https://static01.nyt.com/images/2019/06/03/arts/funan1/funan1-facebookJumbo.jpg", "publishedAt": "2019-06-06T11:00:02Z", "content": "In 1988, the Japanese director Isao Takahata broke new ground in animation with Grave of the Fireflies, an almost unbearably grim story of children in a devastated post-World War II Kobe. That picture used the medium of animation not just to depict the depriv… [+532 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Nicholas Cannariato, Rupa Bhattacharya", "title": "Eve L. Ewing’s New Book Explores the Ways Violence and Time Affect Black Lives", "description": "One hundred years after the Chicago Race Riot, '1919' reflects on a century of exodus and deliverance for Black Americans.", "url": "https://www.vice.com/en_us/article/d3nwex/eve-l-ewings-new-book-explores-the-ways-violence-and-time-affect-black-bodies", "urlToImage": "https://video-images.vice.com/articles/5cf8348dd3f60b00082107fe/lede/1559772006822-Copy-of-Serious-Square-1_1-Image.png?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2019-06-06T12:00:00Z", "content": "Eve L. Ewing has accomplished a lot in just a little time. Shes a sociology professor at the University of Chicago, the author of Ironheart, a Marvel comic book, two poetry collections, a play (with poet Nate Marshall) about the Chicago poet Gwendolyn Brooks,… [+5944 chars]"}, {"source": {"id": null, "name": "Burlingtonfreepress.com"}, "author": "Burlington Free Press, Sadie Housberg, Burlington Free Press", "title": "Flag-burning during Pride Month prompts reflection on nation's rise in hate crimes", "description": "Police efforts to respond with empathy to victims of hate crimes break with a  history of brutality, discrimination by law enforcement nationwide.", "url": "https://www.burlingtonfreepress.com/story/news/2019/06/10/burlington-flag-burning-pride-month-reflects-rise-hate-crimes/1366520001?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/06/06/PBUR/6341bd0e-cd6b-4609-a42e-916dcba28f38-image1.jpeg?crop=575,328,x0,y326&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-11T12:07:18Z", "content": "A brand new Pride Flag hangs at the home of Christopher Vaccaro and Jimmie Searle, victims of a recent hate crime in the North end of Burlington.\r\n (Photo: Courtesy Christopher Vaccaro)\r\nBURLINGTON, Vt. Scorch marks and the melted plastic remnants of a Vermon… [+6492 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "John Hopewell", "title": "The Swallows of Kabul’s’ Zabou Breitman, Eléa Gobbé-Mévellec On Tackling Oppression With Art", "description": "CANNES — “The Swallows of Kabul” marks a new step forward for co-directors Zabou Breitman and Eléa Gobbé-Mévellec. A leading figure of French film and theatre, Breitman had never worked in animation before, so she teamed with up-and-coming talent Gobbé-Mévell…", "url": "https://variety.com/2019/film/festivals/the-swallows-of-kabuls-zabou-breitman-elea-gobbe-mevellec-on-tackling-oppression-with-art-1203216635/", "urlToImage": "https://pmcvariety.files.wordpress.com/2019/05/les_hirdondelles_de_kaboul_s016_sc007_promo_00154_oke294ace28c90_les_armateurs.jpg?w=700&h=393&crop=1", "publishedAt": "2019-05-16T04:30:36Z", "content": "CANNES  —  “The Swallows of Kabul” marks a new step forward for co-directors Zabou Breitman and Eléa Gobbé-Mévellec. A leading figure of French film and theatre, Breitman had never worked in animation before, so she teamed with up-and-coming talent Gobbé-Méve… [+5557 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sadie Housberg", "title": "Flag-burning during Pride Month prompts reflection on nation's rise in hate crimes", "description": "Police efforts to respond with empathy to victims of hate crimes break with a history of brutality, discrimination by law enforcement nationwide.", "url": "https://news.yahoo.com/flag-burning-during-pride-month-120718539.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-06-11T12:07:18Z", "content": "A brand new Pride Flag hangs at the home of Christopher Vaccaro and Jimmie Searle, victims of a recent hate crime in the North end of Burlington.\r\nBURLINGTON, Vt. Scorch marks and the melted plastic remnants of a Vermont couple's Pride Flag cling to the banis… [+6299 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Ivanka Trump Wants More Women Involved in Peace Processes", "description": "In major peace talks from 1990 to 2017, women made up just 2% of mediators, 8% of negotiators and 5% of witnesses and signatories, according to the United Nations. Ivanka Trump wants to change that. In a roundtable discussion with lawmakers from both parties …", "url": "https://time.com/5605039/ivanka-trump-women-peace/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/ivanka-roundtable-women-security.jpg?quality=85", "publishedAt": "2019-06-13T03:33:45Z", "content": "In major peace talks from 1990 to 2017, women made up just 2% of mediators, 8% of negotiators and 5% of witnesses and signatories, according to the United Nations.\r\nIvanka Trump wants to change that.\r\nIn a roundtable discussion with lawmakers from both partie… [+3170 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Hazel Cills on The Muse, shared by Hazel Cills to Jezebel", "title": "Late Night's Retrograde Views of Women in Comedy", "description": "There are many dramatic moments in Late Night in which a character takes a stand. A too-demanding job is walked out on, a subordinate is coldly deemed inconsequential, fists are raised in the face of “white oppression.” And yet by the end of the film, it’s ha…", "url": "https://themuse.jezebel.com/late-nights-retrograde-views-of-women-in-comedy-1835205864", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--MeYsqvP8--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rk1rwo11qcqp9qo6yz17.png", "publishedAt": "2019-06-06T17:00:00Z", "content": "There are many dramatic moments in Late Night in which a character takes a stand. A too-demanding job is walked out on, a subordinate is coldly deemed inconsequential, fists are raised in the face of white oppression. And yet by the end of the film, its hard … [+5994 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Travis Langley Ph.D.", "title": "M'Baku of Two Worlds: Religious Freedom vs. Oppression", "description": "Black Panther supporting character M'Baku becomes an ally in film but enemy to T'Challa in comics. A difference in filmmaker story choice or a response to religious oppression?", "url": "https://www.psychologytoday.com/ca/blog/beyond-heroes-and-villains/201905/mbaku-two-worlds-religious-freedom-vs-oppression", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-05/duke.jpg?itok=fOXfOIKu", "publishedAt": "2019-05-27T22:05:24Z", "content": "References\r\nBracha, H. S., Ralston, T. C., Matsukawa, J. M., Williams, A. E., &amp; Bracha, A. S. (2004). Does fight or flight need updating? Psychosomatics: Journal of Consultation &amp; Liaison Psychiatry, 45(5), 448-449.\r\nEndler, N. S., &amp; Shedletsky, R… [+371 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Travis Langley Ph.D.", "title": "M'Baku of Two Worlds: Religious Freedom vs. Oppression", "description": "Black Panther supporting character M'Baku becomes an ally in film but enemy to T'Challa in comics. A difference in filmmaker story choice or a response to religious oppression?", "url": "https://www.psychologytoday.com/us/blog/beyond-heroes-and-villains/201905/mbaku-two-worlds-religious-freedom-vs-oppression", "urlToImage": null, "publishedAt": "2019-05-27T22:05:24Z", "content": null}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "THOMAS CHATTERTON WILLIAMS", "title": "The SAT’s Bogus ‘Adversity Score’", "description": "Are we really going to rank students on a one-to-100 pseudoscientific index of oppression?", "url": "https://www.nytimes.com/2019/05/17/opinion/sat-adversity-score.html", "urlToImage": "https://static01.nyt.com/images/2019/05/17/opinion/17Williams/17Williams-facebookJumbo.jpg", "publishedAt": "2019-05-17T19:02:25Z", "content": "As the recent admissions scandals at Yale, the University of Southern California and other colleges have demonstrated, the rich and entitled enjoy an astonishing array of ways to game the system, and aptitude tests are far from perfect. \r\nIt is for this reaso… [+2253 chars]"}, {"source": {"id": null, "name": "Nybooks.com"}, "author": "Adam Tooze", "title": "Democracy and Its Discontents", "description": "For the American right, Donald Trump’s inauguration as the forty-fifth president of the United States was a moment of political rebirth. Elements of American conservatism had long fostered a reactionary counterculture, which defined the push for civil rights …", "url": "https://www.nybooks.com/articles/2019/06/06/democracy-and-its-discontents/", "urlToImage": "https://cdn.nybooks.com/wp-content/uploads/2019/05/tooze_1-060619.jpg", "publishedAt": "2019-05-19T12:00:50Z", "content": "Harvard University Press, 393 pp., $29.95\r\nby Steven Levitsky and Daniel Ziblatt\r\nBroadway, 302 pp., $15.00 (paper)\r\nTim Duggan Books, 359 pp., $27.00\r\nBasic Books, 249 pp., $27.00\r\nMatt Stuart/Magnum PhotosA protest against the G20 summit, Hamburg, Germany, … [+29878 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "New Documentary Explores Chelsea Manning’s Fight To Live Her Truth", "description": "In Showtime's \"XY Chelsea,\" filmmaker Tim Travers Hawkins aims to reframe the media's narrative around the Army whistleblower, who identifies as transgen...", "url": "https://www.huffpost.com/entry/xy-chelsea-manning-showtime-documentary_n_5cf672bfe4b0e8085e40b5e7", "urlToImage": "https://img.huffingtonpost.com/asset/5cf6e1f0210000690de6960f.jpeg?cache=ua4gt8d8o9&ops=1910_1000", "publishedAt": "2019-06-05T12:49:56Z", "content": "Filmmaker Tim Travers Hawkins aims to relay former Army intelligence analyst Chelsea Mannings sense of principles and sacrifice in a new, sure-to-be-controversial documentary. \r\nXY Chelsea, which premiered at the 2019 Tribeca Film Festival in May and airs Fri… [+3049 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBSDenver", "title": "CO City Becomes 'Second Amendment Sanctuary City'...", "description": "CO City Becomes 'Second Amendment Sanctuary City'... (Second column, 12th story, link ) Related stories: CULTURE WARS: GOLDEN STATE Coach Wears Gun Control Shirt to NBA Finals... Dodgeball unethical tool of 'oppression': Researchers... POLL: Over 75% of Colle…", "url": "https://denver.cbslocal.com/2019/06/04/commerce-city-second-amendment-sanctuary-city-red-flag-law/", "urlToImage": "https://cbsdenver.files.wordpress.com/2018/01/commerce-city.jpg?w=1500", "publishedAt": "2019-06-04T20:07:40Z", "content": "COMMERCE CITY, Colo. (CBS4) – Two months after Gov. Jared Polis signed the state’s “red flag” gun bill into law, another Colorado community has declared itself a Second Amendment sanctuary city. Five members on the Commerce City Council voted for the resoluti… [+2304 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Gina Martinez and Tara Law", "title": "Two Recent Murders of Black Trans Women in Texas Reveal a Nationwide Crisis, Advocates Say", "description": "The deaths of two African-American trans women in Dallas is bringing national attention to violence against the transgender community.", "url": "https://time.com/5601227/two-black-trans-women-murders-in-dallas-anti-trans-violence/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/gettyimages-647674460.jpg?quality=85", "publishedAt": "2019-06-06T00:25:11Z", "content": "The violent deaths of two African-American trans women in Dallas is bringing national attention to the epidemic of violence against the transgender community, an epidemic which disproportionately affects trans women of color. \r\nDallas police are investigating… [+9533 chars]"}, {"source": {"id": null, "name": "Aldergrovestar.com"}, "author": "Ashley Wadhwani", "title": "First Nations people in BC four times more likely to die of an overdose - Aldergrove Star", "description": "First Nations people in BC four times more likely to die of an overdose Aldergrove Star As B.C. sees an overall plateau in high rates of fatal overdoses, First Nations deaths still on the rise. View full coverage on Google News", "url": "https://www.aldergrovestar.com/news/first-nations-people-in-b-c-four-times-more-likely-to-die-of-an-overdose/", "urlToImage": "https://www.aldergrovestar.com/wp-content/uploads/2019/05/17040396_web1_17973524-1024x692.jpg", "publishedAt": "2019-05-28T22:24:55Z", "content": "First Nations people in B.C. are four times more likely to die of an overdose than the rest of the province, according to new data from the dedicated health authority.\r\nOf the 1,514 deaths last year in B.C. caused by illicit fentanyl and other opioids, 193 we… [+3915 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "EditorDavid", "title": "Why Some Businesses Really Hate Yelp", "description": "An anonymous reader quotes Slate: The overall argument of Billion Dollar Bully, the new documentary about Yelp released on Amazon and iTunes in May, is that Yelp extorts small business owners for advertising fees in return for helping to manage and improve re…", "url": "https://entertainment.slashdot.org/story/19/06/09/2038216/why-some-businesses-really-hate-yelp", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2019-06-09T20:43:00Z", "content": "The overall argument of Billion Dollar Bully, the new documentary about Yelp released on Amazon and iTunes in May, is that Yelp extorts small business owners for advertising fees in return for helping to manage and improve reviews on their platform... Yelp ha… [+669 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Max Smolaks", "title": "Big payout for Dell, Apple et al as Toshiba Mem 'prepares' to buy them out ahead of IPO", "description": "But not Bain; Bain is there for the long haul Silicon printer Toshiba Memory Holdings is reportedly planning to buy out major shareholders including Apple, Dell, Kingston and Seagate, as it prepares to try its luck in the public markets.… <!--#include virtual…", "url": "https://www.theregister.co.uk/2019/05/21/toshiba_memory_could_wave_goodbye_to_investors_including_dell_apple/", "urlToImage": "https://regmedia.co.uk/2016/04/08/tosh_q300s_950.jpg", "publishedAt": "2019-05-21T06:04:12Z", "content": "Silicon printer Toshiba Memory Holdings is reportedly planning to buy out major shareholders including Apple, Dell, Kingston and Seagate, as it prepares to try its luck in the public markets.\r\nThe company could spend to the tune of ¥500bn ($4.5bn) to liberate… [+1731 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tina Hassannia", "title": "Sansa Stark will forever be Game of Thrones’ undersung ruler", "description": "Sansa (Sophie Turner) has been around since GoT season 1. She’s come a long way, surviving Joffrey, Cersei, Ramsay, Littlefinger, and Daenerys. So why is Bran king? We dig into the past and present of Sansa’s controversial, unsung road to Game of Thrones’ las…", "url": "https://www.polygon.com/game-of-thrones/2019/5/20/18632523/game-of-thrones-finale-ending-sansa-queen-north", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Npds7uYj8f3KBt8qTWFxytuSl_g=/0x0:1234x646/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16288160/Screen_Shot_2019_05_20_at_9.46.03_AM.png", "publishedAt": "2019-05-20T18:55:27Z", "content": "Im a slow learner, its true. But I learn. Sansa Stark \r\nAll hail the new leader of the Six Kingdoms: not Jon, Dany, Sansa, or Tyrion but King Bran Stark. The words are strange to read or say aloud. While its a twist that few expected, the idea of a dispassion… [+7616 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Donald Trump Campaigned as a President for LGBTQ Americans. But He Keeps Rolling Back Protections for Them", "description": "As a presidential candidate, Donald Trump repeatedly vowed to protect LGBTQ Americans. When a debate broke out over which bathrooms transgender individuals should be able to use, Trump told the Today show that Caitlyn Jenner could use any bathroom she wanted …", "url": "http://time.com/5595474/donald-trump-roll-back-transgender-protections/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/trump-lgbt-rollbacks.jpg?quality=85", "publishedAt": "2019-05-26T15:35:22Z", "content": "As a presidential candidate, Donald Trump repeatedly vowed to protect LGBTQ Americans.\r\nWhen a debate broke out over which bathrooms transgender individuals should be able to use, Trump told the Today show that Caitlyn Jenner could use any bathroom she wanted… [+5023 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Here’s Who Ended Up on the Throne in the Game of Thrones Series Finale", "description": "Warning: This post contains spoilers for Game of Thrones season 8. Throughout Game of Thrones‘ eight-season run, many fans have had the same question: “who will sit on the Iron Throne in the end?” When Thrones began, we learned that King Robert Baratheon had …", "url": "http://time.com/5591578/game-of-thrones-ending-winner/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/03/got-featured-image.jpg?quality=85", "publishedAt": "2019-05-20T03:21:13Z", "content": "Warning: This post contains spoilers for Game of Thrones season 8.\r\nThroughout Game of Thrones‘ eight-season run, many fans have had the same question: “who will sit on the Iron Throne in the end?”\r\nWhen Thrones began, we learned that King Robert Baratheon ha… [+5083 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Kayla Kumari Upadhyaya on TV Club, shared by Kayla Kumari Upadhyaya to The A.V. Club", "title": "In its second season premiere, Pose expertly blends the personal with the political", "description": "Pose begins its second season in 1990 in a graveyard of nameless, endless tombs. It’s a striking visual representation of the way the world tried to strip HIV-positive people of their humanity, punishing and isolating them even in death. It’s a grand statemen…", "url": "https://tv.avclub.com/in-its-second-season-premiere-pose-expertly-blends-the-1835433911", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gILEassS--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/fgmr6lmb762txyvfc7py.jpg", "publishedAt": "2019-06-12T03:30:00Z", "content": "Pose begins its second season in 1990 in a graveyard of nameless, endless tombs. Its a striking visual representation of the way the world tried to strip HIV-positive people of their humanity, punishing and isolating them even in death. Its a grand statement,… [+5137 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Heather Snowden", "title": "Kylie Jenner Gets Called Out for Throwing a ‘Handmaid’s Tale’-Themed Party", "description": "Over the weekend, Kylie Jenner and model Sofia Richie threw a party for friend Anastasia Karanikolaou’s birthday. It was a costume affair themed around Hulu’s dystopian series The Handmaid’s Tale, and, unsurprisingly, given the show and source novel’s nightma…", "url": "https://www.highsnobiety.com/p/kylie-jenner-handmaids-tale/", "urlToImage": "https://static.highsnobiety.com/thumbor/wIUEVU1S83j8XvqGRKe9Wkj2x2g=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2019/06/11104328/kylie-jenner-handmaids-tale-00.jpg", "publishedAt": "2019-06-11T11:13:21Z", "content": "Over the weekend, Kylie Jenner and model Sofia Richie threw a party for friend Anastasia Karanikolaou’s birthday. It was a costume affair themed around Hulu’s dystopian series The Handmaid’s Tale, and, unsurprisingly, given the show and source novel’s nightma… [+3452 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "David Millward", "title": "Owners of replica Noah's Ark sue insurers for flood damage compensation", "description": "Noah's Ark may have survived an epic flood, unfortunately the owners of a replica in Williamstown, Kentucky appear to have been less fortunate.", "url": "https://www.telegraph.co.uk/news/2019/05/26/owners-replica-noahs-ark-sue-insurers-flood-damage-compensation/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/25/TELEMMGLPICT000198421805-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg", "publishedAt": "2019-05-26T09:55:14Z", "content": "While admitting that the loss suffered by Ark Encounter was covered by the policy, the insurers denied liability claiming the damage was due in part to design deficiencies and faulty workmanship. \r\nIn response, the biblical theme park's owners, who are seekin… [+421 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Perlita Stroh", "title": "'It's impossible to turn away from this job': photographer Lynsey Addario on what drives her into danger", "description": "The most dangerous places on the planet exert an irresistible pull on Lynsey Addario, and the Pulitzer Prize-winning photojournalist has never shied away from shining a spotlight on victims of war and oppression despite the peril it puts her in.", "url": "https://www.cbc.ca/news/world/national-lynsey-addario-interview-1.5136566", "urlToImage": "https://i.cbc.ca/1.5139433.1558042428!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/lynsey-addario.jpg", "publishedAt": "2019-05-20T08:00:00Z", "content": "(This story contains graphic imagery.)\r\nThe most dangerous places on the planet exert an irresistible pull on Lynsey Addario.\r\n\"It's impossible to turn away from this job, it's impossible to stop doing it,\" the celebrated war photographer says.\r\nOver the past… [+5481 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Charlotte Shane", "title": "How Do We Make Cis Men Give a Shit About Abortion?", "description": "Anti-abortion activists have been bashing away at abortion’s legality and accessibility for decades, but the past two weeks have been especially dramatic. On May 15th, Alabama passed the most restrictive law in the nation, which would grant no exceptions for …", "url": "https://jezebel.com/how-do-we-make-cis-men-give-a-shit-about-abortion-1834928975", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--akPhoDuQ--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/jytvuqlqnluxa0bt7guu.png", "publishedAt": "2019-05-22T17:20:00Z", "content": "Anti-abortion activists have been bashing away at abortions legality and accessibility for decades, but the past two weeks have been especially dramatic. On May 15th, Alabama passed the most restrictive law in the nation, which would grant no exceptions for r… [+7341 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ziauddin Yousafzai", "title": "What Being Malala’s Father Taught Me About Feminism", "description": "Long before my daughter, Malala Yousafazi, was born, long before we began fighting for girls’ rights to education together, and long before the Taliban’s brutal attack on her brought the world’s attention to her story, I made a decision. Growing up in a villa…", "url": "https://time.com/5605625/malala-yousafzai-father/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/dsc01651.jpg?quality=85", "publishedAt": "2019-06-14T14:30:45Z", "content": "Long before my daughter, Malala Yousafazi, was born, long before we began fighting for girls’ rights to education together, and long before the Taliban’s brutal attack on her brought the world’s attention to her story, I made a decision.\r\nGrowing up in a vill… [+4822 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Henry DeVries, Contributor, Henry DeVries, Contributor https://www.forbes.com/sites/henrydevries/", "title": "Why Maine Banning Indian Mascots Is A Marketing Wake Up Call", "description": "From a marketing standpoint, why would an organization want a symbol that many Americans deem offensive? In May of 2019 Maine banned the use of Native American mascots in its public schools and colleges.", "url": "https://www.forbes.com/sites/henrydevries/2019/06/01/why-maine-banning-indian-mascots-is-a-marketing-wake-up-call/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fd394969980324e45bc1b1821df29d96b%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-06-01T10:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nWashington Redskins quarterback Dwayne Haskins Jr., right, hands off to running back Craig Reynolds during a practice at the team's NFL football practice facility, Monday, May 20, 2019, in Ashburn, Va. (… [+7251 chars]"}, {"source": {"id": null, "name": "Itsnicethat.com"}, "author": "Rebecca Irvin", "title": "Uma Bista’s photographs address gender inequality in Nepalese communities", "description": "With her series, Our Songs from the Forest, Nepalese photographer Uma Bista photographs young women entering into adulthood in the hillside communities of Achham, documenting their quiet resistance to oppressive cultural practices.", "url": "https://www.itsnicethat.com/articles/uma-bista-our-songs-from-the-forest-photography-220519", "urlToImage": "https://www.itsnicethat.com/system/files/052019/5ce52af07fa44ce9c90004dd/index_default/uma-bista-our-songs-from-the-forest-photography-itsnicethat-list.png?1558526448", "publishedAt": "2019-05-22T12:00:00Z", "content": "Our Songs from the Forest poses the question: How to push for freedom from the everyday chhaupadi? In her photographs, Uma captures the womens characters away from the cultural regulations that place boundaries on their self-expression. For these young women,… [+1755 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jon Blistein", "title": "Perry Farrell Rips Strongmen in New ‘Pirate Punk Politician’ Video", "description": "Protest song will appear on Jane's Addiction frontman's upcoming solo LP, Kind Heaven", "url": "https://www.rollingstone.com/music/music-news/perry-farrell-pirate-punk-politician-music-video-839645/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2019/05/perry-farrell-video.jpg", "publishedAt": "2019-05-24T17:11:25Z", "content": "Perry Farrell unleashes a blast of blistering agitprop in the video for his new song, “Pirate Punk Politician.” The track will appear on the Jane’s Addiction frontman’s new album, Kind Heaven, out June 7th via BMG.\r\nPer a statement, the video was directed by … [+973 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Jen Pinkowski", "title": "How Donna Zuckerberg and other classicists resist hate groups’ use of antiquity", "description": "White supremacists and misogynists see the ancient Mediterranean as a touchstone. A group of concerned scholars have taken to the web to sound the alarm. When members of the Unite the Right rally marched through Charlottesville on August 11, 2017 in polo shir…", "url": "https://www.fastcompany.com/90356739/how-scholars-are-pushing-back-on-hate-groups-embrace-of-antiquity?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-donna-zuckerberg-resists-hate-groups-embrace-of-classics.jpg", "publishedAt": "2019-05-30T12:59:08Z", "content": "When members of the Unite the Right rally marched through Charlottesville on August 11, 2017 in polo shirts and carrying tiki torches, Twitter went wild with jokes. “When you have to use a Polynesian cultural product (tiki torches) to defend and assert white … [+15820 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "The Face", "title": "Exploring the toxic world of 'female privilege'", "description": "It was early on Saturday morning when I crossed the threshold into a quarantined community. I was entering r/TheRedPill, a subreddit dedicated to radical misogyny. This breeding ground of anti-women invective and conspiracy theories is so brazenly hostile, it…", "url": "https://mashable.com/article/exploring-the-toxic-world-of-female-privilege/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F17%252F02%252F04d80a5089be4ed8b4d069bb6efcb077.53a4b.png%252F1200x630.png?signature=husXJ67gzdOwgIDDHQ3Um93BqSE=", "publishedAt": "2019-05-17T20:47:01Z", "content": "It was early on Saturday morning when I crossed the threshold into a quarantined community. I was entering r/TheRedPill, a subreddit dedicated to radical misogyny. This breeding ground of anti-women invective and conspiracy theories is so brazenly hostile, it… [+11765 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Heather Dockray", "title": "Self-care isn't enough. We need community care to thrive.", "description": "If you've spent any time on planet Earth in the past five years, chances are that someone has recommended that you \"Take some time for self-care.\" Maybe a friend has encouraged you to enjoy a \"Treat yo' self\" kind of day. Maybe they’ve told you to make yourse…", "url": "https://mashable.com/article/community-care-versus-self-care/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F24%252Fb5%252Fc7691443d5ff4d3aa89112731facfb94.36421.jpg%252F1200x630.jpg?signature=DKe0h2XWIXo8wUax-LFk_R80om8=", "publishedAt": "2019-05-24T18:45:00Z", "content": "If you've spent any time on planet Earth in the past five years, chances are that someone has recommended that you \"Take some time for self-care.\" Maybe a friend has encouraged you to enjoy a \"Treat yo' self\" kind of day. Maybe theyve told you to make yoursel… [+15340 chars]"}, {"source": {"id": null, "name": "Brainpickings.org"}, "author": "Maria Popova", "title": "Toni Morrison on the Power of Art and the Writer’s Singular Service to Humanity", "description": "\"Art invites us to know beauty and to solicit it from even the most tragic of circumstances. Art reminds us that we belong here. And if we serve, we last.\"", "url": "https://www.brainpickings.org/2019/05/16/toni-morrison-writing-art/", "urlToImage": "https://i0.wp.com/www.brainpickings.org/wp-content/uploads/2016/11/tonimorrison.jpg?fit=896%2C564&ssl=1", "publishedAt": "2019-05-16T06:00:51Z", "content": "“Art is not a plaything, but a necessity, and its essence, form, is not a decorative adjustment, but a cup into which life can be poured and lifted to the lips and be tasted,” Rebecca West — one of humanity’s most insightful and underappreciated writers — obs… [+3753 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Alexandra DeSanctis", "title": "Heartbeat-Bill Opponents Reveal Their Own Incoherence", "description": "This natural tendency to abhor injustice and oppression explains why the arguments in favor of abortion rights become increasingly inane with every passing day", "url": "https://www.nationalreview.com/2019/05/heartbeat-bill-abortion-opponents-reveal-their-own-incoherence/", "urlToImage": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/05/RTX6VA9P.jpg?fit=1200%2C700&ssl=1", "publishedAt": "2019-05-16T17:45:40Z", "content": "Pro-choice demonstrators in London, Britain, May 11, 2019(Peter Nicholls/Reuters)\r\nThe arguments they devise undercut themselves.It is difficult to find anyone willing to defend the right to end innocent human life.\r\nThis is something we should celebrate. Hum… [+6148 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Allie Yang", "title": "Stonewall riots 50 years later: 'We were fighting and it was for our lives'", "description": "“There was... a shoe or a brick thrown,” said Miss Major Griffin-Gracy, a transgender rights activist who frequented the bar. \"We were fighting... for our lives.\"", "url": "https://abcnews.go.com/US/lgbt-activists-remember-stonewall-riots-50-years-fighting/story?id=63083481", "urlToImage": "https://s.abcnews.com/images/US/stonewall-riots-file-gty-jef-190517_hpMain_16x9_992.jpg", "publishedAt": "2019-05-21T11:53:36Z", "content": "In 1969, Mark Segal was just 18 years old. He was at the Stonewall Inn on June 28 when riots at the New York City gay bar changed the course of LGBTQ+ rights in America forever.\r\nSegal went on to become one of the youngest members of the Gay Liberation Front,… [+8024 chars]"}, {"source": {"id": null, "name": "Complex.com"}, "author": "Tara Mahadevan", "title": "Dodgeball Is a Means of 'Oppression' According to Researchers", "description": "Researchers argue that dodgeball is a way for the more athletic and authoritative students to gang up on other kids.", "url": "https://www.complex.com/sports/2019/06/dodgeball-oppression-dehumanize-others-researchers", "urlToImage": "https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1/mw1y0n1wevcvq0lgpfgu/dodgeball-oppression", "publishedAt": "2019-06-09T17:22:30Z", "content": "Dodgeball is being as a means for “oppression,” according to Canadian professors. The Washington Post reports that educators from three of the country's universities believer that dodgeball in physical education classes teaches children to dehumanize and act … [+1613 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Christian Publisher: Private Jets Let Pastors Avoid “Oppression” of Basic Planes", "description": "There's no reason anyone should be defending preacher Kenneth Copeland's greed.", "url": "https://friendlyatheist.patheos.com/2019/06/05/christian-publisher-private-jets-let-pastors-avoid-oppression-of-basic-planes/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2019/05/CopelandIECrazy-768x429.png", "publishedAt": "2019-06-05T16:30:50Z", "content": "Televangelist Kenneth Copeland is back in the news after a recent interview for Inside Editionwent viral. It involved him defending his lavish lifestyle, including his purchase of a private jet so that he doesn’t have to fly like everyone else in a long tube … [+2495 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "VP Pence says he talked to Venezuelan opposition leader Guaido", "description": "U.S. Vice President Mike Pence said he talked to Venezuelan opposition leader Juan Guaido by phone on Wednesday and called again for Venezuelan President Nicolas Maduro to go.", "url": "https://www.reuters.com/article/us-venezuela-politics-pence-idUSKCN1SZ2V1", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190529&t=2&i=1392281360&w=1200&r=LYNXNPEF4S1YB", "publishedAt": "2019-05-29T21:52:54Z", "content": "WASHINGTON (Reuters) - U.S. Vice President Mike Pence said he talked to Venezuelan opposition leader Juan Guaido by phone on Wednesday and called again for Venezuelan President Nicolas Maduro to go. \r\n“Spoke with courageous Interim President @Jguaido of Venez… [+291 chars]"}, {"source": {"id": null, "name": "Thediplomat.com"}, "author": "Shannon", "title": "In Taiwan, the Tiananmen Tragedy Has a Special Resonance", "description": "For Taiwan, June 4, 1989 recalls both their own oppressed past and the resistance against China’s ongoing oppression.", "url": "https://thediplomat.com/2019/06/in-taiwan-the-tiananmen-tragedy-has-a-special-resonance/", "urlToImage": "https://thediplomat.com/wp-content/uploads/2019/06/thediplomat-ap_19155486808915-553x360.jpg", "publishedAt": "2019-06-07T18:03:12Z", "content": "Thirty years on, Taiwan continues to commemorate the tragedy of  the 1989 Tiananmen protest. It reminds Taiwans people of the history and the preciousness of democracy, said Taiwans Vice President Chen Chien-jen at the vigil on Tuesday.\r\nAlongside Hong Kong a… [+5144 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": "Sam Greer", "title": "Cyberpunk 2077's in-game context doesn't matter if its marketing contributes to transphobia right now", "description": "During this week’s E3, Cyberpunk 2077 developers CD Projekt Red released a new CG trailer starring Keanu Reeves, showed the game to press behind closed doors, and handed out some new screenshots. Two screens in particular were released via Nvidia to show off …", "url": "https://www.rockpapershotgun.com/2019/06/14/cyberpunk-2077s-in-game-context-doesnt-matter-if-its-marketing-contributes-to-transphobia-right-now/", "urlToImage": "https://assets.rockpapershotgun.com/images/2019/06/Cyberpunk-2077-new-e3-screen-c.jpg", "publishedAt": "2019-06-14T12:00:21Z", "content": "During this week’s E3, Cyberpunk 2077 developers CD Projekt Red released a new CG trailer starring Keanu Reeves, showed the game to press behind closed doors, and handed out some new screenshots. Two screens in particular were released via Nvidia to show off … [+7758 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "AOC calls Alabama’s abortion ban 'a brutal form of oppression'", "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., who has emerged as a leader amongprogressive Democrats, denounced Alabama’s abortion ban after it was signedinto law on Wednesday", "url": "https://news.yahoo.com/aoc-calls-alabama-abortion-ban-153626310.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/IGh_kU.VRoqpUvCUCfoayA--~B/aD0zNDM2O3c9NTE1NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/aol_com_127/528857a883efe9b3c84cfe251bd822ab", "publishedAt": "2019-05-16T15:36:26Z", "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., who has emerged as a leader among progressive Democrats, denounced Alabamas abortion ban after it was signed into law on Wednesday night.\r\nShe was joined by most of the partys presidential candidates.\r\nAbortion bans aren… [+2872 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Mira Adler-Gillies", "title": "How our public toilets shine light on centuries of oppression", "description": "With the quality and quantity of public toilets in decline, it’s time for a reckoning — and that means acknowledging how contemporary design disadvantages some more than others.", "url": "https://www.abc.net.au/news/2019-06-01/decline-in-public-toilet-design-disadvantages-women-elderly/11167952", "urlToImage": "https://www.abc.net.au/news/image/11168472-16x9-700x394.jpg", "publishedAt": "2019-05-31T19:09:10Z", "content": "Posted \r\nJune 01, 2019 05:09:10\r\nIn his 1937 essay What is a City?, historian, sociologist and architecture critic Lewis Mumford described the city as a theatre a space in which the social drama of urban life could play out.\r\nIt's unlikely he envisioned the d… [+6577 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Dave Quinn", "title": "Kylie Jenner Faces Backlash for 'Tone Deaf' Handmaid's Tale-Themed Party", "description": "“Who wants to be the one to explain The Handmaids Tale to Kylie Jenner ?” That’s one of many negative comments the Keeping Up with the Kardashians star received over the weekend, after she decided to host a Handmaid’s Tale -themed bash at her Hidden Hills hom…", "url": "https://people.com/tv/kylie-jenner-handmaids-tale-party-backlash/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/kylie-b.jpg?crop=0px%2C302px%2C901px%2C473px&resize=1200%2C630", "publishedAt": "2019-06-10T13:42:32Z", "content": "“Who wants to be the one to explain The Handmaids Tale to Kylie Jenner?”\r\nThat’s one of many negative comments the Keeping Up with the Kardashians star received over the weekend, after she decided to host a Handmaids Tale-themed bash at her Hidden Hills home … [+3395 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Dave Quinn", "title": "The Handmaid’s Tale Star Bradley Whitford Calls Kylie Jenner’s Gilead-Themed Party ‘Tacky’", "description": "Kylie Jenner ‘s decision to throw a The Handmaid’s Tale -themed bash over the weekend didn’t win her any favor with one of the Hulu show’s stars, Bradley Whitford. The actor, 59, appeared on Tuesday’s episode of CBS’ The Talk, where he added his voice to the …", "url": "https://people.com/tv/bradley-whitford-slams-kylie-jenner-handmaids-tale-party/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/kylie-whitford-1-1200x800.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "publishedAt": "2019-06-12T13:07:19Z", "content": "Kylie Jenner‘s decision to throw a TheHandmaids Tale-themed bash over the weekend didn’t win her any favor with one of the Hulu show’s stars, Bradley Whitford.\r\nThe actor, 59, appeared on Tuesday’s episode of CBS’ The Talk, where he added his voice to the cri… [+3699 chars]"}, {"source": {"id": "national-review", "name": "National Review"}, "author": "Katherine Timpf", "title": "Researchers Claim Dodgeball Teaches Kids ‘Oppression’ — But It’s Really Not That Serious", "description": "There’s a such thing as thinking about something so much that you lose track of how simple it really is.", "url": "https://www.nationalreview.com/2019/06/researchers-claim-dodgeball-teaches-kids-oppression/", "urlToImage": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/06/pro-dodgeball.jpg?fit=1200%2C762&ssl=1", "publishedAt": "2019-06-06T21:24:05Z", "content": "Players at the Epic Pro Dodgeball event at ESPN Wide World of Sports Complex in Kissimmee, Fla., January 23, 2019.(Kirby Lee/USA TODAY Sports)\r\nTheres a such thing as thinking about something so much that you lose track of how simple it really is.Researchers … [+3827 chars]"}, {"source": {"id": null, "name": "Advocate.com"}, "author": "Trudy Ring", "title": "Transgender in the South: New Study Shines Light on Oppression", "description": "The study details many obstacles to equality, but activists hope it leads to mobilization for action.", "url": "https://www.advocate.com/transgender/2019/5/14/transgender-south-new-study-shines-light-oppression", "urlToImage": "https://www.advocate.com/sites/advocate.com/files/2019/05/13/tlc_750x422.jpg", "publishedAt": "2019-05-14T14:00:00Z", "content": "The southern U.S. isnt known as a particularly friendly region for LGBTQ people. And trans people are known to experience more oppression than others in the LGBTQ population. But when you put the South and trans people together, the level of discrimination is… [+5458 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Dave Urbanski", "title": "Dodgeball is tool of 'oppression,' teaches students 'it's okay to hurt or dehumanize' peers, Canadian researchers say", "description": "The classic schoolyard game of dodgeball has been under assault of late. It seems the contest — in which players throw bouncy balls at each other in the hopes of being the last kid (or team) standing — is proving too much for students to handle. What's up? No…", "url": "https://www.theblaze.com/news/dodgeball-tool-of-oppression-researchers-claim", "urlToImage": "https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19593630%2F1200x600.jpg/2000%2C2000/6DBySYYpwjeLDShJ/img.jpg", "publishedAt": "2019-06-12T17:12:07Z", "content": "The classic schoolyard game of dodgeball has been under assault of late.\r\nIt seems the contest in which players throw bouncy balls at each other in the hopes of being the last kid (or team) standing is proving too much for students to handle.\r\nWhat's up?\r\nNow… [+3178 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "Naomi Scott Belts Out a New Song for ‘Aladdin’ in “Speechless” Music Video", "description": "The original Aladdin was made all the way back in 1992. So it only makes sense that the music video for a new original song in the live-action remake of Disney’s animated classic is a throwback to that decade too. Disney has just released the full version of …", "url": "https://www.slashfilm.com/naomi-scott-new-aladdin-song/", "urlToImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/aladdin-speechless-musicvideo.jpg", "publishedAt": "2019-05-23T18:00:21Z", "content": "The original Aladdin was made all the way back in 1992. So it only makes sense that the music video for a new original song in the live-action remake of Disney’s animated classic is a throwback to that decade too.\r\nDisney has just released the full version of… [+2222 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Mairav Zonszein", "title": "Opinion: The American Left Can Learn A Lesson From Israel", "description": "The language used by the Israeli right to dehumanize Palestinians is now used against Jewish leftists. A similar narrative creep is happening in America. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/mairavzonszein/lesson-from-israel-for-american-left", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2019-05/21/15/campaign_images/buzzfeed-prod-web-04/opinion-a-lesson-from-israel-for-the-american-left-2-28816-1558466124-0_dblbig.jpg", "publishedAt": "2019-05-21T19:24:53Z", "content": "Donald Trump says Congresswoman Rashida Tlaib obviously has tremendous hatred of Israel and the Jewish people. An editorial shared with praise by New York Times opinion editor Bari Weiss says the work of American Jewish comic artist Eli Valley represents the … [+5387 chars]"}, {"source": {"id": null, "name": "Cbr.com"}, "author": "Anthony Gramuglia", "title": "Forget Captain America - Chris Evans Is the Social Justice Warrior We Need", "description": "By any definition, Captain America is a literal social justice warrior. He punches Nazis in the face, confronts the government about its legal oppression and goes out of his way to give everyone the same opportunities to succeed. However, Steve Rogers is just…", "url": "https://www.cbr.com/captain-america-chris-evans-social-justice-warrior/", "urlToImage": "https://static1.cbrimages.com/wordpress/wp-content/uploads/2019/04/endgame-poster-cap.jpg", "publishedAt": "2019-06-15T08:06:25Z", "content": "By any definition, Captain America is a literal social justice warrior. He punches Nazis in the face, confronts the government about its legal oppression and goes out of his way to give everyone the same opportunities to succeed. However, Steve Rogers is just… [+6421 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Sarah Hoyt", "title": "ANOTHER DAY IN THE OPPRESSION MINES: Cold office temperatures are hurting women’s productivity, …", "description": "ANOTHER DAY IN THE OPPRESSION MINES: Cold office temperatures are hurting women’s productivity, study says.", "url": "https://pjmedia.com/instapundit/331333/", "urlToImage": null, "publishedAt": "2019-05-24T07:00:21Z", "content": null}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Michael Morpurgo", "title": "By the skin of our teeth freedom was won - this is why we should never forget", "description": "I was about 9 months old on D Day.", "url": "https://www.telegraph.co.uk/news/2019/06/05/skin-teeth-freedom-won-should-never-forget/", "urlToImage": "https://www.telegraph.co.uk/content/dam/PortalPictures/June2019/dday858-xlarge.jpg", "publishedAt": "2019-06-05T11:00:00Z", "content": "I was about 9 months old on D Day. So, like most of us, I remember nothing. I have learnt all I know about the D Day landings in Normandy on June 6th 1944 from stories told in books, in films, in photographs, and from those who were there, or who were alive a… [+1310 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Glenn Reynolds", "title": "WHEN RESEARCHERS ARE STUPID: Dodgeball isn’t just problematic, it’s an unethical tool of ‘oppressio…", "description": "WHEN RESEARCHERS ARE STUPID: Dodgeball isn’t just problematic, it’s an unethical tool of ‘oppression’: researchers.", "url": "https://pjmedia.com/instapundit/332281/", "urlToImage": null, "publishedAt": "2019-06-04T21:00:52Z", "content": null}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Symbol of oppression? Austria bans headscarves in primary schools sparking criticism on social media", "description": "The Austrian parliament has passed a law banning Muslim headscarves in primary schools. The legislation was met with skepticism on social media but drew support from European right-wing populists. Read Full Article at RT.com", "url": "https://www.rt.com/news/459519-austria-primary-school-headscarf-ban/", "urlToImage": "https://cdni.rt.com/files/2019.05/article/5cdda277dda4c804758b4597.JPG", "publishedAt": "2019-05-16T17:49:01Z", "content": "The new ban prohibits primary school children from wearing “ideologically or religiously influenced clothing, which involves covering of the head.” The legislation specifically notes that the ban covers only the garments that “either cover the hair entirely o… [+6363 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Yes, dodgeball is a ‘TOOL OF OPPRESSION’ – but that doesn’t mean we should ban it", "description": "Forbidding a children’s ball game to combat violence and injustice in society makes no sense, as long as young people will ultimately face survival in a real world that is far more violent and unjust. Read Full Article at RT.com", "url": "https://www.rt.com/news/461731-dodgeball-ban-oppression-school/", "urlToImage": "https://cdni.rt.com/files/2019.06/article/5d0112b6dda4c8645a8b4572.jpg", "publishedAt": "2019-06-13T06:36:05Z", "content": "In one of those stories that was bound to birth a slew of political-correctness-gone-mad responses, Canadian scientists have presented as-yet-unpublished research showing that dodgeball is a form of “legalized bullying” that forms a part of the “hidden curric… [+5204 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "ilanamichellekaplan", "title": "Watch Madonna and Quavo Perform ‘Future’ in Controversial Eurovision Set", "description": "Singer also delivered haunting rendition of 1989 hit \"Like A Prayer\"", "url": "https://www.rollingstone.com/music/music-news/madonna-quavo-future-eurovision-controversy-837263/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2019/05/10240701b.jpg", "publishedAt": "2019-05-19T16:24:12Z", "content": "Despite calls for Madonna to boycott Eurovision 2019 because of its location in Tel Aviv, Israel, the singer delivered what has been dubbed a controversial performance at the annual event Saturday. At the beginning of the night, the Madame X singer vaguely ac… [+2077 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": "Ed Driscoll", "title": "DISPATCHES FROM THE EDUCATION APOCALYPSE: Who Knew? Dodgeball a ‘Tool of Oppression,’ Researchers Sa…", "description": "DISPATCHES FROM THE EDUCATION APOCALYPSE: Who Knew? Dodgeball a ‘Tool of Oppression,’ Researchers Say.", "url": "https://pjmedia.com/instapundit/332857/", "urlToImage": null, "publishedAt": "2019-06-09T14:59:20Z", "content": "DISPATCHES FROM THE EDUCATION APOCALYPSE: Who Knew? Dodgeball a ‘Tool of Oppression,’ Researchers Say.\r\nPosted by Ed Driscoll at 10:59 am"}, {"source": {"id": null, "name": "Brainpickings.org"}, "author": "Maria Popova", "title": "Planting Trees as Resistance and Empowerment: The Remarkable Illustrated Story of Wangari Maathai, the First African Woman to Win the Nobel Peace Prize", "description": "\"A tree is a little bit of the future.\"", "url": "https://www.brainpickings.org/2019/06/04/wangari-maathai-the-woman-who-planted-millions-of-trees/", "urlToImage": "https://i1.wp.com/www.brainpickings.org/wp-content/uploads/2019/06/wangarimaathai0.jpg?fit=600%2C315&ssl=1", "publishedAt": "2019-06-04T21:28:07Z", "content": "Walt Whitman saw in trees the wisest of teachers and Hermann Hesse found in them a joyous antidote to the sorrow of our own ephemerality. The tree which moves some to tears of joy is in the eyes of others only a green thing which stands in the way,” William B… [+7595 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Gabriela Tully Claymore", "title": "Watch Madonna’s Controversial Eurovision Performance", "description": "Madonna performed at Eurovision 2019 in Tel Aviv, Israel tonight. Her decision to appear at the song contest incited controversy earlier this week since Palestinians and the international boycott, divestment, and sanctions movement have called on viewers to b…", "url": "https://www.stereogum.com/2044264/madonna-eurovision/video/", "urlToImage": "https://static.stereogum.com/uploads/2019/05/Screen-Shot-2019-05-18-at-6.31.47-PM-1558218783-608x330.png", "publishedAt": "2019-05-18T22:48:33Z", "content": "Madonna performed at Eurovision 2019 in Tel Aviv, Israel tonight. Her decision to appear at the song contest incited controversy earlier this week since Palestinians and the international boycott, divestment, and sanctions movement have called on viewers to b… [+2255 chars]"}, {"source": {"id": null, "name": "Infowars.com"}, "author": "Ben Warren", "title": "US Women’s National Team Record Breaking Win Has Media Crying “Female Oppression”", "description": "Media covers for anti-American protest", "url": "https://www.infowars.com/us-womens-national-team-record-breaking-win-has-media-crying-female-oppression/", "urlToImage": "https://assets.infowars.com/2019/06/kaitOwen61319.jpg", "publishedAt": "2019-06-13T16:53:15Z", "content": "After members of the U.S. National Soccer Team publicly protested the national anthem, the media is blaming the public’s backlash on…sexism?\r\nDon’t miss:\r\nBullying And Harassing Infowars Reporters Goes Ignored\r\nThe double standard of the outrage culture from … [+104 chars]"}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Warner Todd Huston, Warner Todd Huston", "title": "Researchers: Dodgeball Is an 'Unethical Tool of Oppression'", "description": "A group of Canadian education experts, is prepared to present research showing that dodgeball should be banned from schools because it is \"oppressive\" and \"miseducative.\"", "url": "https://www.breitbart.com/sports/2019/06/04/researchers-dodgeball-is-unethical-tool-of-oppression/", "urlToImage": "https://media.breitbart.com/media/2019/06/ap-mary-altaffer-640x335.jpg", "publishedAt": "2019-06-04T16:42:25Z", "content": "The three education theorists are set to deliver the results of their research at the Canadian Society for the Study of Education at the Congress of the Humanities and Social Sciences in Vancouver, Canada.\r\nThe researchers claim that “dodgeball isnt just an u… [+1719 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/washington-examiner", "title": "The lies behind the defense of abortion - Washington Examiner", "description": "The lies behind the defense of abortion Washington Examiner AOC fetal heartbeat bill: Alexandria Ocasio-Cortez says on Twitter abortion bans are a \"brutal form of oppression\" and are \"about controlling women's sexuality\" after Alabama, Ohio pass laws CBS News…", "url": "https://www.washingtonexaminer.com/opinion/editorials/the-lies-behind-the-defense-of-abortion", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/13a2205/2147483647/strip/true/crop/1500x788+0+106/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F51%2F8f%2Fe15d84c33e682966b5654e58a03a%2Fa0ba6c1f8fb2ce33d3d9418693b6c79f.jpg", "publishedAt": "2019-05-16T18:50:00Z", "content": "As Alabama and Georgia passed laws restricting or nearly banning abortion, the attacks poured in from every angle. As varied as these attacks were, there was a common theme: dishonesty and falsehood.\r\nRep. Alexandria Ocasio-Cortez, for instance, wrote on Twit… [+3512 chars]"}, {"source": {"id": null, "name": "Designtaxi.com"}, "author": null, "title": "Kylie Jenner’s ‘Handmaid’s Tale’-Themed Party Faces Outcry For Being Insensitive", "description": "Left image via Tinseltown / Shutterstock.com, right image via KriszElekPhotography / Shutterstock.com Kylie Jenner threw a Handmaid’s Tale-themed party, but it has not garnered the same acclaim as Hulu’s popular dystopian series. The reality star celebrated h…", "url": "https://designtaxi.com/news/405028/Kylie-Jenner-s-Handmaid-s-Tale-Themed-Party-Faces-Outcry-For-Being-Insensitive/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+designtaxi_news+%28TAXI+Daily+News%29", "urlToImage": "https://editorial.designtaxi.com/editorial-images/news-kylie11062019/1.jpg", "publishedAt": "2019-06-11T10:38:50Z", "content": "Left image via Tinseltown / Shutterstock.com, right image via KriszElekPhotography / Shutterstock.comKylie Jenner threw a Handmaid’s Tale-themed party, but it has not garnered the same acclaim as Hulu’s popular dystopian series.\r\nThe reality star celebrated h… [+2848 chars]"}, {"source": {"id": null, "name": "Thegospelcoalition.org"}, "author": "Neil Shenvi, Pat Sawyer", "title": "The Incompatibility of Critical Theory and Christianity", "description": "Neil Shenvi and Pat Sawyer help Christians understand some basic information about critical theory and how to engage it from a Christian perspective.", "url": "https://www.thegospelcoalition.org/article/incompatibility-critical-theory-christianity/", "urlToImage": "https://media.thegospelcoalition.org/wp-content/uploads/2019/05/14152942/critical-theory.jpg", "publishedAt": "2019-05-15T04:03:00Z", "content": "Over the last few years, new terms like “cisgender,” “intersectionality,” “heteronormativity,” “centering,” and “white fragility” have suddenly entered our cultural lexiconseemingly out of nowhere. In reality, these words and concepts have been working their … [+8946 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Annie Sutherland", "title": "“The Handmaid’s Tale” costume is now the ultimate symbol of women’s rights", "description": "The modesty costumes in \"The Handmaid's Tale\" were meant to indicate subservience, but they have been redeployed by real-life activists to represent the opposite.", "url": "https://qz.com/quartzy/1643273/the-handmaids-tale-costume-has-become-the-symbol-of-womens-rights/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/06/RTS1SXA3-e1560439047602.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-06-13T15:38:14Z", "content": "The ongoing TV adaptation of The Handmaids Tale has done much to remind us of the astonishing pertinence of Margaret Atwoods novelwhich was first published in 1985 and is soon to be followed by a sequel: The Testaments. In particular, it has brought the costu… [+5506 chars]"}, {"source": {"id": null, "name": "Mcsweeneys.net"}, "author": "Mara Y. McPartland", "title": "Why My Skin-Care Routine Makes Me a Radical Activist", "description": "I, a twenty-nine-year-old white woman, am firmly convinced that my obsession with skin care constitutes radical political activism. Everyone knows that self-care is a crucial part of being an activist. As Audre Lorde writes in A Burst of Light caring for myse…", "url": "https://www.mcsweeneys.net/articles/why-my-skin-care-routine-makes-me-a-radical-activist", "urlToImage": "http://d3thpuk46eyjbu.cloudfront.net/uploads/production/12722/1559581834/original/Screen_Shot_2019-06-03_at_1.09.37_PM.png", "publishedAt": "2019-06-05T12:00:00Z", "content": "I, a twenty-nine-year-old white woman, am firmly convinced that my obsession with skin care constitutes radical political activism.\r\nEveryone knows that self-care is a crucial part of being an activist. As Audre Lorde writes in A Burst of Light caring for mys… [+2201 chars]"}, {"source": {"id": "the-economist", "name": "The Economist"}, "author": null, "title": "The life and loves of Alma Mahler", "description": "Was she a capricious muse—or victim of chauvinist oppression?", "url": "https://www.economist.com/books-and-arts/2019/06/15/the-life-and-loves-of-alma-mahler", "urlToImage": "https://www.economist.com/sites/default/files/images/2019/06/articles/main/20190615_bkp505.jpg", "publishedAt": "2019-06-13T14:43:31Z", "content": "Passionate Spirit: The Life of Alma Mahler. By Cate Haste.Bloomsbury; 486 pages; £26. To be published in America by Basic Books in September; $32.\r\nALMA MAHLER was the supreme femme fatale of early-20th-century Vienna. From composers to priests, artists to ar… [+3001 chars]"}, {"source": {"id": null, "name": "Wndu.com"}, "author": "Associated Press", "title": "22 caught in Michigan sting targeting child sex solicitation - WNDU-TV", "description": "22 caught in Michigan sting targeting child sex solicitation WNDU-TV News Senior Comerica Bank executive among 22 arrested in alleged child sex sting 8:03 AM WXYZ Detroit 22 suspects in Michigan child sex sting include bank executive, senate candidate Detroit…", "url": "https://www.wndu.com/content/news/22-caught-in-Michigan-sting-targeting-child-sex-solicitation-511071201.html", "urlToImage": "https://media.graytvinc.com/images/genesee+co+arrests.jpg", "publishedAt": "2019-06-10T14:42:14Z", "content": "FLINT, Mich. (AP) - Authorities in Michigan say they've arrested 22 people as part of a child sex sting operation targeting people who were allegedly soliciting sex with children.\r\nGenesee County Sheriff Robert Pickell announced the arrests Sunday and says th… [+740 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Researchers Claim Dodgeball Teaches Kids ‘Oppression’ — But It’s Really Not That Serious", "description": "Researchers are arguing that dodgeball is not just a harmless children’s game, but actually a sinister activity that teaches them “oppression.”According to an article in the National Post, three “education theorists” will give a presentation at the upcoming C…", "url": "https://news.yahoo.com/researchers-claim-dodgeball-teaches-kids-212405856.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Q6FU3q6Z0JAo59MrVyaRLg--~B/aD02NTE7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/9f98130facee3b2469c9ea4e29f28711", "publishedAt": "2019-06-06T21:24:05Z", "content": "Researchers are arguing that dodgeball is not just a harmless childrens game, but actually a sinister activity that teaches them oppression.\r\nAccording to an article in the National Post, three education theorists will give a presentation at the upcoming Cana… [+3601 chars]"}, {"source": {"id": null, "name": "Wxyz.com"}, "author": null, "title": "News Senior Comerica Bank executive among 22 arrested in alleged child sex sting 8:03 AM - WXYZ Detroit", "description": "News Senior Comerica Bank executive among 22 arrested in alleged child sex sting 8:03 AM WXYZ Detroit 22 suspects in Michigan child sex sting include bank executive, senate candidate Detroit Free Press Sheriff: 22 accused of sex crimes with children in Genese…", "url": "https://www.wxyz.com/news/senior-comerica-bank-executive-among-22-arrested-in-alleged-child-sex-sting", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/df2eaf2/2147483647/strip/true/crop/960x504+0+103/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F08%2Fa2%2F112da02648ddb1ad9efd808d6b57%2Fhuman-trafficking.png", "publishedAt": "2019-06-10T12:03:00Z", "content": "(WXYZ) Twenty-two people have been arrested for human trafficking crimes, according to the Genesee County Sheriff's Office.\r\nThe Genesee Human Oppression Strike Team arrested the individuals for crimes related to soliciting sex with underage children. They we… [+565 chars]"}, {"source": {"id": null, "name": "Dailycaller.com"}, "author": "Rachel Stoltzfoos", "title": "Dodgeball Is A Tool Of Oppression, Researchers Say", "description": "A team of Canadian researchers are set to lecture teachers about the moral dangers of dodgeball, a sport they say teaches kids to violently dominate others.", "url": "https://dailycaller.com/2019/06/03/dodgeball-oppression-canadian-researchers/", "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2019/06/GettyImages-51078471-e1559597664996.jpg", "publishedAt": "2019-06-03T21:42:10Z", "content": "A team of Canadian researchers are set to lecture teachers about the moral dangers of dodgeball, a sport they say teaches kids to single out and violently dominate weaker students.\r\nDodgeball is a tool of “oppression” and “miseducative,” the researchers say i… [+2351 chars]"}, {"source": {"id": null, "name": "Hotair.com"}, "author": "Ed Morrissey", "title": "Ocasio-Cortez: Abortion threatens the “patriarchy” and therefore bans are “brutal form of oppression”", "description": "Missouri tees up another challenge. The post Ocasio-Cortez: Abortion threatens the “patriarchy” and therefore bans are “brutal form of oppression” appeared first on Hot Air.", "url": "https://hotair.com/archives/2019/05/16/ocasio-cortez-abortion-threatens-patriarchy-therefore-bans-brutal-form-oppression/", "urlToImage": "https://hotair.com/wp/wp-content/uploads/2019/03/AOC-grimace.jpg", "publishedAt": "2019-05-16T21:21:47Z", "content": "Banning abortion is “brutal”? What about abortion itself? Alexandria Ocasio-Cortez argued early this morning that it’s an act of liberation against the “patriarchy” that underpins “right-wing ideology.”\r\nOr it could be that it brutally ends defenseless human … [+5704 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Palestinian campaigners call for mass boycott of Airbnb on May 15", "description": "The company continues to list rentals in illegal Israeli settlements in the occupied West Bank and East Jerusalem.", "url": "https://www.aljazeera.com/news/2019/05/palestinian-campaigners-call-mass-boycott-airbnb-15-190514150835132.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/14/a813dd48e61149e68676a78b9a40a776_18.jpg", "publishedAt": "2019-05-14T17:08:23Z", "content": "A Palestinian campaign has called on people to deactivate their Airbnb accounts on May 15, because the home-sharing platform continues to list rental properties in illegal Israeli settlements in the occupied West Bank.\r\nThe global coalition behind the #deacti… [+2304 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Venezuelan government, opposition envoys end talks without a deal", "description": "Guaido vows to continue protests as talks end in Norway without progress towards resolving Venezuela's political crisis.", "url": "https://www.aljazeera.com/news/2019/05/venezuelan-government-opposition-envoys-talks-deal-190530160246998.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/3/4/706e2090ed404b4ebdf6b6c11c109f8a_18.jpg", "publishedAt": "2019-05-30T16:38:45Z", "content": "A meeting between Venezuela's government and opposition ended has without agreement as Norway holds talks aimed at resolving the South American country's long-running conflict, opposition leader Juan Guaido's office said late on Wednesday.\r\nDuring the meeting… [+2448 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Vietnam: Facebook user gets six-year jail for 'anti-state' posts", "description": "Dissident activist Nguyen Ngoc Anh is sentenced to six years in prison for online posts as the EU calls for his release.", "url": "https://www.aljazeera.com/news/2019/06/vietnam-facebook-user-year-jail-anti-state-posts-190606173722334.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/6/6/69ebaf2f659d4484a91be53d28853eee_18.jpg", "publishedAt": "2019-06-06T19:18:14Z", "content": "An environmental activist in Vietnam has been sentenced to six years in prison for \"anti-state\" posts on Facebook, forcing the European Union to call the crackdown on online dissent a \"worrying development\".\r\nA southern provincial court on Thursday sentenced … [+2362 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Mike Ciandella", "title": "AOC claims pro-life legislation is a 'brutal form of oppression' pushed by men who fear a threat to the 'patriarchy'", "description": "Rep. Alexandria Ocasio-Cortez (D-N.Y.) declared this week that the pro-life movement is concerned only with \"owning women\" and that conservatives opposed abortion because \"it threatens a core element underpinning right-wing ideology: patriarchy.\" What did she…", "url": "https://www.theblaze.com/news/aoc-pro-life-legislation-brutal-form-of-oppression", "urlToImage": "https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19532811%2F1200x600.jpg/2000%2C2000/DUfD9IOfLUFucVo6/img.jpg", "publishedAt": "2019-05-17T13:55:33Z", "content": "Rep. Alexandria Ocasio-Cortez (D-N.Y.) declared this week that the pro-life movement is concerned only with \"owning women\" and that conservatives opposed abortion because \"it threatens a core element underpinning right-wing ideology: patriarchy.\"\r\nWhat did sh… [+1789 chars]"}, {"source": {"id": null, "name": "Goodmenproject.com"}, "author": "Warren Blumenfeld", "title": "Mike and Kathy Pence are Not Victims but are Perpetrators of Intolerance", "description": "We are all born into an environment polluted by heterosexism and cissexism (two among many forms of oppression), which fall upon us like acid rain. The post Mike and Kathy Pence are Not Victims but are Perpetrators of Intolerance appeared first on The Good Me…", "url": "https://goodmenproject.com/featured-content/mike-and-kathy-pence-are-not-victims-but-are-perpetrators-of-intolerance/", "urlToImage": "https://goodmenproject.com/wp-content/uploads/2019/05/iStock-981642878.jpg", "publishedAt": "2019-05-15T11:30:23Z", "content": "Mike Pence kvetched to the graduating class at Liberty University that the most marginalized group in the U.S. are Christians:\r\nSome of the loudest voices for tolerance today have little tolerance for traditional Christian beliefs, he said. Pence warned gradu… [+11779 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Anuk Arudpragasam", "title": "A State of Disorientation: Dispatch from Sri Lanka after the Easter Bombings", "description": "In Colombo, as though there is war once more, the ominous presence of heavily armed soldiers is everywhere. Ever since the Easter Sunday bombings, checkpoints have been posted on all the main roads, as well as outside churches and mosques. There are rumors ev…", "url": "http://time.com/5593101/dispatch-sri-lanka-easter-bombings/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/04/gettyimages-1138722810.jpg?quality=85", "publishedAt": "2019-05-22T10:00:10Z", "content": "In Colombo, as though there is war once more, the ominous presence of heavily armed soldiers is everywhere. Ever since the Easter Sunday bombings, checkpoints have been posted on all the main roads, as well as outside churches and mosques. There are rumors ev… [+8858 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Darcy Lockman", "title": "Too Often, Working Mothers Do More Than Their Share of Childcare. Here’s How to Help Fix It", "description": "Too often, working women do far more of the childcare—while thinking it's fair. Darcy Lockman writes it's time they use a word with a bad reputation: entitled", "url": "http://time.com/5589770/parenting-working-women-domestic-balance/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/equal-partnership-darcy-lockman.jpg?quality=85", "publishedAt": "2019-05-16T18:30:01Z", "content": "When my husband and I became parents a decade ago, it was with a vague understanding that the workload created by our children would be shared between us. Quite soon after our first daughter was born, though, I found myself in charge of the details of managin… [+9568 chars]"}]}