{"status": "ok", "totalResults": 505, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Brian Kahn on Earther, shared by Maddie Stone to Gizmodo", "title": "Should We Be Calling Climate Change a 'Climate Crisis'?", "description": "How we talk about climate change is rapidly shifting as the ramifications of unchecked carbon pollution become ever clearer. The Guardian sped that shift along last week, when it updated its style guide to encourage reporters to refer to climate change as a “…", "url": "https://earther.gizmodo.com/should-we-be-calling-climate-change-a-climate-crisis-1834924490", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--8vXEQHkp--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/occ0zo3nnmndbhbpahdr.jpg", "publishedAt": "2019-05-21T20:31:00Z", "content": "How we talk about climate change is rapidly shifting as the ramifications of unchecked carbon pollution become ever clearer. The Guardian sped that shift along last week, when it updated its style guide to encourage reporters to refer to climate change as a c… [+5301 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Tom Hals", "title": "Trump's Mexican tariffs test limits of U.S. emergency powers: legal experts", "description": "U.S. President Donald Trump's proposal to impose a tariff on all Mexican goods to push Mexico to halt a surge in illegal immigrants is likely to be challenged in court and will test the scope of the president's emergency powers.", "url": "https://www.reuters.com/article/us-usa-trade-mexico-legal-analysis-idUSKCN1T12AB", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190601&t=2&i=1393056984&w=1200&r=LYNXNPEF4U20D", "publishedAt": "2019-06-01T00:31:18Z", "content": "(Reuters) - U.S. President Donald Trump’s proposal to impose a tariff on all Mexican goods to push Mexico to halt a surge in illegal immigrants is likely to be challenged in court and will test the scope of the president’s emergency powers. \r\nTrump dramatical… [+5057 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Patrick Allan", "title": "Six Airplane Facts to Cure Your Fear of Flying", "description": "For some people, air travel is just another part of everyday life. But for others, it’s a major source of stress and anxiety. The good news is that most fears boil down to a lack of understanding, and in those situations knowledge really is power. If the thou…", "url": "https://lifehacker.com/six-airplane-facts-to-cure-your-fear-of-flying-1788654431", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--00Jyn2Ph--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/l93n9iu0wloagylrvnjx.jpg", "publishedAt": "2019-06-06T21:05:00Z", "content": "For some people, air travel is just another part of everyday life. But for others, its a major source of stress and anxiety. The good news is that most fears boil down to a lack of understanding, and in those situations knowledge really is power. If the thoug… [+10310 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sinéad Baker", "title": "After the first fatal 737 Max crash, Boeing said it hadn't installed an extra safety feature because it might 'confuse' pilots", "description": "Boeing told pilots after its first fatal 737 Max crash that it had sold a safety feature as an optional extra in the planes because many airlines felt it would \"confuse\" pilots. A Boeing executive told members of the pilots union for American Airlines that mo…", "url": "https://www.businessinsider.com/boeing-audio-737-max-safety-feature-optional-might-confuse-pilots-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cdd5d5f021b4c00c3083217-2732-1366.jpg", "publishedAt": "2019-05-22T09:36:29Z", "content": "After the first fatal crash of its one of its 737 Max planes, a Boeing executive told concerned pilots that one of its safety features came only as a paid-for extra because airlines worried that it would \"confuse\" pilots. \r\n An audio recording of a November 2… [+7527 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Daniel Bader", "title": "The Ring Floodlight Cam helped me catch the guy who kept peeing on my car", "description": "A steady stream of frustration. Alleyways are attractive for people peeing in corners, and the alleyway behind my house where I park my car is a perfect place (apparently) for someone to do just that. But about a year ago, during the waning months of summer, …", "url": "https://www.androidcentral.com/ring-floodlight-cam-review-year-later", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/ring-floodlight-cam-bader-2.jpg?itok=Uh-C848S", "publishedAt": "2019-05-17T12:30:03Z", "content": "Alleyways are attractive for people peeing in corners, and the alleyway behind my house where I park my car is a perfect place (apparently) for someone to do just that. But about a year ago, during the waning months of summer, I went downstairs to get in my c… [+6843 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Zoë LaRock", "title": "Comcast is breaking into the health monitoring device market (CMCSA)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Research subscribers. To receive the full story plus other insights each morning, click here. Cable titan Comcast is digging into the home healthcare market …", "url": "https://www.businessinsider.com/comcast-developed-health-monitoring-device-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5b87f3262be4ab1d2f8b51b4-2732-1366.jpg", "publishedAt": "2019-05-23T14:02:00Z", "content": "Cable titan Comcast is digging into the home healthcare market with a new health-monitoring device geared toward senior consumers, according to CNBC. After keeping its development under wraps for over a year, it's launching into a pilot phase this year and co… [+4037 chars]"}, {"source": {"id": null, "name": "Readwrite.com"}, "author": "Deanna Ritchie", "title": "igloohome Smart Padlock: Easy to Set-Up, Hard to Crack", "description": "There are a plethora of smart locks out there for doors. However, there are often specific items that might need more secure measures like a padlock. Currently, there are smart padlocks like the one from igloohome — a smart lock manufacturer with a portfolio …", "url": "https://readwrite.com/2019/06/13/igloohome-smart-padlock-easy-to-set-up-hard-to-crack/", "urlToImage": "https://images.readwrite.com/wp-content/uploads/2019/05/Padlock-Easy-to-Set-Up-Hard-to-Crack.jpg", "publishedAt": "2019-06-13T14:00:37Z", "content": "There are a plethora of smart locks out there for doors. However, there are often specific items that might need more secure measures like a padlock. Currently, there are smart padlocks like the one from igloohome — a smart lock manufacturer with a portfolio … [+4522 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Eric Westervelt", "title": "After Paradise, Living With Fire Means Redefining Resilience", "description": "Across the West, hundreds of communities are vulnerable to wildfires. But wildfire and recovery experts warn that the impulse to re-create what was there before disaster is misguided and dangerous.", "url": "https://www.npr.org/2019/05/29/724407043/after-paradise-living-with-fire-means-redefining-resilience", "urlToImage": "https://media.npr.org/assets/img/2019/05/28/paradise-resilience-b-1_wide-4c8c423eaa569841705ac70e35466e230ffa1ce7.jpg?s=1400", "publishedAt": "2019-05-29T09:00:16Z", "content": "Paradise Recreation and Parks Director Dan Efseaff walks toward the Little Feather River Canyon in Butte County, Calif. Efseaff wants to try a radical idea in Paradise: Pay people not to rebuild in this slice of canyon, to create a safety buffer to prevent fu… [+19195 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "'Five star' hospitals often provide fewer services than other hospitals, new data suggests", "description": "If you're looking for a top-notch hospital with a wide range of services, narrowing your list to hospitals with a five-star patient experience rating might lead you astray. Many five-star hospitals offer fewer services than those without five stars, according…", "url": "https://www.sciencedaily.com/releases/2019/06/190612141342.htm", "urlToImage": null, "publishedAt": "2019-06-12T18:13:42Z", "content": "If you're looking for a top-notch hospital with a wide range of services, narrowing your list to hospitals with a five-star patient experience rating might lead you astray. Many five-star hospitals offer fewer services than those without five stars, according… [+4121 chars]"}, {"source": {"id": null, "name": "Darkreading.com"}, "author": "Edy Almer VP Product, Cyberbit", "title": "Killer SecOps Skills: Soft Is the New Hard", "description": "The sooner we give mindsets and tool sets equal bearing, the better. We must put SOC team members through rigorous training for emergency situations.", "url": "https://www.darkreading.com/careers-and-people/killer-secops-skills-soft-is-the-new-hard/a/d-id/1334661", "urlToImage": "https://twimgs.com/nojitter/darkreading/dr-logo.jpg", "publishedAt": "2019-05-20T14:30:00Z", "content": "The sooner we give mindsets and tool sets equal bearing, the better. We must put SOC team members through rigorous training for emergency situations. I spend a lot of time with security operations center (SOC) and incident response teams — functions that have… [+5318 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "As cyclone Vayu nears, 10 columns of Army deployed in Gujarat", "description": "The columns have asked to be placed at all district headquarters of Jamnagar, Gir Somnath, Devbhoomi Dwarka, Junagadh, Porbandar, Morbi, Bhavnagar, Amerli and Rajkot by 12 pm on Thursday.", "url": "https://indianexpress.com/article/cities/ahmedabad/cyclone-vayu-gujarat-army-iaf-5776180/", "urlToImage": "https://images.indianexpress.com/2019/06/vayu.jpg?w=759", "publishedAt": "2019-06-12T00:11:23Z", "content": "A Meteorological Department scientist monitors Cyclone Vayu from his office in Ahmedabad. (Reuters)\r\nWith Cyclonic storm “Vayu” expected to hit Gujarat, the Army has deployed 10 columns in the coastal areas of the state on Wednesday night. The Indian Air Forc… [+2122 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sinéad Baker", "title": "Boeing’s response to the 737 Max crisis confused and frightened people, making it hard to believe its apologies, experts say", "description": "Boeing's response to the two fatal crashes of its 737 Max planes was marked by delayed apologies and confusing messages, according to experts, analysts, and lawyers who talked to Business Insider. This likely deepened mistrust in Boeing rather than winning it…", "url": "https://www.businessinsider.com/boeing-737-max-crisis-response-confusing-hard-to-trust-experts-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cdc033a021b4c652853842d-1136-568.jpg", "publishedAt": "2019-05-19T10:30:00Z", "content": "Boeing's attempts to manage the crisis caused by two fatal crashes of its 737 Max planes left people confused, anxious and sceptical of its apologies instead of restoring trust in the company, numerous experts told Business Insider. \r\n The world's biggest air… [+12283 chars]"}, {"source": {"id": null, "name": "Atlasobscura.com"}, "author": "Allan Richarz", "title": "Every Day at 5:00, Japan Tests Its Disaster Warning System With Folk Tunes", "description": "While it is a modern and safe country by most objective measures, Japan nonetheless faces the persistent threat of natural disaster. The nation is entirely located in the seismically active Ring of Fire, making earthquakes an obvious hazard, in addition to th…", "url": "https://www.atlasobscura.com/articles/japan-5-pm-chime", "urlToImage": "https://assets.atlasobscura.com/media/W1siZiIsInVwbG9hZHMvYXNzZXRzLzk0NGY0ZjA0ZmZhNmVmNTZmMV9ib3NhaS1tdXNlbi1hcnQuanBnIl0sWyJwIiwiY29udmVydCIsIiJdLFsicCIsImNvbnZlcnQiLCItcXVhbGl0eSA4MSAtYXV0by1vcmllbnQiXSxbInAiLCJ0aHVtYiIsIjYwMHg-Il1d/bosai-musen-art.jpg", "publishedAt": "2019-06-13T12:00:00Z", "content": "The “5 pm chime” can include music, civic announcements, and more.\r\nWhile it is a modern and safe country by most objective measures, Japan nonetheless faces the persistent threat of natural disaster. The nation is entirely located in the seismically active R… [+5220 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "India to evacuate 300,000 from cyclone", "description": "Almost 300,000 people are set to be evacuated in the western Indian state of Gujarat out of the path of a severe cyclonic storm due in two days, authorities said Tuesday.", "url": "https://phys.org/news/2019-06-india-evacuate-cyclone.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/membersofind.jpg", "publishedAt": "2019-06-11T17:20:01Z", "content": "Almost 300,000 people are set to be evacuated in the western Indian state of Gujarat out of the path of a severe cyclonic storm due in two days, authorities said Tuesday.\r\n\"The weather department's latest bulletin forecasts that cyclone Vayu will make landfal… [+1888 chars]"}, {"source": {"id": null, "name": "Eff.org"}, "author": "Ernesto Falcon", "title": "AT&T Sues California to Prevent Government Oversight Over Next Generation 911 Calls", "description": "The California legislature in 2011 passed a law to remove state and local authority over the broadband access market to “ensure a vibrant and competitive open Internet that allows California's technology businesses to continue to flourish and contribute to ec…", "url": "https://www.eff.org/deeplinks/2019/05/att-sues-california-prevent-government-oversight-over-future-911-calls-using-state", "urlToImage": "https://www.eff.org/files/eff-og.png", "publishedAt": "2019-05-30T23:08:11Z", "content": "The California legislature in 2011 passed a law to remove state and local authority over the broadband access market to ensure a vibrant and competitive open Internet that allows California's technology businesses to continue to flourish and contribute to eco… [+5136 chars]"}, {"source": {"id": null, "name": "Justsecurity.org"}, "author": "Andrew Boyle", "title": "An Emergency or Business as Usual? Huawei and Trump's Emergency Powers - Just Security", "description": "An Emergency or Business as Usual? Huawei and Trump's Emergency Powers Just Security Should the emergency declaration be used purely as leverage in a trade war, it would clearly be an abuse of the intent of emergency powers.", "url": "https://www.justsecurity.org/64252/an-emergency-or-business-as-usual-huawei-and-trumps-emergency-powers/", "urlToImage": "https://i2.wp.com/www.justsecurity.org/wp-content/uploads/2019/05/GettyImages-1145577146-1.jpg?fit=590%2C393&ssl=1", "publishedAt": "2019-05-24T13:20:01Z", "content": "Last week, President Donald Trump declared another national emergencythe fifth of his presidencybumping up the number of currently active emergencies in the United States to 33, for those keeping track at home. This time, it was over threats to U.S. technolog… [+9378 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "Governors Ball Releases Official Statement on Day Three Evacuation Controversy", "description": "Over the weekend, Governors Ball ran into controversy with the 2019 iteration of the popular festival series. On day three of the world-renowned music showcase, organizers decided to force an evacuation of the premises following issues with the severe weather…", "url": "https://hypebeast.com/2019/6/governors-ball-2019-day-3-evacuation-controversy-statement-response", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F06%2Fgovernors-ball-2019-day-3-evacuation-controversy-statement-response-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2019-06-05T03:28:52Z", "content": "Over the weekend, Governors Ball ran into controversy with the 2019 iteration of the popular festival series. On day three of the world-renowned music showcase, organizers decided to force an evacuation of the premises following issues with the severe weather… [+5682 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Richard Maxwell, Ph.D. and Toby Miller, Ph.D.", "title": "Confused Customers and Bad Weather Ahead", "description": "Did you know that we're in a \"race to 5G\" mobile communication? Behind exaggerated claims and confusing advertising, the actual plans for the \"race to 5G\" have alarmed scientists.", "url": "https://www.psychologytoday.com/ca/blog/greening-the-media/201906/confused-customers-and-bad-weather-ahead", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-06/shutterstock_230084251.jpg?itok=VzGE4ZUE", "publishedAt": "2019-06-05T14:39:50Z", "content": "As consumers, we are used to problematic claims by mobile phone companies, even if we are uncertain how to deal with them. These confusions have ranged over the years from poor coverage across the country to poor coverage within our homes to inconsistent conn… [+7202 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Thomas Claburn", "title": "Salesforce's Freaky Friday turns into Misery Monday: DB blunder outage enters day three", "description": "El Reg tunes into customer conference calls to hear SVP of engineering apologize Three days on, Salesforce.com has yet to fully recover from an outage that began on Friday.… <!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' -->", "url": "https://www.theregister.co.uk/2019/05/20/salesforce_fix_not_functional/", "urlToImage": "https://regmedia.co.uk/2018/04/24/shutterstock_data_center_disaster.jpg", "publishedAt": "2019-05-20T19:25:07Z", "content": "Three days on, Salesforce.com has yet to fully recover from an outage that began on Friday.\r\nFifteen hours and eight minutes after an errant database deployment script granted past and current users of the company's Pardot B2B marketing automation system full… [+4012 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Claire Zulkey", "title": "Why Long Hours and an Obsession With Efficiency Might Be Hurting Your Business", "description": "What if working long hours, living on Slack, and growing as fast as possible isn't the best way to run a business? The founders of Basecamp are pretty sure they have the answer.", "url": "https://www.entrepreneur.com/article/333372", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190506211058-GettyImages-183422242-crop.jpeg", "publishedAt": "2019-06-05T13:00:00Z", "content": "This story appears in the \r\nJune 2019 \r\nissue of\r\nEntrepreneur. Subscribe »\r\nOn March 7 at 4:30 a.m. Greenwich mean time, a tech company’s worst nightmare began. For eight and a half hours, a catastrophic network failure disabled Basecamp’s popular project ma… [+12624 chars]"}, {"source": {"id": null, "name": "Pib.nic.in"}, "author": null, "title": "POWERGRID, a PSU under the Ministry of Power helps in restoration of power in Fani affected areas", "description": "Power Grid Corporation of India Ltd. (POWERGRID), a Navratna Central Public Sector Enterprise under the Ministry of Power, Government of India is playing a major role in quick restoration of power supply in the state of Odisha.", "url": "http://pib.nic.in/newsite/PrintRelease.aspx?relid=190003", "urlToImage": null, "publishedAt": "2019-05-14T12:44:00Z", "content": "Power Grid Corporation of India Ltd. (POWERGRID), a Navratna Central Public Sector Enterprise under the Ministry of Power, Government of India is playing a major role in quick restoration of power supply in the state of Odisha. Power supply in the State was b… [+2297 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Isabella Cota", "title": "How women in Mexico used a whistle to catch a serial rapist", "description": "They caught their rapist in 2016. Now, Guardia Ciudadana continue to protect, develop their northeast Mexico community.", "url": "https://www.aljazeera.com/indepth/features/women-mexico-whistle-catch-serial-rapist-190514144709704.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/3/27/6c246e1edccc46a0b896932117e3a1b4_18.jpg", "publishedAt": "2019-05-15T11:29:48Z", "content": "Monterrey, Mexico - One whistle means an outsider has been spotted; two means be on the lookout for suspicious activity; and three, danger, get the equipment and join the group in the nearby meeting point.\r\nOn the night a man, who has confessed to 10 rapes an… [+5726 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Stratics Networks Announces Free Disaster Communication Program", "description": "HUNTSVILLE, Ala.--(BUSINESS WIRE)-- #DisasterResponse --Stratics Networks, a leading provider of cloud communications and the inventors of Ringless Voicemail and IVR Polling, today announced the introduction of their Disaster Communication Program. This progr…", "url": "https://www.businesswire.com/news/home/20190607005490/en/Stratics-Networks-Announces-Free-Disaster-Communication-Program", "urlToImage": "http://www.businesswire.com/images/bwlogo_square.png", "publishedAt": "2019-06-07T22:07:39Z", "content": "HUNTSVILLE, Ala.--(BUSINESS WIRE)--Stratics Networks, a leading provider of cloud communications and the \r\n inventors of Ringless Voicemail and IVR Polling, today announced the \r\n introduction of their Disaster Communication Program. This program will \r\n offe… [+2628 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Eddie King", "title": "Learning Morse code is a valuable skill—even in the 21st century", "description": "175 years on, there's still plenty of reasons to learn Morse code.", "url": "https://qz.com/1625459/learning-morse-code-is-a-valuable-skill-even-in-the-21st-century/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/05/AP_440516023-e1558535397609.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-05-24T09:00:47Z", "content": "The first message sent by Morse codes dots and dashes across a long distance traveled from Washington, DC, to Baltimore on Friday, May 24, 1844175 years ago. It signaled the first time in human history that complex thoughts could be communicated at long dista… [+6218 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Matthew Gault, Jordan Pearson", "title": "Why the Chernobyl Nuclear Reactor Exploded", "description": "HBO's 'Chernobyl' is a story about political power, not the dangers of nuclear energy, and it's important to know what really happened.", "url": "https://www.vice.com/en_us/article/597k9x/why-the-chernobyl-nuclear-reactor-exploded", "urlToImage": "https://video-images.vice.com/articles/5cf684aefbe640000818ca62/lede/1559660365608-Screen-Shot-2019-06-04-at-105907-AM.png?crop=0.9007xw:0.9989xh;0.0421xw,0xh&resize=1200:*", "publishedAt": "2019-06-04T15:09:56Z", "content": "On April 26, 1986 a nuclear reactor exploded in the Soviet Union. You might already know this, either because youre a history buff or just a fan of HBOs hit miniseries Chernobyl, which ended with Monday nights dramatic finale.\r\n In the wake of the shows popul… [+6822 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "News at a glance", "description": "SCI COMMUN### Conservation\n\n![Figure][1]</img>\n\nPHOTO: FELIPE WERNECK/IBAMA/CC BY-SA\n\nDeforestation in Brazil increased sharply in May, with 740 square kilometers of land newly cleared, according to the Real-time Deforestation Detection System (DETER), a sate…", "url": "https://science.sciencemag.org/content/364/6445/1014.full", "urlToImage": "https://science.sciencemag.org/sites/default/files/highwire/sci/364/6445.cover-source.gif", "publishedAt": "2019-06-13T17:42:20Z", "content": null}, {"source": {"id": null, "name": "Yankodesign.com"}, "author": "Sarang Sheth", "title": "“Design for Empathy” is the 2019 theme for the Taiwan International Student Design Competition", "description": "“Design for Empathy” is the 2019 theme for the Taiwan International Student Design Competition If the past few years have been any indication, the east is strongly embracing design culture and the power of design when it comes to shaping...", "url": "https://www.yankodesign.com/2019/05/25/design-for-empathy-is-the-2019-theme-for-the-taiwan-international-student-design-competition/", "urlToImage": null, "publishedAt": "2019-05-25T15:16:25Z", "content": "If the past few years have been any indication, the east is strongly embracing design culture and the power of design when it comes to shaping lives, societies, and cultures. Countries like China, Korea, Hong Kong and Taiwan are looking to adopt design thinki… [+7252 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "We took a 4-hour flight on the new Delta Airbus jet that Boeing tried to keep out of the US. Here's what it was like. (DAL)", "description": "The Airbus A220 is one of the most advanced and fuel-efficient airliners in the world. The Canadian-built jet, formerly known as the Bombardier C Series, entered commercial service in the US with Delta Air Lines earlier this year. Recently, we flew from New Y…", "url": "https://www.businessinsider.com/delta-airbus-a220-flight-review-nyc-dfw-photos-details-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cf1602411e20577887e4608-2732-1366.jpg", "publishedAt": "2019-06-02T13:14:00Z", "content": "The Airbus A220 was one of the most hotly anticipated airliners in recent memory to reach the US. The Quebec-built jet, formerly known as the Bombardier C Series, was the subject of a heated US-Canadian trade dispute in 2017. \r\n In April of that year, Boeing … [+2085 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Evie Kendal", "title": "Five Ethical Questions for How We Choose to Use the Moon", "description": "The moon has always served as an inspiration for humanity, and there are many potential benefits for further exploration of our planet's rocky satellite.", "url": "https://www.space.com/using-the-moon-5-ethical-questions.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E4o5coSKV2yCq4B5CYx8cf-1200-80.jpg", "publishedAt": "2019-06-04T22:00:02Z", "content": "This article was originally published at The Conversation.\r\n The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nThe moon\r\n has always served as an inspiration for humanity, and there are many potential benefits for fu… [+6744 chars]"}, {"source": {"id": null, "name": "Eff.org"}, "author": "Aaron Mackey", "title": "If Regulators Won’t Stop The Sale of Cell Phone Users’ Location Data, Consumers Must", "description": "A Motherboard investigation revealed in January how any cellphone users’ real-time location could be obtained for $300. The pervasiveness of the practice, coupled with the extreme invasion of people’s privacy, is alarming. The reporting showed there is a vibr…", "url": "https://www.eff.org/deeplinks/2019/05/if-regulators-wont-stop-sale-cell-phone-users-location-data-consumers-must", "urlToImage": "https://www.eff.org/files/banner_library/location-city.png", "publishedAt": "2019-05-28T12:07:37Z", "content": "A Motherboard investigation revealed in January how any cellphone users real-time location could be obtained for $300. The pervasiveness of the practice, coupled with the extreme invasion of peoples privacy, is alarming.\r\nThe reporting showed there is a vibra… [+2832 chars]"}, {"source": {"id": null, "name": "Carscoops.com"}, "author": "Sergiu Tudose", "title": "Need Help After An Accident? There’s A Volvo App For That Too", "description": "Volvo USA's Car Accident Advisor will help keep you informed and in control after a crash.", "url": "https://www.carscoops.com/2019/05/need-help-after-an-accident-theres-a-volvo-app-for-that-too/", "urlToImage": "https://images.carscoops.com/2019/05/8e93fa7d-volvo-usa-post-accident-guidance-4.jpg", "publishedAt": "2019-05-15T21:33:21Z", "content": "Volvo has created a new free app called “Car Accident Advisor” designed to assist drivers after a collision. The service will be available in the U.S. automatically for model year 2015.5 and newer Volvo vehicles, via their in-car SOS communication system.\r\nOl… [+1887 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Motorola Offers Mission Critical Products to Allegheny County", "description": "The introduction of the two-way radio system by Motorola (MSI) enhances coverage and interoperability with first responders across Allegheny county.", "url": "https://finance.yahoo.com/news/motorola-offers-mission-critical-products-115811254.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/v6pWc5mKxraYlh.Xb8D_lw--~B/aD01MDY7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/1154d43aaeb65735a640003549116295", "publishedAt": "2019-05-22T11:58:11Z", "content": "Motorola Solutions, Inc. MSI recently announced that its APX Project 25 (P25) two-way radios are available for Allegheny countys public-safety communications system. The radios will form an integral part of Maryland FiRST (First Responder Radio System Team) a… [+3562 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Motorola Solutions Provides Allegheny County with New Mission Critical Public Safety Solutions", "description": "CHICAGO--(BUSINESS WIRE)--Motorola Solutions (NYSE:MSI) announced its implementation of APX™ Project 25 (P25) two-way radios into the Maryland FiRST Radio System for Allegheny County. Used by law enforcement, fire departments and emergency medical services (E…", "url": "https://www.businesswire.com/news/home/20190521005308/en/Motorola-Solutions-Allegheny-County-New-Mission-Critical", "urlToImage": "https://mms.businesswire.com/media/20190521005308/en/532387/23/MSI-Vertical.jpg", "publishedAt": "2019-05-21T15:06:32Z", "content": "CHICAGO--(BUSINESS WIRE)--Motorola Solutions (NYSE:MSI) announced its implementation of APX \r\n Project 25 (P25) two-way radios into the Maryland FiRST Radio System for \r\n Allegheny County. Used by law enforcement, fire departments and \r\n emergency medical ser… [+2307 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Ziya Tong, Jason Koebler", "title": "How Satellites Quietly, Constantly Surveil Us", "description": "In a few short decades, the movement and activities of large swaths of Earth's humans can be tracked at all times.", "url": "https://www.vice.com/en_us/article/ywyxxm/how-satellites-quietly-constantly-surveil-us", "urlToImage": "https://video-images.vice.com/articles/5cffbc76778cdb00082f70a7/lede/1560264804894-GettyImages-466413772.jpeg?crop=1xw:0.5592xh;0xw,0.0889xh&resize=1200:*", "publishedAt": "2019-06-11T15:05:47Z", "content": "Ziya Tong is the author of 'The Reality Bubble,' a groundbreaking and wonder-filled look at the hidden things that shape our lives in unexpected and sometimes dangerous ways. This is excerpted from that book.\r\nIt was obvious that the dot on the map had stoppe… [+11913 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Boeing admits it \"fell short\" on safety alert for 737", "description": "Boeing admits it fell short on implementing a safety alert system on the 737 Max", "url": "https://www.bbc.co.uk/news/business-48461110", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p07bs668.jpg", "publishedAt": "2019-05-30T12:40:17Z", "content": "Media caption'We're confident on the plane's safety'\r\nBoeing has admitted it \"fell short\" when it failed to implement a safety alert system on the 737 Max.\r\nThe aircraft was grounded globally in March after two crashes within months.\r\nBoeing boss Dennis Muile… [+4345 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aloysius Xavier Lopez", "title": "Countdown begins to real-time monitoring of city", "description": "Facial recognition cameras, smart poles to be operational by August", "url": "https://www.thehindu.com/news/cities/chennai/countdown-begins-to-real-time-monitoring-of-city-facial-recognition-cameras-smart-poles-to-be-operational-by-august/article27699881.ece", "urlToImage": "https://www.thehindu.com/news/cities/chennai/3dt11x/article27699880.ece/ALTERNATES/LANDSCAPE_615/08JUNTHRIPPONBUILDING", "publishedAt": "2019-06-08T19:20:01Z", "content": "Real-time monitoring of neighbourhoods using facial recognition cameras and other Smart City projects will start by August 3, covering over 700 spots across the city. \r\nWith the Chennai Corporation asking vendors to complete work on installation of various Sm… [+2453 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Maine Emergency Management Agency Recognized for Outstanding Website", "description": "AUGUSTA, Maine--(BUSINESS WIRE)--The Maine Emergency Management Agency’s website, www.maine.gov/mema was honored with a Gold AVA Digital Award at the 2019 awards competition.", "url": "https://www.businesswire.com/news/home/20190522005149/en/Maine-Emergency-Management-Agency-Recognized-Outstanding-Website", "urlToImage": "http://www.businesswire.com/images/bwlogo_square.png", "publishedAt": "2019-05-22T12:08:26Z", "content": "AUGUSTA, Maine--(BUSINESS WIRE)--The Maine Emergency Management Agencys website, www.maine.gov/mema \r\n was honored with a Gold AVA Digital Award at the 2019 awards competition.\r\nThe newly updated www.maine.gov/mema \r\n website was designed with the user in min… [+2036 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Tecore’s Managed Access System To Replace Cellular Jamming In New Zealand", "description": "WELLINGTON, New Zealand--(BUSINESS WIRE)--Tecore Networks, a global supplier of innovative wireless network infrastructure, announced that its iNACTM Managed Access System (MAS) has been selected by Spark New Zealand for the provision of a “Managed Cellular C…", "url": "https://www.businesswire.com/news/home/20190515005619/en/Tecore%E2%80%99s-Managed-Access-System-Replace-Cellular-Jamming", "urlToImage": "https://mms.businesswire.com/media/20190515005619/en/721883/23/Tecore_Logo_RGB_thumbnail.jpg", "publishedAt": "2019-05-15T14:23:07Z", "content": "WELLINGTON, New Zealand--(BUSINESS WIRE)--Tecore Networks, a global supplier of innovative wireless network \r\n infrastructure, announced that its iNACTM \r\n Managed Access System (MAS) has been selected by Spark \r\n New Zealand for the provision of a Managed Ce… [+4481 chars]"}, {"source": {"id": null, "name": "Knoxnews.com"}, "author": "Erica Breunlin", "title": "Three ways to prepare your business for a fire - Knoxville News Sentinel", "description": "Three ways to prepare your business for a fire Knoxville News Sentinel East Tennessee suffered two major fires this spring. Here's how you can protect your business from serious flames.", "url": "https://www.knoxnews.com/story/money/business/2019/06/06/how-can-you-protect-your-business-fire/1148975001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/02/PKNS/e3a99572-920d-4086-a3a6-f5a134acf4ed-Waste_Fire_279.JPG?crop=5439,3045,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-06T11:30:00Z", "content": "Last SlideNext Slide\r\nMassive fires devastated the historic Loudon County Courthouse in April and the Fort Loudon Waste &amp; Recycling Center in May.\r\nWhat steps can you take to protect or prepare your workplace for a similar emergency?\r\nIt's as simple as pr… [+6320 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Boeing admits it 'fell short' on safety alert for 737 - BBC News", "description": "Boeing admits it 'fell short' on safety alert for 737 BBC News Boeing CEO says he would put his family in a 737 Max CBS Evening News Boeing 737 Max could be grounded for months, says airline body BBC News FAA Weakness Exacerbated Boeing 737 Max Situation Wall…", "url": "https://www.bbc.com/news/business-48461110", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p07bs668.jpg", "publishedAt": "2019-05-30T12:45:00Z", "content": "Media caption'We're confident on the plane's safety'\r\nBoeing has admitted it \"fell short\" when it failed to implement a safety alert system on the 737 Max.\r\nThe aircraft was grounded globally in March after two crashes within months.\r\nBoeing boss Dennis Muile… [+4346 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Everbridge Deployed to Power Emergency Alerts for Metropolitan Nashville and Davidson County", "description": "BURLINGTON, Mass.--(BUSINESS WIRE)--Everbridge, Inc. (NASDAQ: EVBG), the global leader in critical event management software that helps keep people safe and businesses running, today announced that its mass notification solution will be used to power alerts f…", "url": "https://www.businesswire.com/news/home/20190606005193/en/Everbridge-Deployed-Power-Emergency-Alerts-Metropolitan-Nashville", "urlToImage": "http://www.businesswire.com/images/bwlogo_square.png", "publishedAt": "2019-06-06T12:27:31Z", "content": "BURLINGTON, Mass.--(BUSINESS WIRE)--Everbridge, \r\n Inc. (NASDAQ: EVBG), the global leader in critical event management \r\n software that helps keep people safe and businesses running, today \r\n announced that its mass notification solution will be used to power… [+7656 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Comtech Showcasing 911 Solutions for States and Local Jurisdictions at NENA 2019", "description": "MELVILLE, N.Y. & ORLANDO, Fla.--(BUSINESS WIRE)--June 11, 2019-- Comtech Telecommunications Corp. (Nasdaq:CMTL), a world leader in secure and highly reliable communication technology, today announced that its Safety &amp; Security Technologies (Comtech SST) g…", "url": "https://www.businesswire.com/news/home/20190611005530/en/Comtech-Showcasing-911-Solutions-States-Local-Jurisdictions", "urlToImage": "https://mms.businesswire.com/media/20190611005530/en/320556/23/CMTL_LOGO.jpg", "publishedAt": "2019-06-11T13:08:06Z", "content": "MELVILLE, N.Y. &amp; ORLANDO, Fla.--(BUSINESS WIRE)--June 11, 2019-- Comtech Telecommunications Corp. (Nasdaq:CMTL), a world \r\n leader in secure and highly reliable communication technology, today \r\n announced that its Safety &amp; Security Technologies (Comt… [+2813 chars]"}, {"source": {"id": null, "name": "Roanoke.com"}, "author": "Karen Belcher karen.belcher@roanoke.com 981-3402", "title": "Names and changes: Business recognitions and promotions for the week of June 9, 2019 - Roanoke Times", "description": "Names and changes: Business recognitions and promotions for the week of June 9, 2019 Roanoke Times CONSTRUCTION. Julie Beth Vipperman has been appointed chief human resources and marketing officer of The Branch Group. EDUCATION. Amber Horst has...", "url": "https://www.roanoke.com/business/names-and-changes-business-recognitions-and-promotions-for-the-week/article_150689a4-c7f8-5166-9e85-63ca13206049.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/32/63244a80-267d-5e9a-aa35-adca354be480/5cf56c8e77564.image.jpg?crop=186%2C105%2C0%2C59&resize=356%2C200&order=crop%2Cresize", "publishedAt": "2019-06-09T03:55:00Z", "content": "CONSTRUCTION\r\nJulie Beth Vipperman has been appointed chief human resources and marketing officer of The Branch Group.\r\nEDUCATION\r\nAmber Horst has joined HoneyTree Early Learning Centers as the center director at the Vinton HoneyTree.\r\nJennifer Wayne has been… [+7691 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Avaya, RapidSOS, and 911 Secure Introduce Public Safety Breakthrough: First Integrated Device Location Discovery Solution for Next Generation Emergency Services", "description": "ORLANDO, Fla.--(BUSINESS WIRE)--NENA 2019 – Avaya Holdings Corp. (NYSE: AVYA) today announced unprecedented, life-saving device location discovery capabilities are now available to emergency first-responders through the integration between RapidSOS, 911 Secur…", "url": "https://www.businesswire.com/news/home/20190612005084/en/Avaya-RapidSOS-911-Secure-Introduce-Public-Safety", "urlToImage": "https://mms.businesswire.com/media/20190612005084/en/647287/23/avayargb.jpg", "publishedAt": "2019-06-12T12:09:55Z", "content": "ORLANDO, Fla.--(BUSINESS WIRE)--NENA 2019 Avaya Holdings Corp. (NYSE: AVYA) today announced \r\n unprecedented, life-saving device location discovery capabilities are \r\n now available to emergency first-responders through the integration \r\n between RapidSOS, 91… [+10101 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "AGCS Offers Response Services in Environmental Emergencies for Policyholders", "description": "NEW YORK--(BUSINESS WIRE)--Allianz expands its Environmental Impairment Liability coverage with emergency response services", "url": "https://www.businesswire.com/news/home/20190521005103/en/AGCS-Offers-Response-Services-Environmental-Emergencies-Policyholders", "urlToImage": "https://mms.businesswire.com/media/20190521005103/en/722719/23/Allianz_Logo_-_Blue_square.jpg", "publishedAt": "2019-05-21T12:09:44Z", "content": "NEW YORK--(BUSINESS WIRE)--Allianz \r\n Global Corporate &amp; Specialty SE (AGCS) announced today that it \r\n now offers expanded emergency response services as part of its \r\n Environmental Impairment Liability (EIL) coverage when pollution and/or \r\n contaminat… [+6889 chars]"}, {"source": {"id": null, "name": "Globalvoices.org"}, "author": "Amanda Lichtenstein", "title": "DRC Ebola outbreak spreads to neighboring Uganda, activating rapid preparedness response", "description": "Uganda has prepared for this moment: Three confirmed cases activate a strong Ebola response system of detection and prevention. But is this a \"public health emergency of international concern\"?", "url": "https://globalvoices.org/2019/06/13/drc-ebola-outbreak-spreads-to-neighboring-uganda-activating-rapid-preparedness-response/", "urlToImage": "https://globalvoices.org/wp-content/uploads/2019/06/2019-6-12-ebolauganda-800x450.jpg", "publishedAt": "2019-06-13T13:10:49Z", "content": "Several Ebola cases were treated here at Kagadi Hospital in Kibaale District, Uganda, in August 4, 2012. Three new cases have been identified in people who entered Uganda from the DRC border. Photo by CDC via Flickr: CC BY 2.0.\r\nOn June 12, Ugandan officials … [+7692 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "Marine ambulances unlikely to be rolled out this season", "description": "Speedboats not spared in crisis, allege fishers", "url": "https://www.thehindu.com/news/cities/kozhikode/marine-ambulances-unlikely-to-be-rolled-out-this-season/article27407932.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-06-02T19:35:24Z", "content": "Marine ambulance, a crucial demand from the fishermen community to streamline rescue operations during rough weather, is unlikely to take off this season thanks to alleged apathy on the part of the Fisheries Department. \r\nAccording to leaders of fishermens or… [+2522 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "TransformativeMed Recruits Chief Growth Officer and Adds Former Health System CEO to Its Board of Directors", "description": "SEATTLE--(BUSINESS WIRE)-- #CORES --TransformativeMed Hires Chief Growth Officer and Adds Former Health System CEO to its Board of Directors", "url": "https://www.businesswire.com/news/home/20190605005213/en/TransformativeMed-Recruits-Chief-Growth-Officer-Adds-Health", "urlToImage": "https://mms.businesswire.com/media/20190605005213/en/725758/23/logo_with_tagline.jpg", "publishedAt": "2019-06-05T11:09:36Z", "content": "SEATTLE--(BUSINESS WIRE)--TransformativeMed, \r\n the leader in empowering clinical communication and collaboration with \r\n EHR-embedded workflows, announced today that health industry veteran \r\n Greg Miller has joined the company as Chief Growth Officer, and f… [+3477 chars]"}, {"source": {"id": null, "name": "Kjrh.com"}, "author": null, "title": "Live updates: Severe weather blog - kjrh.com", "description": "Live updates: Severe weather blog kjrh.com Oklahoma and Texas tornadoes today: Serious storm warnings issued as severe weather hits — latest forecast, path, track, updates CBS News Major Flash Flooding, Tornadoes Expected in Southern Plains Overnight The Weat…", "url": "https://www.kjrh.com/news/local-news/live-severe-weather-blog", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/5e4cd8e/2147483647/strip/true/crop/960x504+0+108/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F02%2F92%2F21dd7dff4629aa34a068bbb6cc2f%2Fhammerheads.jpg", "publishedAt": "2019-05-20T16:36:00Z", "content": "As severe weather updates come in throughout the day, 2 Works for You will be tracking all of the latest information here.\r\n3:15 a.m.Pryor Public School's Superintendent Don Raleigh says Pryor schools are closed Tuesday due to their junior high being flooded … [+11674 chars]"}, {"source": {"id": null, "name": "Androidpit.com"}, "author": "Pierre Vitré", "title": "Wi-Fi vs 5G: the fight for connected car rages on", "description": "While some governments seem to favor Wi-Fi to connect the vehicles of the future, the war between car manufacturers continues. (This is a preview - click here to read the entire entry.)", "url": "https://www.androidpit.com/wifi-vs-5g-in-cars", "urlToImage": "https://fscl01.fonpit.de/userfiles/7446224/image/tesla-model-3/AndroidPIT-tesla-model-3-side3.jpg", "publishedAt": "2019-05-30T00:00:01Z", "content": "If Europe seems to prefer Wi-Fi, in order to get up and running as quickly as possible, the members of the 5GAA (5G Automotive Association), an group composed of several manufacturers (BMW, Ford, PSA...) and technology companies (Qualcomm, Huawei, Vodafone, S… [+3558 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Lisa Rapaport", "title": "Patients give more '5-star' ratings to hospitals with fewer services", "description": "(Reuters Health) - Compared to smaller facilities, hospitals that provide complex care for critical illness or serious injury may find it harder to make patients happy, a U.S. study suggests.", "url": "https://www.reuters.com/article/us-health-hospitals-reviews-idUSKCN1TB25G", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2019-06-10T16:53:42Z", "content": "(Reuters Health) - Compared to smaller facilities, hospitals that provide complex care for critical illness or serious injury may find it harder to make patients happy, a U.S. study suggests. \r\nPatients may be more likely to give top ‘5-star’ ratings to hospi… [+3949 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "UP Health System – Portage Named Duke LifePoint Quality Affiliate", "description": "HANCOCK, Mich.--(BUSINESS WIRE)--UP Health System – Portage today announced that it has been named a Duke LifePoint Quality Affiliate. This designation recognizes hospitals within the LifePoint Health system that have enrolled in the LifePoint National Qualit…", "url": "https://www.businesswire.com/news/home/20190521005886/en/Health-System-%E2%80%93-Portage-Named-Duke-LifePoint", "urlToImage": "https://mms.businesswire.com/media/20190521005886/en/723030/23/Portage_Logo_thumbnail.jpg", "publishedAt": "2019-05-21T19:11:42Z", "content": "HANCOCK, Mich.--(BUSINESS WIRE)--UP Health System Portage today announced that it has been named a Duke \r\n LifePoint Quality Affiliate. This designation recognizes hospitals \r\n within the LifePoint Health system that have enrolled in the LifePoint \r\n National… [+4760 chars]"}, {"source": {"id": null, "name": "Soldiersystems.net"}, "author": "SSD", "title": "Ops-Core AMP Communication Headset Selected By USSOCOM To Modernize SOF Communications", "description": "New technology in configurable headset delivers 3D Hear-Through and advanced hearing protection for combat operations. May 16, 2019 Carbondale, PA, May 16, 2019. Gentex Corporation, a global leader in personal protection and situational awareness solutions fo…", "url": "http://soldiersystems.net/2019/05/17/ops-core-amp-communication-headset-selected-by-ussocom-to-modernize-sof-communications/", "urlToImage": null, "publishedAt": "2019-05-17T14:30:17Z", "content": "New technology in configurable headset delivers 3D Hear-Through and advanced hearing protection for combat operations.\r\nMay 16, 2019\r\nCarbondale, PA, May 16, 2019. Gentex Corporation, a global leader in personal protection and situational awareness solutions … [+2960 chars]"}, {"source": {"id": null, "name": "Coolest-gadgets.com"}, "author": "Staff", "title": "Best GPS Tracker For Kids [2019]", "description": "Best Wearable Tracker: The security alone makes this the best GPS tracker – period. If it were available in a non-wearable, it would easily win that category too. Being kidSAFE approved and COPPA certified is more than enough to make this the best wearable GP…", "url": "https://www.coolest-gadgets.com/20190527/best-gps-tracker-for-kids/", "urlToImage": "https://www.coolest-gadgets.com/wp-content/uploads/2019/05/GPS-Tracker-Header.jpg", "publishedAt": "2019-05-27T22:57:21Z", "content": "Best Wearable Tracker:Jiobit GPS TrackerThe security alone makes this the best GPS tracker – period. If it were available in a non-wearable, it would easily win that category too. Being kidSAFE approved and COPPA certified is more than enough to make this the… [+33164 chars]"}, {"source": {"id": null, "name": "Vancouversun.com"}, "author": "Pamela Fayerman", "title": "9,500 patient complaints lodged with B.C. health authorities over treatment quality", "description": "Patient Care Quality Offices and review boards were formed 10 years ago to give health system users and their families an outlet to voice their frustration", "url": "https://vancouversun.com/news/local-news/9500-patient-complaints-lodged-with-b-c-health-authorities-over-treatment-quality", "urlToImage": "https://postmediavancouversun2.files.wordpress.com/2019/06/prv030209n-er-04.jpg", "publishedAt": "2019-06-12T23:37:26Z", "content": "A record number of complaints were filed with health authorities last year over patient care about 9,500 according to the Patient Care Quality Review Boards report for 2017/18.\r\nThats up from 8,900 the year before and about 9,000 the year before that.\r\nPatien… [+5177 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Gabrielle Lyons", "title": "Teen's sentence for joy ride in firefighting 4WD 'enrages' volunteer brigade", "description": "A teenager who stole a firefighting vehicle during the height of the Northern Territory's bushfire season has been been fined $200 and handed 100 hours of community service, angering the volunteer bushfire brigade whose equipment was stolen.", "url": "https://www.abc.net.au/news/2019-05-24/teen-who-stole-firefighting-vehicle-handed-$200-fine/11147300", "urlToImage": "https://www.abc.net.au/news/image/11147380-16x9-700x394.jpg", "publishedAt": "2019-05-24T07:31:37Z", "content": "Posted \r\nMay 24, 2019 17:31:37\r\nA teenager who stole a firefighting four-wheel drive during the height of the Northern Territory's bushfire season has been given a \"slap on the wrist\", according to the volunteer bushfire brigade whose equipment was stolen.\r\nT… [+2884 chars]"}, {"source": {"id": null, "name": "Paultan.org"}, "author": "Matthew H Tong", "title": "FIRST DRIVE: 2019 G20 BMW 330i M Sport – RM329k", "description": "In the world of cars, the BMW 3 Series really needs no introduction. It’s a living legend in its own right, one that’s universally known and desired by many. Now in its seventh generation, the […] The post FIRST DRIVE: 2019 G20 BMW 330i M Sport – RM329k appea…", "url": "https://paultan.org/2019/05/21/first-drive-2019-g20-bmw-330i-m-sport-rm329k/", "urlToImage": "https://s2.paultan.org/image/2019/05/G20-BMW-330i-Video-Cover-1200x675.jpg", "publishedAt": "2019-05-21T09:01:20Z", "content": "In the world of cars, the BMW 3 Series really needs no introduction. It’s a living legend in its own right, one that’s universally known and desired by many. Now in its seventh generation, the G20 3 Series aims to up the ante, and in just over seven months si… [+1806 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kathy Broderick Selker, CommunityVoice, Kathy Broderick Selker, CommunityVoice https://www.forbes.com/sites/forbesagencycouncil/people/kathyselker1/", "title": "How Mergers And Acquisitions Are Affecting Hospital Marketing", "description": "The challenge for female healthcare shoppers, who make 80% of healthcare decisions in America, is in determining the benefits and drawbacks of M&amp;As in their market.", "url": "https://www.forbes.com/sites/forbesagencycouncil/2019/06/12/how-mergers-and-acquisitions-are-affecting-hospital-marketing/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fforbesagencycouncil%2Ffiles%2F2019%2F06%2Fa-65-500x500.jpg", "publishedAt": "2019-06-12T10:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nHospital mergers and acquisitions (M&amp;amp;As) are increasingly affecting the way women shop for and acquire health care in America. M&amp;amp;As include the consolidation of separate hospitals into a … [+10757 chars]"}, {"source": {"id": null, "name": "Insurancejournal.com"}, "author": null, "title": "AGCS Offers Crisis Management Response Services with Its Pollution Liability Cover", "description": "Allianz Global Corporate & Specialty (AGCS) announced it is offering expanded emergency response services as part of its Environmental Impairment Liability (EIL) coverage when pollution and/or contamination events occur. AGCS has formed strategic partnerships…", "url": "https://www.insurancejournal.com/news/international/2019/05/22/527168.htm", "urlToImage": "https://www.insurancejournal.com/img/insurancejournal-square.png", "publishedAt": "2019-05-22T11:07:21Z", "content": "Allianz Global Corporate &amp; Specialty (AGCS) announced it is offering expanded emergency response services as part of its Environmental Impairment Liability (EIL) coverage when pollution and/or contamination events occur.\r\nAGCS has formed strategic partner… [+2420 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Kay Lazar", "title": "Baker administration pledges major reforms for troubled foster care system", "description": "The promised reforms are slated to roll out over the next year.", "url": "https://www.bostonglobe.com/metro/2019/05/14/baker-administration-pledges-major-reforms-for-troubled-foster-care-system/sCBt1SDB7rCtaEOrHEhZzL/story.html", "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/6PMFmRYJKvAh0C7WYe7o6Azd2Zc=/506x0/www.bostonglobe.com/pf/resources/images/logo-bg.jpg", "publishedAt": "2019-05-14T18:10:30Z", "content": "The Baker administration on Tuesday announced major reforms to the states troubled foster care system that it says will improve the lives of thousands of children, ease caseloads for their swamped social workers, and more aggressively recruit and retain foste… [+4216 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "Reuters", "title": "Trump’s Mexican tariffs test limits of U.S. emergency powers – legal experts", "description": "By Tom Hals and Brendan Pierson (Reuters) - U.S. President Donald Trump's proposal to impose a tariff on all Mexican goods to push Mexico to halt a surge in illegal immigrants is likely to be challenged in court and will test the scope of the president's emer…", "url": "https://www.firstpost.com/business/trumps-mexican-tariffs-test-limits-of-u-s-emergency-powers-legal-experts-6738221.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/reuters/06-2019/01/2019-05-31T190050Z_1_LYNXNPEF4U1YU_RTROPTP_2_USA-TRUMP.jpg", "publishedAt": "2019-05-31T23:35:48Z", "content": "By Tom Hals and Brendan Pierson\r\n(Reuters) - U.S. President Donald Trump's proposal to impose a tariff on all Mexican goods to push Mexico to halt a surge in illegal immigrants is likely to be challenged in court and will test the scope of the president's eme… [+5064 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Pulsara Platform Part of Duke Clinical Research Institute (DCRI) IMPROVE Stroke Care Project", "description": "BOZEMAN, Mont.--(BUSINESS WIRE)--Pulsara announced it is a partner in DCRI’s IMPROVE Stroke Care Project. Pulsara's mission and purpose are aligned with the goals of the DCRI project. Pulsara, the leader in regional systems of care communications, has demonst…", "url": "https://www.businesswire.com/news/home/20190515005200/en/Pulsara-Platform-Part-Duke-Clinical-Research-Institute", "urlToImage": "https://mms.businesswire.com/media/20190515005200/en/721756/23/video-chat-md-ems-stroke.jpg", "publishedAt": "2019-05-15T12:52:09Z", "content": "BOZEMAN, Mont.--(BUSINESS WIRE)--Pulsara \r\n announced it is a partner in DCRIs IMPROVE Stroke Care Project. \r\n Pulsara's mission and purpose are aligned with the goals of the DCRI \r\n project. Pulsara, the leader in regional systems of care communications, \r\n … [+4040 chars]"}, {"source": {"id": null, "name": "Gadgethacks.com"}, "author": "Jon Knight", "title": "51 Exciting New Features & Changes in Android 10", "description": "Android's major 2019 update is a special one — it's the tenth full version of the world's most commonly used operating system. The upcoming release, which should be known as Android 10 (codename Android Q), is currently in beta, and we've been digging around …", "url": "https://android.gadgethacks.com/news/51-exciting-new-features-changes-android-10-0192760/", "urlToImage": "https://img.gadgethacks.com/img/75/30/63683757186114/0/51-exciting-new-features-changes-android-10.1280x600.jpg", "publishedAt": "2019-06-06T19:00:00Z", "content": "Android's major 2019 update is a special one it's the tenth full version of the world's most commonly used operating system. The upcoming release, which should be known as Android 10 (codename Android Q), is currently in beta, and we've been digging around in… [+37188 chars]"}, {"source": {"id": null, "name": "Dzone.com"}, "author": "Anton Angelov", "title": "Testing for Developers: Testing Types and Definitions", "description": "In the series, we will define the basic terms that every developer needs to know about testing. The purpose is to give all team members a shared understanding of the fundamental terminology of quality assurance and all related processes. Later, this will impr…", "url": "https://dzone.com/articles/testing-for-developers-testing-types-and-definitio?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone", "urlToImage": "https://dz2cdn4.dzone.com/storage/article-thumb/11893199-thumb.jpg", "publishedAt": "2019-05-22T15:07:06Z", "content": "In the series, we will define the basic terms that every developer needs to know about testing. The purpose is to give all team members a shared understanding of the fundamental terminology of quality assurance and all related processes. Later, this will impr… [+8290 chars]"}, {"source": {"id": null, "name": "Grist.org"}, "author": "Matt Simon", "title": "This casino’s microgrid might be the future of energy", "description": "Blue Lake Rancheria could serve as a model for other remote communities seeking to establish energy independence.", "url": "http://grist.org/article/this-casinos-microgrid-might-be-the-future-of-energy/", "urlToImage": "https://grist.files.wordpress.com/2019/05/gettyimages-119599739-e1558118239451.jpg?w=1200&h=675&crop=1", "publishedAt": "2019-05-18T11:00:59Z", "content": "This story was originally published by Wired and is reproduced here as part of the Climate Desk collaboration.\r\nAs the Fukushima disaster unfolded in Japan, the Blue Lake Rancheria, in Northern California, was dealing with its own crisis. Several miles inland… [+9310 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Brian Kahn", "title": "Should We Be Calling Climate Change A 'Climate Crisis'?", "description": "How we talk about climate change is rapidly shifting as the ramifications of unchecked carbon pollution become ever clearer. The Guardian sped that shift along last week, when it updated its style guide to encourage reporters to refer to climate change as a “…", "url": "https://www.gizmodo.com.au/2019/05/should-we-be-calling-climate-change-a-climate-crisis/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_768,q_90/occ0zo3nnmndbhbpahdr.jpg", "publishedAt": "2019-05-22T10:15:00Z", "content": "How we talk about climate change is rapidly shifting as the ramifications of unchecked carbon pollution become ever clearer. The Guardian sped that shift along last week, when it updated its style guide to encourage reporters to refer to climate change as a c… [+5202 chars]"}, {"source": {"id": null, "name": "Brooklynvegan.com"}, "author": "Amanda Hatfield", "title": "Governors Ball shares \"truthful and transparent backstory\" about Sunday", "description": "”While we are happy that no injuries were reported during the evacuation, we aren’t going to sugar coat things here. When you are evacuating tens of thousands of people from any site, it is a challenging endeavor,” Governors Ball organizers write in a new sta…", "url": "http://www.brooklynvegan.com/governors-ball-shares-truthful-and-transparent-backstory-about-sunday/", "urlToImage": "http://www.brooklynvegan.com/files/2019/06/madsoundstx.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2019-06-04T04:50:28Z", "content": "A Message From Founders\r\nFirst off we want to sincerely express how sorry and upset we are that the festival had to delay opening and then eventually evacuate yesterday. We work all year round on the festival, and yesterdays chain of events was the very last … [+4798 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Explainer: How does the situation on the U.S.-Mexico border compare with the past?", "description": "U.S. President Donald Trump has made immigration a central theme of his administration but has grown increasingly frustrated with the ballooning numbers of mostly Central American families crossing the U.S.-Mexico border and turning themselves in to U.S. auth…", "url": "https://www.reuters.com/article/us-usa-immigration-border-explainer-idUSKCN1T72Y5", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190606&t=2&i=1395145424&w=1200&r=LYNXNPEF551XN", "publishedAt": "2019-06-06T22:29:38Z", "content": "(Reuters) - U.S. President Donald Trump has made immigration a central theme of his administration but has grown increasingly frustrated with the ballooning numbers of mostly Central American families crossing the U.S.-Mexico border and turning themselves in … [+4814 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Comtech Solacom Introduces Turnkey Cybersecurity Solution for Public Safety Infrastructures", "description": "MELVILLE, N.Y.--(BUSINESS WIRE)--June 14, 2019 -- Comtech Telecommunications Corp. (Nasdaq:CMTL) announced today that it’s subsidiary, Solacom Technologies Inc. (“Solacom”), which is part of Comtech’s Commercial Solutions segment, introduced a new Guardian Cy…", "url": "https://www.businesswire.com/news/home/20190614005057/en/Comtech-Solacom-Introduces-Turnkey-Cybersecurity-Solution-Public", "urlToImage": "https://mms.businesswire.com/media/20190614005057/en/320556/23/CMTL_LOGO.jpg", "publishedAt": "2019-06-14T14:03:38Z", "content": "MELVILLE, N.Y.--(BUSINESS WIRE)--June 14, 2019 --Comtech Telecommunications Corp. (Nasdaq:CMTL) \r\n announced today that its subsidiary, Solacom Technologies Inc. \r\n (Solacom), which is part of Comtechs Commercial Solutions segment, \r\n introduced a new Guardia… [+3718 chars]"}, {"source": {"id": null, "name": "Bringatrailer.com"}, "author": "bringatrailer", "title": "BaT Auction: 34k-Mile 2000 Porsche 911 Carrera 4 Millennium Edition 6-Speed", "description": "This 2000 Porsche 911 Carrera 4 Millennium Edition was purchased new in Southern California and reportedly was inherited in 2018 by the original owner's son, from whom the seller acquired the car later that year. Millennium Edition models were finished in Chr…", "url": "https://bringatrailer.com/listing/2000-porsche-911-carrera-4-11/", "urlToImage": "https://cdn.bringatrailer.com/wp-content/uploads/2019/05/2000_porsche_911_carrera_4_1559757144d208495d2000_porsche_911_carrera_4_1559757142f98764da4b4b50d2-9929-4ec5-ae3a-02dfbb058a42-ff1duk-e1559932576379.jpg", "publishedAt": "2019-06-10T17:50:05Z", "content": "This 2000 Porsche 911 Carrera 4 Millennium Edition was purchased new in Southern California and reportedly was inherited in 2018 by the original owner’s son, from whom the seller acquired the car later that year. Millennium Edition models were finished in Chr… [+3145 chars]"}, {"source": {"id": null, "name": "Voxeu.org"}, "author": "Bolton, Cecchetti, Danthine, Vives", "title": "Sound at last? Assessing a decade of financial regulation: A new eBook", "description": "While the decade since the Global Crisis has seen clear improvements in financial regulation and supervision, there is still work to be done in several crucial areas, and political constraints may bite.This column introduces the first report in a new series o…", "url": "https://voxeu.org/article/sound-last-assessing-decade-financial-regulation-new-ebook", "urlToImage": "https://voxeu.org/sites/default/files/image/FromMay2014/soundatlasttwittercard.jpg", "publishedAt": "2019-06-03T00:00:00Z", "content": "Patrick Bolton, Stephen Cecchetti, Jean-Pierre Danthine, Xavier Vives03 June 2019While the decade since the Global Crisis has seen clear improvements in financial regulation and supervision, there is still work to be done in several crucial areas, and politic… [+11011 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Nathan S. Debortoli, Dylan G. Clark, James D. Ford, Jesse S. Sayles, Emilia P. Diaconescu", "title": "An integrative climate change vulnerability index for Arctic aviation and marine transportation", "description": "It is important to understand how physical changes in Polar regions influence social systems and populations. Here the authors develop an Arctic Climate Change Vulnerability Index focusing on aviation and marine infrastructure in future climate scenarios and …", "url": "https://www.nature.com/articles/s41467-019-10347-1?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+ncomms%2Frss%2Fcurrent+%28Nature+Communications+-+current%29", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-019-10347-1/MediaObjects/41467_2019_10347_Fig1_HTML.png", "publishedAt": "2019-06-13T00:00:00Z", "content": "Background\r\nAcross much of the Canadian Arctic, infrastructure and transportation systems are not sufficiently meeting basic needs22,39,40,41,42. Transportation systems and community infrastructure across Inuit Nunangat are keystones to human security43. Heal… [+29638 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Southeast Asia Building Automation System Market 2019 - Forecast to 2023 - ResearchAndMarkets.com", "description": "DUBLIN--(BUSINESS WIRE)--The \"Building Automation System Market in Southeast Asia, Forecast to 2023\" report has been added to ResearchAndMarkets.com's offering. The Southeast Asian building automation system (BAS) market is in its growth stage and presents a …", "url": "https://www.businesswire.com/news/home/20190612005657/en/Southeast-Asia-Building-Automation-System-Market-2019", "urlToImage": "https://mms.businesswire.com/media/20190612005657/en/371054/23/ResearchAndMarkets_800px.jpg", "publishedAt": "2019-06-12T15:09:11Z", "content": "DUBLIN--(BUSINESS WIRE)--The \"Building \r\n Automation System Market in Southeast Asia, Forecast to 2023\" \r\n report has been added to ResearchAndMarkets.com's \r\n offering.\r\nThe Southeast Asian building automation system (BAS) market is in its \r\n growth stage an… [+4702 chars]"}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Lightspeed on Lightspeed Magazine, shared by Cheryl Eddy to io9", "title": "LIGHTSPEED Presents: \"Between the Dark and the Dark\" by Deji Bryce Olukotun", "description": "io9 is proud to present fiction from Lightspeed Magazine. Once a month, we feature a story from Lightspeed’s current issue, and this month’s selection is “Between the Dark and the Dark” by Deji Bryce Olukotun. You can read the story below or you can listen to…", "url": "https://lightspeedmagazine.kinja.com/lightspeed-presents-between-the-dark-and-the-dark-by-1835274016", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--g5yzy7Ta--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/y7oqmmy6ie0jeo0bsutk.jpg", "publishedAt": "2019-06-06T12:00:00Z", "content": "io9 is proud to present fiction from Lightspeed Magazine. Once a month, we feature a story from Lightspeeds current issue, and this months selection is Between the Dark and the Dark by Deji Bryce Olukotun. You can read the story below or you can listen to the… [+74144 chars]"}, {"source": {"id": null, "name": "Carscoops.com"}, "author": "Brad Anderson", "title": "Driven: 2019 Toyota Corolla ZR Hybrid Talks The Talk, Walks The Walk", "description": "The Corolla was, for very many years, synonymous with reliable transportation. This one's got character, too.", "url": "https://www.carscoops.com/2019/05/driven-2019-toyota-corolla-zr-hybrid-talks-the-talk-walks-the-walk/", "urlToImage": "https://images.carscoops.com/2019/04/f2f97b76-toyota-corolla-zr-hybrid-.jpg", "publishedAt": "2019-05-13T23:00:04Z", "content": "I’m in a quandary. Like lots of other petrolheads, I love cars from my childhood – in particular, those from the 1990s and early 2000s. These were perhaps the twilight years of cars with manual transmissions with somewhat iffy safety ratings, rattly rides, an… [+7139 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gretchen Fox, Contributor, Gretchen Fox, Contributor https://www.forbes.com/sites/gretchenfox/", "title": "An Open Letter To Executives: It's Time To Address The \"Consciousness\" Of Your Business", "description": "There are a million miles between a conscious, healthy, thriving, triple-bottom-line and whole-human approach to business and the majority of businesses. Where is your business on this continuum and what is its trajectory?", "url": "https://www.forbes.com/sites/gretchenfox/2019/06/06/consciousness-of-business/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fgretchenfox%2Ffiles%2F2019%2F06%2Fconsciousness-of-business_Forbes_gretchen-fox-palmer_640x640-500x500.png", "publishedAt": "2019-06-06T18:38:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nConsciousness of Business\r\nPHOTO FROM UNSPLASH AND EDITED BY MTO AGENCY, DESIGNER MARIANA SAHAG&amp;Uacute;N\r\nIts time leaders take ownership of the consciousness of your businesses.\r\nFor those who are q… [+13706 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Loria and Jake Kanter", "title": "These are 9 strict workplace rules Elon Musk makes his Tesla employees follow", "description": "SpaceX and Tesla CEO Elon Musk is famously productive — and he expects the same levels of enthusiasm from his employees. An email sent to Tesla employees last year, as well as other reports, provide a window on the rules he likes people to observe in the work…", "url": "https://www.businessinsider.com/elon-musk-productivity-tips-for-tesla-employees-2018-4", "urlToImage": "https://amp.businessinsider.com/images/5aa58c43be412026008b4830-960-480.jpg", "publishedAt": "2019-06-13T15:05:00Z", "content": "Tesla CEO Elon Musk.\r\n Joe Skipper/Reuters \r\n Elon Musk gets a lot done. \r\n The 47-year-old entrepreneur and CEO is revolutionizing the spaceflight industry with SpaceX, transforming the world of the electric car at Tesla, and pushing neuroscience and transpo… [+603 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Rave Mobile Safety Introduces Live Streaming Video", "description": "FRAMINGHAM, Mass.--(BUSINESS WIRE)-- #Innovation --Rave Mobile Safety introduced live streaming to help public safety officials deploy the right resources faster with real-time critical information", "url": "https://www.businesswire.com/news/home/20190613005168/en/Rave-Mobile-Safety-Introduces-Live-Streaming-Video", "urlToImage": "https://mms.businesswire.com/media/20190613005168/en/727524/23/Rave_logo.jpg", "publishedAt": "2019-06-13T12:09:04Z", "content": "FRAMINGHAM, Mass.--(BUSINESS WIRE)--Rave Mobile Safety (Rave), the \r\n trusted provider of emergency and public safety solutions that help save \r\n lives, today announced a significant advancement to its product \r\n suite that will be unveiled at NENA \r\n 2019 ne… [+6012 chars]"}, {"source": {"id": null, "name": "Gearpatrol.com"}, "author": "Bryan Campbell", "title": "The Best Upgrades For Your Dad’s Overlander", "description": "There's no such thing as \"over prepared\" in the world of overlanding. When you're heading out on a four-wheeled adventure, the more tools you have at your disposal, the more ready you'll be for any situation.", "url": "https://gearpatrol.com/2019/06/07/best-upgrades-for-your-dads-overlander/", "urlToImage": "https://cdn.gearpatrol.com/wp-content/uploads/2019/05/Best-Upgrades-For-Your-Dad’s-Overlander-gear-patrol-lead-feature.jpg", "publishedAt": "2019-06-07T15:21:00Z", "content": "In the world of overlanding, there’s no such thing as “overprepared.” When you’re heading out on a four-wheeled adventure, the more tools you have at your disposal, the more ready you are be for any situation. Whether those tools are hand-held or bolted to th… [+5708 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Texas A&M University Selects Blue Pillar IoT Network for Emergency Power Monitoring and Control System - Yahoo Finance", "description": "University to expand the Blue Pillar system to enable campus-wide connectivity of all back-up generators, automatic transfer switches, and associated fuel systems.  FREDERICK, Md., June 13, 2019 /PRNewswire-PRWeb/ -- Texas A&M University announced it has sele…", "url": "https://finance.yahoo.com/news/texas-m-university-selects-blue-100000389.html", "urlToImage": null, "publishedAt": "2019-06-13T10:00:00Z", "content": "University to expand the Blue Pillar system to enable campus-wide connectivity of all back-up generators, automatic transfer switches, and associated fuel systems.\r\nFREDERICK, Md., June 13, 2019 /PRNewswire-PRWeb/ -- Texas A&amp;M University announced it has … [+4270 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "'Five star' hospitals often provide fewer services than other hospitals, new data suggests", "description": "If you're looking for a top-notch hospital with a wide range of services, narrowing your list to hospitals with a five-star patient experience rating might lead you astray. Many five-star hospitals offer fewer services than those without five stars, according…", "url": "https://www.eurekalert.org/pub_releases/2019-06/jhm-s061219.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/203479_web.jpg", "publishedAt": "2019-06-12T04:00:00Z", "content": "IMAGE: Comparison of services provided at five star rated hospitals vs. non-five star rated hospitals.\r\n view more \r\nCredit: Johns Hopkins Medicine\r\nIf you're looking for a top-notch hospital with a wide range of services, narrowing your list to hospitals wit… [+4773 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Kinemetrics Launches OasisPlus to Provide Preparedness, Situational Awareness, Real-Time Response for Hospitals Before, During, After Earthquakes", "description": "PASADENA, Calif.--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/businesscontinuity?src=hash&quot; target=&quot;_blank&quot;gt;#businesscontinuitylt;/agt;--OasisPlus launches into hospitals, delivers awareness, real-time data, info for occupants…", "url": "https://www.businesswire.com/news/home/20190515005267/en/Kinemetrics-Launches-OasisPlus-Provide-Preparedness-Situational-Awareness", "urlToImage": "https://mms.businesswire.com/media/20190515005267/en/721797/23/Kinemetrics-Logo.jpg", "publishedAt": "2019-05-15T13:23:26Z", "content": "PASADENA, Calif.--(BUSINESS WIRE)--Kinemetrics, Inc., the leader in developing and delivering solutions for \r\n monitoring earthquakes and their effects on people, business and \r\n structures, announced that the Seattle Childrens Hospital has become \r\n the firs… [+6670 chars]"}, {"source": {"id": null, "name": "Yellowhammernews.com"}, "author": "Sean Ross", "title": "Huntsville resident named to National Small Business Association leadership role - Yellowhammer News", "description": "Huntsville resident named to National Small Business Association leadership role Yellowhammer News Dr. Ken Rivenbark, owner of Rivenbark & Roper Antiques in Huntsville, has been named to the National Small Business Association Leadership Council...", "url": "https://yellowhammernews.com/huntsville-resident-named-to-national-small-business-association-leadership-role/", "urlToImage": "https://yellowhammernews.com/wp-content/uploads/2019/05/Dr-Ken-Rivenbark.jpg", "publishedAt": "2019-05-14T19:50:13Z", "content": "They say time heals all wounds, but for me, its not so easy.\r\nYou see, just over a year ago my only child was killed just 26 days before her 18th birthday, and three months to the day before she would have graduated from Thompson High School. My sweet daughte… [+3525 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Govt., agencies tie up to make industries less hazardous", "description": "Online system to make industries safer, less hazardous", "url": "https://www.thehindu.com/news/cities/Thiruvananthapuram/govt-agencies-tie-up-to-make-industries-less-hazardous/article27820407.ece", "urlToImage": "https://www.thehindu.com/news/cities/Thiruvananthapuram/317qrp/article27820406.ece/ALTERNATES/LANDSCAPE_615/12TVTVMOU", "publishedAt": "2019-06-11T19:05:58Z", "content": "The State government is establishing a Remote Sensing enabled Online Chemical Emergency Response System (ROCERS) to make industries safer and less hazardous for workers and residents in the neighbourhood. \r\nThe Department of Factories and Boilers has tied up … [+1023 chars]"}, {"source": {"id": null, "name": "Freemalaysiatoday.com"}, "author": "AFP", "title": "Samsung shares rise as Huawei struggles", "description": "Huawei, Asia's communication giant will now witness the rise of Samsung as its shares climbs nearly 3%.", "url": "https://www.freemalaysiatoday.com/category/business/2019/05/21/samsung-shares-rise-as-huawei-struggles/", "urlToImage": "https://s3media.freemalaysiatoday.com/wp-content/uploads/2019/05/Huawei-210519-Reuters.jpg", "publishedAt": "2019-05-21T09:00:53Z", "content": "Samsung is rising above Huawei with a climb in its shares. (Reuters pic)\r\nSEOUL: Shares in Samsung Electronics climbed nearly 3% Tuesday on the back of its chief rival Huawei’s mounting problems, including a decision by Google to sever ties with the Chinese m… [+2375 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christopher Elliott, Contributor, Christopher Elliott, Contributor https://www.forbes.com/sites/christopherelliott/", "title": "This Is The Surprising Way Insurance Companies Are Speeding Up Their Claims", "description": "How long does it take for an insurance company to pay out a claim? Weeks, and sometimes months. But now insurance companies are voluntarily speeding up their claims, thanks to new technology and improved procedures.", "url": "https://www.forbes.com/sites/christopherelliott/2019/05/19/insurance-companies-speed-up-claims/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1147712842%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-19T13:31:00Z", "content": "How long does it take for an insurance company to pay out a claim? For John Madden, it took a lot less time than he thought.Madden, a retired Army civilian employee from Troy, Mich., had plans to fly from Detroit to Cleveland earlier this month. When he booke… [+18535 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Health Services Provider Emergencias Deploys Avaya Communications Solutions to Help Save Lives", "description": "SANTA CLARA, Calif.--(BUSINESS WIRE)--Avaya Holdings Corp. (NYSE: AVYA), a leader in communications solutions for the healthcare industry, today announced that Emergencias, an innovative health services provider focused on urgent care, has implemented new Ava…", "url": "https://www.businesswire.com/news/home/20190522005119/en/Health-Services-Provider-Emergencias-Deploys-Avaya-Communications", "urlToImage": "https://mms.businesswire.com/media/20190522005119/en/647287/23/avayargb.jpg", "publishedAt": "2019-05-22T12:08:26Z", "content": "SANTA CLARA, Calif.--(BUSINESS WIRE)--Avaya \r\n Holdings Corp. (NYSE: AVYA), a leader in communications solutions \r\n for the healthcare industry, today announced that Emergencias, \r\n an innovative health services provider focused on urgent care, has \r\n impleme… [+8616 chars]"}, {"source": {"id": null, "name": "Flightglobal.com"}, "author": "David Kaminski-Morrow", "title": "Crashed Superjet's pitch fluctuated before fatal touchdown", "description": "Russian investigators have disclosed that the Sukhoi Superjet 100 involved in a fatal accident at Moscow Sheremetyevo was 1.6t over its maximum landing weight, and experienced two impacts in excess of 5g as it bounced on landing.", "url": "https://www.flightglobal.com/news/articles/crashed-superjets-pitch-fluctuated-before-fatal-tou-458282/", "urlToImage": null, "publishedAt": "2019-05-18T09:36:11Z", "content": "Russian investigators have disclosed that the Sukhoi Superjet 100 involved in a fatal accident at Moscow Sheremetyevo was 1.6t over its maximum landing weight, and experienced two impacts in excess of 5g as it bounced on landing.\r\nThe Interstate Aviation Comm… [+4436 chars]"}, {"source": {"id": null, "name": "Spacewar.com"}, "author": null, "title": "Citadel Defense awarded contract to prevent UAV attacks at sensitive government locations", "description": "San Diego, CA (SPX) May 21, 2019 Commercially available drones are being adapted for nefarious use and can be employed by terrorists and criminals to drop explosive payloads, deliver harmful substances, conduct illicit surveillance, and execute harmful cyber …", "url": "http://www.spacewar.com/reports/Citadel_Defense_awarded_contract_to_prevent_UAV_attacks_at_sensitive_government_locations_999.html", "urlToImage": "http://www.spxdaily.com/images-bg/citadel-defense-titan-counter-drone-system-bg.jpg", "publishedAt": "2019-05-21T05:52:45Z", "content": "Commercially available drones are being adapted for nefarious use and can be employed by terrorists and criminals to drop explosive payloads, deliver harmful substances, conduct illicit surveillance, and execute harmful cyber security attacks on a network.\r\nG… [+5750 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Collective Medical Supports Enhanced Collaboration between Physical and Behavioral Health Providers", "description": "SALT LAKE CITY--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/SDoH?src=hash&quot; target=&quot;_blank&quot;gt;#SDoHlt;/agt;--Collective Medical announces enhanced platform functionality for behavioral health providers", "url": "https://www.businesswire.com/news/home/20190514005281/en/Collective-Medical-Supports-Enhanced-Collaboration-Physical-Behavioral", "urlToImage": "https://mms.businesswire.com/media/20190514005281/en/721460/23/collective_m_logo_full_color.jpg", "publishedAt": "2019-05-14T13:08:17Z", "content": "SALT LAKE CITY--(BUSINESS WIRE)--Collective \r\n Medical, delivering the nations most effective network for care \r\n collaboration, today announced enhanced platform functionality, \r\n including a groundbreaking consent feature, to support better \r\n collaboration… [+4092 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Applied Information and Commsignia Deploy C-V2X Technology at Traffic Signals in Washington, D.C., for ITS America Annual Meeting", "description": "WASHINGTON--(BUSINESS WIRE)-- #CV2X --Applied Information and Commsignia Deploy C-V2X Technology at Traffic Signals in Washington, D.C., for ITS America Annual Meeting", "url": "https://www.businesswire.com/news/home/20190605005543/en/Applied-Information-Commsignia-Deploy-C-V2X-Technology-Traffic", "urlToImage": "https://mms.businesswire.com/media/20190605005543/en/592678/21/applied-information-logo%402x.jpg", "publishedAt": "2019-06-05T13:10:27Z", "content": "WASHINGTON--(BUSINESS WIRE)--Applied \r\n Information, Inc., the leading provider of intelligent \r\n transportation infrastructure technology, and Commsignia today announced \r\n live demonstrations of C-V2X infrastructure communications between \r\n traffic signals… [+3809 chars]"}, {"source": {"id": null, "name": "Globenewswire.com"}, "author": "Energias Market Research", "title": "Growing number of smart cities is likely to increase the demand for Building Automation System Market; to Witness a CAGR of 11.2% during 2019-2025 - GlobeNewswire", "description": "Growing number of smart cities is likely to increase the demand for Building Automation System Market; to Witness a CAGR of 11.2% during 2019-2025 GlobeNewswire NEW YORK, May 28, 2019 (GLOBE NEWSWIRE) -- The global building automation system (BAS) market is p…", "url": "https://globenewswire.com/news-release/2019/05/28/1853198/0/en/Growing-number-of-smart-cities-is-likely-to-increase-the-demand-for-Building-Automation-System-Market-to-Witness-a-CAGR-of-11-2-during-2019-2025.html", "urlToImage": "http://www.globenewswire.com/Attachment/LogoDisplay/489012?filename=489012.jpg&size=1", "publishedAt": "2019-05-28T12:58:00Z", "content": "NEW YORK, May 28, 2019 (GLOBE NEWSWIRE) -- The global building automation system (BAS) market is projected to reach USD 119.23 Billion while experiencing a CAGR of 11.2% during the forecast period. Factors driving the market growth are increasing penetration … [+6161 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Buy Cisco (CSCO) Stock After Earnings Despite China Tariffs & Huawei Concerns?", "description": "Cisco (CSCO) shares surged over 7% in morning trading Thursday on the back of a stronger-than-expected quarterly financial report after the closing bell Wednesday.", "url": "https://finance.yahoo.com/news/buy-cisco-csco-stock-earnings-174805323.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/yD4q8QMViO1NShFcaGw.qg--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/75701a0cb7cb5c2a9a21e2ae671472f5", "publishedAt": "2019-05-16T17:48:05Z", "content": "Cisco CSCO shares surged over 7% in morning trading Thursday on the back of a stronger-than-expected quarterly financial report after the closing bell Wednesday. The maker of switches, routers, and other hardware used to connect computers and communication se… [+5951 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Collective Medical Helps Providers Support and Collaborate on Homeless Patients", "description": "SALT LAKE CITY--(BUSINESS WIRE)-- #SDoH --Collective Medical announces an initiative further enabling hospitals and care teams to support the unique needs of their homeless patients.", "url": "https://www.businesswire.com/news/home/20190604005634/en/Collective-Medical-Helps-Providers-Support-Collaborate-Homeless", "urlToImage": "https://mms.businesswire.com/media/20190604005634/en/725437/23/collective_m_logo_full_color.jpg", "publishedAt": "2019-06-04T13:20:43Z", "content": "SALT LAKE CITY--(BUSINESS WIRE)--Collective \r\n Medical, delivering the nations most effective network for care \r\n collaboration, today announced an initiative further enabling hospitals \r\n and care teams to support the unique needs of their homeless patients.… [+4770 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Tracy Wilkinson", "title": "Mixed signals from U.S. amid flaring tensions with Iran", "description": "With tensions flaring between Washington and Tehran, Trump administration officials on Thursday were broadcasting mixed signals about the road ahead with the Islamic Republic, even as Iran’s regional foes plotted ways to further isolate it. Iran’s principal A…", "url": "https://www.latimes.com/nation/la-na-pol-us-iran-saudi-arabia-bolton-pompeo-trump-20190530-story.html", "urlToImage": "https://www.latimes.com/resizer/oEt3oJ_L_q5Mvy8zY3EzYVXa6YM=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/UYDACUGHBJC7XGRIIWOQH4UBB4.jpg", "publishedAt": "2019-05-30T21:45:00Z", "content": "With tensions flaring between Washington and Tehran, Trump administration officials on Thursday were broadcasting mixed signals about the road ahead with the Islamic Republic, even as Irans regional foes plotted ways to further isolate it.\r\nIrans principal Ar… [+4947 chars]"}, {"source": {"id": null, "name": "Elearningindustry.com"}, "author": "Parija Rangnekar", "title": "How A Mobile App Supports Practice Management", "description": "A Practice Management System in healthcare or mobile health app makes all the operations in a hospital smoother to add value to the patients. There are many hospitals in the market that have already started using a personalized mobile app for themselves. This…", "url": "https://elearningindustry.com/mobile-app-practice-management-supports", "urlToImage": "https://cdn.elearningindustry.com/wp-content/uploads/2019/05/how-a-mobile-app-supports-practice-management.jpg", "publishedAt": "2019-05-26T08:00:45Z", "content": "Managing the patients and staff is the most important part of a hospital. A Practice Management System in healthcare (PMS) can efficiently manage several tasks like booking the appointments for patients, assigning them the respective doctors, paying the bills… [+5578 chars]"}, {"source": {"id": null, "name": "Observer.com"}, "author": "John A. Tures, John A. Tures", "title": "Our New National Emergency: Not Enough College Graduates", "description": "\"By 2020, 65 percent of all jobs—compared to 28 percent in 1973—will require some form of postsecondary education.\"", "url": "https://observer.com/2019/05/college-graduation-rate-drops-american-workforce-economy/", "urlToImage": "https://nyoobserver.files.wordpress.com/2019/05/md-duran-628456-unsplash.jpg?quality=80&w=1200&strip", "publishedAt": "2019-05-17T13:00:22Z", "content": "According to the Census Bureau, 33.4 percent of Americans have a college degree (and that includes retirees, of course). Unsplash/MD Duran\r\nAs I prepare for another college graduation, one of my favorite times of year, finishing grading final exams and projec… [+5133 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "InsightsIAS", "title": "Insights Daily Current Affairs + PIB: 16 May 2019", "description": "Insights Daily Current Affairs + PIB: 16 May 2019 Relevant articles from PIB: Economic Census What to study? Fo Prelims and Mains: What is Economic Census, who conducts and coordinates, uses and significance. Context: The 7th Economic Census -2019 is being co…", "url": "https://www.insightsonindia.com/2019/05/16/insights-daily-current-affairs-pib-16-may-2019/", "urlToImage": null, "publishedAt": "2019-05-16T13:24:53Z", "content": "Insights Daily Current Affairs + PIB: 16 May 2019\r\nRelevant articles from PIB:\r\nEconomic Census\r\nWhat to study?\r\nFo Prelims and Mains: What is Economic Census, who conducts and coordinates, uses and significance.\r\nContext: The 7th Economic Census -2019 is bei… [+14004 chars]"}, {"source": {"id": null, "name": "Nationalinterest.org"}, "author": "Dario Leone", "title": "F-35 Pilot Was Disoriented When His Jet Hit the Water at More Than 683 MPH", "description": "Dario Leone Security, A true tragedy. Japan’s air force said on Jun. 10, 2019 “spatial disorientation” likely caused one of its pilots to fly his F-35 stealth fighters into the Pacific Ocean in April, hitting the water at more than 1,100 kph (683 mph). Accord…", "url": "https://nationalinterest.org/blog/buzz/f-35-pilot-was-disoriented-when-his-jet-hit-water-more-683-mph-61937", "urlToImage": "https://nationalinterest.org/sites/default/files/main_images/190116-F-BQ566-003_0.jpg", "publishedAt": "2019-06-10T11:19:00Z", "content": "Japans air force said on Jun. 10, 2019 spatial disorientation likely caused one of its pilots to fly his F-35 stealth fighters into the Pacific Ocean in April, hitting the water at more than 1,100 kph (683 mph).\r\nAccording to Reuters the Lockheed Martin jet d… [+2151 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Jeremy Howick", "title": "Commentary: Empathy in healthcare is finally making a comeback", "description": "Empathy in healthcare got squeezed out as medicine became more professional and scientific by the 18th century, says Oxford University's Jeremy Howick.", "url": "https://www.channelnewsasia.com/news/commentary/empathy-communication-healthcare-drugs-depression-psychology-11579340", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/8891960/16x9/991/557/2ac2f77320e080c6bb20b465d60f6bd4/hh/electronic-patient-chart-at-kaiser-permanente-medical-center-in-san-diego-1--2-.jpg", "publishedAt": "2019-06-05T22:50:39Z", "content": "OXFORD: A doctor friend lets call her Anne was teaching three smart medical students who were told to diagnose a woman complaining of nonspecific pain and anxiety. \r\nAfter 20 minutes of questions, the students wrote seven pages of notes and recommended two dr… [+11098 chars]"}]}