{"status": "ok", "totalResults": 38736, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "Amrita Khalid", "title": "Firefox's latest privacy updates strengthen tracking protection", "description": "Firefox is rolling out an \"Enhanced Tracking Protection\" feature today that will block a list of over a thousand third-party trackers compiled by Disconnect, an open-source anti-tracking tool. New users of the browser who are downloading it for the first time…", "url": "https://www.engadget.com/2019/06/04/firefoxs-latest-privacy-updates-strengthen-tracking-protection/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-06%252Fd9f066e0-864f-11e9-bbfd-7500e708a418%26client%3Da1acac3e1b3290917d92%26signature%3D90424bac283e33ce8ee7e3002595b670f2a4cd6f&client=amp-blogside-v2&signature=513dab1b26946d16a8e2868b20023ac6f211fa9b", "publishedAt": "2019-06-04T13:00:00Z", "content": "\"We believe that in order to truly protect people, we need to establish a new standard that puts people's privacy first,\" wrote Firefox Senior Vice-President Dave Camp in a blog post. Last fall, Firefox promised it would ramp up its anti-tracking capabilities… [+1333 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "LaLiga’s app listened in on fans to catch bars illegally streaming soccer", "description": "Spain’s data protection agency, the AEPD, has fined the country’s soccer league, LaLiga, €250,000 (about $280,000) for allegedly violating EU data privacy and transparency laws.", "url": "https://www.theverge.com/2019/6/12/18662968/la-liga-app-illegal-soccer-streaming-fine", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MGaCIyuLjcBb5ykFc-U7xgIXrho=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16335743/671946618.jpg.jpg", "publishedAt": "2019-06-12T18:14:02Z", "content": "Photo by Brian Ach/Getty Images for LaLiga\r\nSpains data protection agency has fined the countrys soccer league, LaLiga, 250,000 (about $280,000) for allegedly violating EU data privacy and transparency laws. The app, which is used for keeping track of games a… [+1077 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Australia ABC raids expose lack of whistleblower protection", "description": "Raids over leaked military abuse reports show Australia is \"hostile to those who dob\", say experts.", "url": "https://www.bbc.co.uk/news/world-australia-48537374", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p07c8mbn.jpg", "publishedAt": "2019-06-06T09:36:29Z", "content": "Media captionPolice officers arrived at the Sydney headquarters of Australia's public broadcaster on Wednesday morning\r\nPolice raids this week on an Australian journalist's home and the Australian Broadcasting Corporation have left some people asking whether … [+5946 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert", "title": "Buy Your Dog a Pair of Summer Booties", "description": "If you’re a dog owner in a place with cold or snowy winters, you’re probably used to wrangling your pup into a pair of dog booties to protect their paws from the cold, ice and salt. But those paws need protection from burning hot summer pavement, too. Read mo…", "url": "https://lifehacker.com/buy-your-dog-a-pair-of-summer-booties-1835234383", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--mRYY54ce--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/y1xmekjoxw1va6dkb14g.jpg", "publishedAt": "2019-06-04T19:30:00Z", "content": "If youre a dog owner in a place with cold or snowy winters, youre probably used to wrangling your pup into a pair of dog booties to protect their paws from the cold, ice and salt. But those paws need protection from burning hot summer pavement, too.\r\nReddit u… [+1427 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "LISA FRIEDMAN", "title": "E.P.A. Could Make Thousands of Pollution Deaths Vanish by Changing Its Math", "description": "The Environmental Protection Agency plans to adopt a new method for projecting the future health risks of air pollution that experts have said is not scientifically sound.", "url": "https://www.nytimes.com/2019/05/20/climate/epa-air-pollution-deaths.html", "urlToImage": "https://static01.nyt.com/images/2019/05/20/climate/20CLI-CLEANPOWER1/20CLI-CLEANPOWER1-facebookJumbo.jpg", "publishedAt": "2019-05-20T09:00:10Z", "content": "The Trump administration has moved to repeal the Obama-era plan and replace it with the ACE rule, which would slightly improve the efficiency of coal plants. It would also allow older coal plants to remain in operation longer and result in an increase of part… [+1366 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ZOLAN KANNO-YOUNGS and PATRICIA MAZZEI", "title": "Trump Administration Flying Migrants Out of Texas to Ease Overcrowding at Border", "description": "Migrants, mostly from Central America, in El Paso. Customs and Border Protection officials in April detained 109,144 migrants at the southwest border, the highest total since 2007.", "url": "https://www.nytimes.com/2019/05/17/us/politics/trump-migrants-flights.html", "urlToImage": "https://static01.nyt.com/images/2019/05/17/us/politics/17dc-dhs/17dc-dhs-facebookJumbo.jpg", "publishedAt": "2019-05-18T01:00:29Z", "content": "The flights are the Trump administrations latest attempt to grapple with a surge of Central American families crossing the United States border for asylum. Customs and Border Protection officials in April detained 109,144 migrants at the southwest border, inc… [+1433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Geneva Sands, CNN", "title": "Fifth child dies after arriving at US border from Guatemala since December", "description": "A 16-year-old Guatemalan boy died in government custody Monday morning, Customs and Border Protection said.", "url": "https://www.cnn.com/2019/05/20/politics/migrant-child-dies-in-government-custody/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190402121342-01-el-paso-border-file-super-tease.jpg", "publishedAt": "2019-05-20T16:54:26Z", "content": "(CNN)A 16-year-old Guatemalan boy died in government custody Monday morning, Customs and Border Protection said.\r\nThe boy was apprehended and processed near Hidalgo, Texas, on May 13 before being transferred to the Weslaco Border Patrol Station Sunday, the ag… [+2009 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "JAMES BARRON", "title": "A Gay Theater and James Baldwin’s N.Y. Apartment May Get Landmark Protection", "description": "A building that houses the Lesbian, Gay, Bisexual and Transgender Community Center in Manhattan is one of six sites being considered for landmark status for their role in gay history in New York.", "url": "https://www.nytimes.com/2019/05/15/nyregion/gay-landmarks-nyc-history.html", "urlToImage": "https://static01.nyt.com/images/2019/05/15/nyregion/15nylandmarks1-print/00nylandmarks1-facebookJumbo.jpg", "publishedAt": "2019-05-15T15:43:40Z", "content": "We wanted to explicitly recognize the association with LGBT history, she said. In most cases, the designation of the historic districts in which the buildings already exist did not recognize this history.\r\nSince its start, the commission has expanded its mand… [+1395 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "How To Enable Content Blocking Filters and Privacy Extensions on Firefox 67.0", "description": "Mozilla rolled out several new privacy features for the desktop version of Firefox today, including enhanced tracker protection and content blocking, a password manager, and new optional security extensions. Some of these features will need to be enabled and …", "url": "https://lifehacker.com/how-to-enable-content-blocking-filters-and-privacy-exte-1835242670", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--f4f7PrzM--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zfs3d4pkyt9yuc4opgjd.png", "publishedAt": "2019-06-04T18:30:00Z", "content": "Mozilla rolled out several new privacy features for the desktop version of Firefox today, including enhanced tracker protection and content blocking, a password manager, and new optional security extensions. Some of these features will need to be enabled and … [+4141 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Helene Cooper", "title": "Trump Approves Modest Increase of About 1,500 Troops in the Middle East", "description": "President Trump decided to deploy about 1,500 additional American troops to the Middle East to provide protection for American service members already there, officials said Friday.", "url": "https://www.nytimes.com/2019/05/24/world/middleeast/trump-troop-increase-middle-east-iran.html", "urlToImage": "https://static01.nyt.com/images/2019/05/24/us/politics/24dc-military-sub/24dc-military-sub-facebookJumbo.jpg", "publishedAt": "2019-05-24T16:00:33Z", "content": "WASHINGTON President Trump has decided to deploy about 1,500 additional American troops to the Middle East to provide protection for American service members already there, officials said Friday.\r\nThe Pentagon is expected to make an official announcement late… [+737 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "LaLiga fined $280k for soccer app’s privacy violating spy mode", "description": "Spanish soccer’s premier league, LaLiga, has netted itself a €250,000 (~$280k) fine for privacy violations of Europe’s General Data Protection Regulation (GDPR) related to its official app. As we reported a year ago, users of the LaLiga app were outraged to d…", "url": "http://techcrunch.com/2019/06/12/laliga-fined-280k-for-soccer-apps-privacy-violating-spy-mode/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/Screenshot-2019-06-12-at-10.24.54.png?w=712", "publishedAt": "2019-06-12T10:15:19Z", "content": "Spanish soccer’s premier league, LaLiga, has netted itself a 250,000 (~$280k) fine for privacy violations of Europe’s General Data Protection Regulation (GDPR) related to its official app.\r\nAs we reported a year ago, users of the LaLiga app were outraged to d… [+6060 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "CBP says traveler and license plate images were stolen in data breach", "description": "U.S. Customs and Border Protection has confirmed a data breach has involved the photos of passengers traveling in and out of the United States. The photos were stolen from a subcontractor’s network through a “malicious cyberattack,” a CBP spokesperson told Te…", "url": "http://techcrunch.com/2019/06/10/cbp-data-breach/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-925054932.jpg?w=578", "publishedAt": "2019-06-10T20:20:01Z", "content": "U.S. Customs and Border Protection has confirmed a data breach has involved the photos of passengers traveling in and out of the United States.\r\nThe photos were stolen from a subcontractor’s network through a “malicious cyberattack,” a CBP spokesperson told T… [+1390 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scott Glover, CNN Investigates", "title": "Prosecutors: US Customs supervisor had 'highly suspicious' contact with Chinese officials", "description": "Customs and Border Protection supervisor Wei Xu is charged with unlicensed gun dealing. Agents seized more than 250 guns, including nearly three dozen machine guns. Xu remains behind bars amid questions about his security clearance and ties to China.", "url": "https://www.cnn.com/2019/06/13/us/customs-supervisor-guns-china-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190612153958-20190612-customs-supervisor-guns-china-super-tease.jpg", "publishedAt": "2019-06-13T05:13:34Z", "content": "Los Angeles (CNN)When federal agents raided the Southern California home of US Customs and Border Protection supervisor Wei \"George\" Xu in February, they seized an arsenal of more than 250 weapons, including nearly three dozen illegal machine guns, according … [+247 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Former EPA administrators blast Trump admin on science, regulation rollbacks", "description": "Several former Environmental Protection Agency administrators on Tuesday offered strong rebukes of the Trump administration's approach to environmental policy and commitment to science, saying its handling of the EPA will have negative consequences for Americ…", "url": "https://www.cnn.com/2019/06/11/politics/epa-officials-congressional-testimony/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170905101002-01-epa-03-16-2017-super-tease.jpg", "publishedAt": "2019-06-11T16:33:02Z", "content": "Washington (CNN)Several former Environmental Protection Agency administrators on Tuesday offered strong rebukes of the Trump administration's approach to environmental policy and commitment to science, saying its handling of the EPA will have negative consequ… [+2693 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Melanie Ehrenkranz", "title": "Comcast to Pay Millions After Judge Finds It Illegally Screwed Over Customers 445,000 Times", "description": "Comcast violated the Consumer Protection Act a whopping 445,000 times, a Washington State court ruled on Thursday. The ruling stems from accusations by the state’s attorney general that the telecom giant signed up tens of thousands of customers for a shitty m…", "url": "https://gizmodo.com/comcast-to-pay-millions-after-judge-finds-it-illegally-1835336034", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--xhcgSskK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vspwp1hkumkeojq2rqqw.jpg", "publishedAt": "2019-06-07T21:53:00Z", "content": "Comcast violated the Consumer Protection Act a whopping 445,000 times, a Washington State court ruled on Thursday. The ruling stems from accusations by the states attorney general that the telecom giant signed up tens of thousands of customers for a shitty mo… [+3066 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Jennings Brown", "title": "Popular Soccer App Spied on Fans Through Phone Microphone to Catch Bars Pirating Game Streams", "description": "Spain’s data protection agency has fined La Liga, the nation’s top professional soccer league, 250,000 euros ($283,000 USD) for using the league’s phone app to spy on its fans. With millions of downloads, the app was reportedly being used to surveil bars in a…", "url": "https://gizmodo.com/popular-soccer-app-spied-on-fans-through-phone-micropho-1835448306", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--R4fkoLOM--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/enqoe0futvvkgn2zpbry.jpg", "publishedAt": "2019-06-12T16:10:00Z", "content": "Spains data protection agency has fined La Liga, the nations top professional soccer league, 250,000 euros ($283,000 USD) for using the leagues phone app to spy on its fans. With millions of downloads, the app was reportedly being used to surveil bars in an e… [+2585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "NYT: New EPA technique could limit estimated deaths counted from air pollution", "description": "The Environmental Protection Agency is planning to use a different method to estimate the \"future health risks of air pollution\" in an analysis of a proposed new rule, which could \"drastically\" decrease the projected number of premature deaths from air pollut…", "url": "https://www.cnn.com/2019/05/20/politics/epa-air-pollution-deaths-estimates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/140501131219-03-polluted-cities-0501-story-top.jpg", "publishedAt": "2019-05-20T11:51:02Z", "content": "Washington (CNN)The Environmental Protection Agency is planning to use a different method to estimate the \"future health risks of air pollution\" in an analysis of a proposed new rule, which could \"drastically\" decrease the projected number of premature deaths… [+2098 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Firefox Starts Blocking Third-Party Cookies By Default", "description": "An anonymous reader writes: Mozilla today announced a slew of privacy improvements. The company has turned on Enhanced Tracking Protection, which blocks cookies from third-party trackers in Firefox, by default. Mozilla has also improved its Facebook Container…", "url": "https://news.slashdot.org/story/19/06/04/1636241/firefox-starts-blocking-third-party-cookies-by-default", "urlToImage": "https://a.fsdn.com/sd/topics/firefox_64.png", "publishedAt": "2019-06-04T16:35:00Z", "content": "(Tracking Protection was not turned on by default because it can break websites and cut off revenue streams for content creators who depend on third-party advertising.)\r\nWhy write \"content creators\" instead of perfectly good \"authors\" or \"publishers\"?\r\nAnd wh… [+219 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Kris Holt", "title": "Anti-robocall bill passes almost unanimously in the Senate", "description": "Senators have overwhelmingly backed a bill to combat robocalls. They voted 97-1 to pass the Telephone Robocall Abuse Criminal Enforcement and Deterrence Act, which would empower law enforcement to tackle robocallers, and bump up civil penalties to as much as …", "url": "https://www.engadget.com/2019/05/23/anti-robocall-bill-senate/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D6000%252C4000%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1067%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-05%252F8b41b660-7d86-11e9-bfd7-72bf2e8ea956%26client%3Da1acac3e1b3290917d92%26signature%3Da6be704fc2e02fadccd64c136c104f300ca4d470&client=amp-blogside-v2&signature=90f9acb5a35c8aaf0bd99a53d07fb120aa3da6c0", "publishedAt": "2019-05-23T18:39:00Z", "content": "Despite the introduction of the Do Not Call registry in 2003, robocalls are still plaguing Americans and placing vulnerable members of society at risk of falling victim to scammers. The bill now goes to the House for further consideration -- members of that c… [+763 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "PETER EAVIS", "title": "California Says PG&E Power Lines Caused Fire That Killed 85", "description": "State officials concluded that Pacific Gas & Electric lines caused the Camp Fire, which destroyed the town of Paradise and is the deadliest in state history.", "url": "https://www.nytimes.com/2019/05/15/business/energy-environment/pge-camp-fire-california.html", "urlToImage": "https://static01.nyt.com/images/2019/05/15/business/15utility1/15utility1-facebookJumbo.jpg", "publishedAt": "2019-05-15T21:20:44Z", "content": "Electrical transmission lines belonging to Pacific Gas &amp; Electric caused the Camp Fire of 2018, Californias deadliest wildfire, a state agency concluded on Wednesday.\r\nThe fire, which started on Nov. 8, killed 85 people and destroyed nearly 19,000 homes, … [+530 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "HELENE COOPER and ERIC SCHMITT", "title": "Trump Considering Sending More Troops to Middle East to Protect U.S. Forces There", "description": "The acting defense secretary, who briefed White House officials on the military options, gave no indication of how many troops are under consideration.", "url": "https://www.nytimes.com/2019/05/23/world/middleeast/trump-troops-middle-east-iran.html", "urlToImage": "https://static01.nyt.com/images/2019/05/23/us/politics/23dc-military/23dc-military-facebookJumbo.jpg", "publishedAt": "2019-05-23T18:15:09Z", "content": "WASHINGTON President Trump is considering deploying additional troops to the Middle East to provide protection for American military personnel already there, the acting defense secretary, Patrick Shanahan, said Thursday.\r\nMr. Shanahan did not specify how many… [+774 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Stop Using Homemade Sunscreen Recipes You Found on Pinterest", "description": "Those looking to stay safe from the sun should steer far clear of do-it-yourself sunscreens, a new study out Monday suggests. The study looked at recipes of homemade sunscreens shared on the popular website Pinterest and found these concoctions were woefully …", "url": "https://gizmodo.com/stop-using-homemade-sunscreen-recipes-you-found-on-pint-1834894815", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--EOhLeLCO--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/uqklan12c1vc2xfmexgo.jpg", "publishedAt": "2019-05-20T17:30:00Z", "content": "Those looking to stay safe from the sun should steer far clear of do-it-yourself sunscreens, a new study out Monday suggests. The study looked at recipes of homemade sunscreens shared on the popular website Pinterest and found these concoctions were woefully … [+3991 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lisa Rowan on Two Cents, shared by Lisa Rowan to Lifehacker", "title": "How to Protect Yourself From Overdraft Fees", "description": "Senators Cory Booker and Sherrod Brown are reintroducing a 2018 bill to put an end to banking overdraft fees, Vox reported this week. The Stop Overdraft Profiteering Act would prohibit banks from imposing overdraft fees on debit transactions and from charging…", "url": "https://twocents.lifehacker.com/how-to-protect-yourself-from-overdraft-fees-1834978816", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--GO_Utxly--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vxecvppjtlzrc9nouzu7.jpg", "publishedAt": "2019-05-23T21:00:00Z", "content": "Senators Cory Booker and Sherrod Brown are reintroducing a 2018 bill to put an end to banking overdraft fees, Vox reported this week. The Stop Overdraft Profiteering Act would prohibit banks from imposing overdraft fees on debit transactions and from charging… [+3798 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Melissa Locker", "title": "Of course, opioid drugmaker Insys wants bankruptcy protection", "description": "Insys is the first, but probably not the last, opioid crisis-related bankruptcy. As the states and nations line up to demand answers and compensation for the opioid crisis, the first opioid manufacturer has declared bankruptcy. Read Full Story", "url": "https://www.fastcompany.com/90361920/opioid-maker-insys-therapeutics-wants-bankruptcy-protection?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/p-1-opioid-drugmaker-insys-therapeutics-files-for-bankruptcy-to-avoid-paying.jpg", "publishedAt": "2019-06-10T12:30:35Z", "content": "As the states and nations line up to demand answers and compensation for the opioid crisis, the first opioid manufacturer has declared bankruptcy.Drugmaker Insys Therapeutics Inc. filed for Chapter 11 bankruptcy protection on Monday, Reuters reports. The fili… [+1383 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Vanessa Romo", "title": "Administration Cuts Education And Legal Services For Unaccompanied Minors", "description": "The Office of Refugee Resettlement is telling migrant shelters to scale back on activities that are \"not directly necessary for the protection of life and safety.\"", "url": "https://www.npr.org/2019/06/05/730082911/administration-cuts-education-and-legal-services-for-unaccompanied-minors", "urlToImage": "https://media.npr.org/assets/img/2019/06/05/gettyimages-977311942_wide-64b7b392d0adb6d6a8e751c02c914aa8bd456a90.jpg?s=1400", "publishedAt": "2019-06-05T22:07:42Z", "content": "The Southwest Key-Casa Padre Facility, formerly a Walmart store, in Brownsville, Texas. It is one of more than 150 federally contracted shelters for unaccompanied minors that will lose educational and legal programs as a result of the mandate by Health and Hu… [+4033 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ZOLAN KANNO-YOUNGS", "title": "Guatemalan Teenager Dies at Border Station While Awaiting Move to Shelter", "description": "Migrants waiting to cross the McAllen-Hidalgo International Bridge into the United States. A 16-year-old boy was found dead on Monday at a Border Patrol station in Hidalgo, Texas.", "url": "https://www.nytimes.com/2019/05/20/us/politics/migrant-death-border.html", "urlToImage": "https://static01.nyt.com/images/2019/05/20/us/politics/20dc-dhs/merlin_148424394_27ec6096-712e-4ecd-a54b-8f2b347350ec-facebookJumbo.jpg", "publishedAt": "2019-05-20T18:59:12Z", "content": "The boy who died on Monday had entered the United States near the border town of Hidalgo, Tex., on May 13. He was held in a processing center in the agencys Rio Grande Valley sector until Sunday, when he was moved to a Border Patrol station in the city of Wes… [+1084 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-Youngs", "title": "Images of Travelers Stolen in Cyberattack on Border Agency", "description": "The government said tens of thousands of images of travelers and license plates had been hacked after they were transferred without authorization to a subcontractor.", "url": "https://www.nytimes.com/2019/06/10/us/politics/customs-data-breach.html", "urlToImage": "https://static01.nyt.com/images/2019/06/10/us/politics/10dc-breach/10dc-breach-facebookJumbo.jpg", "publishedAt": "2019-06-10T22:00:05Z", "content": "As of today, none of the image data has been identified on the dark web or internet, the Customs and Border Protection agency said in a statement.\r\nThat may not be surprising. If the images were stolen for intelligence purposes, they would not be expected to … [+939 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "Facebook fails to stop Europe’s top court weighing in on EU-US data transfers", "description": "Facebook has failed in its last ditch attempt to block a referral by Ireland’s High Court of questions over the legality of EU-US data transfer mechanisms to the region’s top court. Ireland’s Supreme Court unanimously refused its request to appeal the decisio…", "url": "http://techcrunch.com/2019/06/04/facebook-fails-to-stop-europes-top-court-weighing-in-on-eu-us-data-transfers/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/04/gettyimages-944718240.jpeg?w=600", "publishedAt": "2019-06-04T14:17:23Z", "content": "Facebook has failed in its last ditch attempt to block a referral by Ireland’s High Court of questions over the legality of EU-US data transfer mechanisms to the region’s top court.\r\nIreland’s Supreme Court unanimously refused its request to appeal the decisi… [+5406 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Richard Lawler", "title": "Google stats show how much a recovery number prevents phishing", "description": "In case you haven't already set up a recovery phone number for your Google account, and enabled extra security features like multifactor authentication, the search giant is using hard data to explain why you should. Interestingly, studies ( 1 )( 2 ) researche…", "url": "https://www.engadget.com/2019/05/18/phishing-google-advanced-security-2fa/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fmedia-mbst-pub-ue1.s3.amazonaws.com%2Fcreatr-uploaded-images%2F2019-05%2F1c9dc500-7935-11e9-bfdb-e0f5c57cb373&client=amp-blogside-v2&signature=c0a6759669294e96a0ca27d9018bf2c10ca98aad", "publishedAt": "2019-05-19T00:09:00Z", "content": "While SMS verification can be defeated by a targeted attack, Google's ability to do things like send a prompt to a connected phone or have users verify where they last log in also help block sign-ins it thinks are suspicious. If you're logging in on a brand n… [+1145 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Christine Fisher", "title": "Senators ask the FCC to limit 5G auction to protect weather forecasts", "description": "In March, the Federal Communications Commission (FCC) began auctioning blocks of the 24 GHz spectrum, which could be used to implement future 5G networks. Shortly afterward, the US Navy released a memo warning that 5G in the 24 GHz band could interfere with w…", "url": "https://www.engadget.com/2019/05/15/fcc-5g-spectrum-auction-senator-concerns/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D2232%252C1437%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1030%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-05%252F7f86c350-772e-11e9-bfff-a29e17fccdcc%26client%3Da1acac3e1b3290917d92%26signature%3D8f80b6073e1c0748f83dc81e9f608892f52de8c4&client=amp-blogside-v2&signature=f86eb445a443cea8ca85628138c5c5dc73f8bc00", "publishedAt": "2019-05-15T17:28:00Z", "content": "The concern raised in the original Navy memo is that weather forecasts could be lost or degraded due to interference from 5G operating in the 24 GHz band. As the memo explains, the Navy relies on forecasts from NOAA and NASA that use remote sensing in the 23.… [+1084 chars]"}, {"source": {"id": null, "name": "Dailyhive.com"}, "author": "Daily Hive Staff", "title": "New Canadian Air Passenger Protection Regulations come into effect this summer - Daily Hive", "description": "New Canadian Air Passenger Protection Regulations come into effect this summer Daily Hive New air passenger rights land mid-July, more follow at Christmas CTV News Federal government announces new rules on airline passenger protection, compensation CBC News M…", "url": "https://dailyhive.com/vancouver/air-passenger-protection-regulations-canada-2019", "urlToImage": "https://images.dailyhive.com/20180814105209/Toronto-pearson-airport.jpg", "publishedAt": "2019-05-24T15:28:00Z", "content": "Canadian air passengers will soon have new regulations that protect their rights.\r\nAccording to the Canadian Transportation Agency (CTA), the Air Passenger Protection Regulations are now finalized and will come into effect in two stages.\r\nStarting this summer… [+2479 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Ara Wagoner", "title": "Help one-up your OnePlus 7 Pro with these accessories", "description": "The OnePlus 7 Pro finally here and they were totally worth the wait. Whether you're in love with the all-screen display, find the new or you're just in love with OnePlus's approach to software — I know I certainly am — your new OnePlus 7 is going to be great,…", "url": "https://www.androidcentral.com/best-oneplus-7-pro-accessories", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/oneplus-7-pro-11_0.jpg?itok=jW3M8EbO", "publishedAt": "2019-05-14T16:00:03Z", "content": "The OnePlus 7 Pro finally here and they were totally worth the wait. Whether you're in love with the all-screen display, find the new or you're just in love with OnePlus's approach to software — I know I certainly am — your new OnePlus 7 is going to be great,… [+3783 chars]"}, {"source": {"id": null, "name": "Greenentrepreneur.com"}, "author": "dispensaries.com", "title": "Most States Provide No Legal Protection If You're Fired for Using Medical Marijuana", "description": "There are 33 states where medical marijuana is legal but only 13 where you have recourse if you're fired for it.", "url": "https://www.greenentrepreneur.com/article/334167", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190523190635-GettyImages-1070990852-crop.jpeg", "publishedAt": "2019-05-28T12:00:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nThe idea of states’ rights is what opened the door to marijuana legalization around the country. But here’s the thing about states’ rights for both employees and employers: You better know exactl… [+3657 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Joseph Green", "title": "Surf more safely with up to £50 off Norton antivirus services", "description": "The online world is a weird and wonderful place. It can also be a dangerous place, if you're not protected. Thankfully, there are a wide range of services out there that can help you to surf, bank, and shop more safely online. Norton Security has a number of …", "url": "https://mashable.com/uk/shopping/best-deal-norton-security-plan-june-2/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F02%252Fb2%252Ff9564720522f42f8bc18ab4fe2bbd583.ade6c.png%252F1200x630.png?signature=DL189d9c3mlSZJEpDqS9VD2NnO0=", "publishedAt": "2019-06-02T06:00:00Z", "content": "The online world is a weird and wonderful place. It can also be a dangerous place, if you're not protected. Thankfully, there are a wide range of services out there that can help you to surf, bank, and shop more safely online.\r\nNorton Security has a number of… [+779 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ZOLAN KANNO-YOUNGS", "title": "Guatemalan Teenager Dies at Border Station While Awaiting Move to Shelter", "description": "Migrants waiting to cross the McAllen-Hidalgo International Bridge into the United States. A 16-year-old boy was found dead on Monday at a Border Patrol station in Hidalgo, Tex.", "url": "https://www.nytimes.com/2019/05/20/us/politics/migrant-boy-dies.html", "urlToImage": "https://static01.nyt.com/images/2019/05/20/us/politics/20dc-dhs/merlin_148424394_27ec6096-712e-4ecd-a54b-8f2b347350ec-facebookJumbo.jpg", "publishedAt": "2019-05-20T18:59:12Z", "content": "The boy who died on Monday had entered the United States near the border town of Hidalgo, Tex., on May 13. He was held in a processing center in the agencys Rio Grande Valley sector until Sunday, when he was moved to a Border Patrol station in the city of Wes… [+1084 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Melanie Ehrenkranz", "title": "New Bill Would Require Agents to Actually Have Probable Cause to Search Electronic Devices at the Border", "description": "Customs officials at the border don’t need a warrant or probable cause to search your electronic devices, an invasive practice that has only spiked in the last few years, resulting in a bunch of horror stories and some profoundly dumb screwups. But two US sen…", "url": "https://gizmodo.com/new-bill-would-require-agents-to-actually-have-probable-1834960457", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--rOTQtA17--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ldyqi9sjpd6d2ayfozmn.jpg", "publishedAt": "2019-05-22T22:00:00Z", "content": "Customs officials at the border dont need a warrant or probable cause to search your electronic devices, an invasive practice that has only spiked in the last few years, resulting in a bunch of horror stories and some profoundly dumb screwups. But two US sena… [+1712 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "Police are investigating reports of a shooting at a vehicle inspection site at US-Mexico border", "description": "Law enforcement officers are investigating reports of a shooting that involved a US Customs and Border Protection agent at a vehicle inspection section of the San Ysidro Point of Entry in southern California, according to local news reports. The San Diego Pol…", "url": "https://www.businessinsider.com/san-ysidro-shooting-border-patrol-point-of-entry-mexico2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf5f02e11e2052ec5306cc3-1536-768.jpg", "publishedAt": "2019-06-04T05:13:29Z", "content": "Law enforcement officers are investigating reports of a shooting that involved a US Customs and Border Protection agent at a vehicle inspection section of the San Ysidro Point of Entry in southern California, according to local news reports. \r\n The San Diego … [+240 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "DJ Pangburn", "title": "Finally, child data privacy could get much-needed reform in new bill", "description": "The Children’s Online Privacy Protection Act, which was passed decades ago, could finally see a long-overdue update for an era in which social media and IoT devices present new risks. In the early days of the internet, the U.S. government passed The Children’…", "url": "https://www.fastcompany.com/90352062/finally-child-data-privacy-could-get-much-needed-reform-in-new-bill?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-finally-child-data-privacy-could-get-much-needed-reform-in-new-bill.jpg", "publishedAt": "2019-05-18T09:00:46Z", "content": "In the early days of the internet, the U.S. government passed The Children’s Online Privacy Protection Act (COPPA). Its flaws–the ease with which children can fake their age, and no protection against ads–have only become more glaring over 20 years later, wit… [+5692 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "U.S. Customs and Border Protection Says Traveler Images Exposed in Cyberattack", "description": "The U.S. Customs and Border Protection service says images of travelers have been exposed in a malicious cyberattack.", "url": "https://time.com/5604341/us-customs-traveler-images-cyberattack/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/gettyimages-1139361624.jpg?quality=85", "publishedAt": "2019-06-10T22:16:12Z", "content": "WASHINGTON — The U.S. Customs and Border Protection service says images of travelers — which it presumably collected at points of entry — have been exposed in a malicious cyberattack.\r\nThe federal agency said Monday that license plate images were also exposed… [+521 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Google's Ad System Under EU Probe For How It Spreads Your Private Data", "description": "Ireland's data protection watchdog has launched an investigation into Google's collection of personal data for the purpose of online advertising. From a report: \"A statutory inquiry pursuant to section 110 of the Data Protection Act 2018 has been commenced in…", "url": "https://tech.slashdot.org/story/19/05/22/1956227/googles-ad-system-under-eu-probe-for-how-it-spreads-your-private-data", "urlToImage": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif", "publishedAt": "2019-05-22T20:00:00Z", "content": "\"A statutory inquiry pursuant to section 110 of the Data Protection Act 2018 has been commenced in respect of Google Ireland Limited's processing of personal data in the context of its online Ad Exchange,\" the Data Protection Commission said in a statement We… [+1003 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia / Hong Kong", "title": "Two Hong Kong Activists Were Granted Asylum in Germany, Calling the City’s Freedoms Into Question", "description": "Ray Wong and Alan Li say they are under refugee protection, two years after disappearing from Hong Kong after facing charges for rioting", "url": "http://time.com/5593267/hong-kong-activists-asylum-germany/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/hong-kong-2016-riots.jpg?quality=85", "publishedAt": "2019-05-22T04:03:07Z", "content": "Two years after their quiet departure from Hong Kong, two political activists from the semiautonomous region of China have come forward to say that they are under refugee protection in Germany.\r\nRay Wong, 25, and Alan Li, 27, faced rioting charges for their r… [+3228 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Associated Press", "title": "Caster Semenya Can Race After Swiss Court Ruling", "description": "Semenya won an interim ruling and for now will be able to run in her favorite 800-meter event without taking any hormone suppressing medication.", "url": "https://www.nytimes.com/2019/06/03/sports/caster-semenya.html", "urlToImage": "https://static01.nyt.com/images/2019/06/03/sports/03semenyaWEB1/03semenyaWEB1-facebookJumbo.jpg", "publishedAt": "2019-06-03T18:13:04Z", "content": "The full appeal against a decision by the Court of Arbitration for Sport could take up to a year or more to be heard by the supreme court, which is also known as the Swiss Federal Tribunal.\r\nThat full appeal will be heard by a panel of Swiss federal judges.\r\n… [+662 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Password manager Dashlane raises $110M in Series D, adds CMO", "description": "Password manager maker Dashlane has raised $110 million in its latest round of funding, the company said Thursday. The company said Sequoia Capital led the Series D round, with partner Jim Goetz joining the board. Dashlane also said former Lyft executive Joy …", "url": "http://techcrunch.com/2019/05/30/dashlane-series-d/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/dashlane.jpg?w=600", "publishedAt": "2019-05-30T16:27:48Z", "content": "Password manager maker Dashlane has raised $110 million in its latest round of funding, the company said Thursday.\r\nThe company said Sequoia Capital led the Series D round, with partner Jim Goetz joining the board. Dashlane also said Lyft executive Joy Howard… [+1226 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Amazon revamps Echo Dot Kids Edition and FreeTime", "description": "Announced in April of last year, the Echo Dot Kids Edition got something of a mixed reception, primarily due to privacy concerns surrounding the broader smart speaker category. Amazon is back with a version of the $70 device. Design-wise, the product looks li…", "url": "http://techcrunch.com/2019/06/12/amazon-revamps-echo-dot-kids-edition-and-freetime/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/Echo-Dot-Kids-Edition-Playroom.jpg?w=594", "publishedAt": "2019-06-12T13:02:36Z", "content": "Announced in April of last year, the Echo Dot Kids Edition got something of a mixed reception, primarily due to privacy concerns surrounding the broader smart speaker category. Amazon is back with a version of the $70 device.\r\nDesign-wise, the product looks l… [+1273 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Mark Frauenfelder", "title": "Comcast broke law 450,000 times trying to bilk customers", "description": "Ars Technica reports that a judge ordered Comcast to pay a $9.1 milion fine and refund 50,000 customers it tricked into subscribing to a worthless \"protection plan.\" Washington State Attorney General Bob Ferguson sued Comcast in August 2016, accusing the nati…", "url": "https://boingboing.net/2019/06/07/comcast-broke-aw-450000-times.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/06/shutterstock_1200405379-1.jpg", "publishedAt": "2019-06-07T19:41:55Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "EU-US Privacy Shield complaint to be heard by Europe’s top court in July", "description": "A legal challenge to the EU-US Privacy Shield, a mechanism used by thousands of companies to authorize data transfers from the European Union to the US, will be heard by Europe’s top court this summer. The General Court of the EU has set a date of July 1 and …", "url": "http://techcrunch.com/2019/05/28/eu-us-privacy-shield-complaint-to-be-heard-by-europes-top-court-in-july/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2015/10/shutterstock_1415258531.jpg?w=533", "publishedAt": "2019-05-28T10:24:39Z", "content": "A legal challenge to the EU-US Privacy Shield, a mechanism used by thousands of companies to authorize data transfers from the European Union to the US, will be heard by Europe’s top court this summer.\r\nThe General Court of the EU has set a date of July 1 and… [+4100 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Canada zoo owner charged with animal cruelty", "description": "Lions, tigers, zebras, bears, kangaroos and wolves are among the animals seized for relocation.", "url": "https://www.bbc.co.uk/news/world-us-canada-48274417", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/4A8F/production/_106978091_1-hsus_photo_481830.jpg", "publishedAt": "2019-05-21T20:14:20Z", "content": "Image copyrightHumane Society International Image caption\r\n A lion in an enclosure at a Quebec zoo\r\nA Canadian zoo owner has been charged with criminal animal cruelty and the animals on the premises are being seized by authorities. \r\nThe owner of the St-Édoua… [+1801 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Majority in Brazil's top court to make homophobia and transphobia crimes", "description": "Six out of 11 judges vote in favour of making homophobia and transphobia equivalent to racism.", "url": "https://www.bbc.co.uk/news/world-latin-america-48391926", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11F7E/production/_107089537_gettyimages-966543994.jpg", "publishedAt": "2019-05-24T02:05:12Z", "content": "Image copyrightGetty ImagesImage caption\r\n The decision will give real protection to gays and transgender people, activists say (file photo)\r\nA majority in Brazil's Supreme Court has voted in favour of making homophobia and transphobia crimes. \r\nSix out of 11… [+1736 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "The pistachios that need police protection", "description": "In Sicily, police are moving to stop criminals stealing the island's pistachios ahead of this year's harvest.", "url": "https://www.bbc.co.uk/news/business-48266510", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/C0CC/production/_106965394_gettyimages-957750918.jpg", "publishedAt": "2019-05-15T23:07:14Z", "content": "Image copyrightGetty ImagesImage caption\r\n The red outer layer of pistacchio verde di Bronte covers a bright green interior\r\nPolice captain Nicolo Morandi says that he and his colleagues are already preparing for September.\r\nAt least six officers are going to… [+6029 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Nicole Einbinder", "title": "People think Queen Elizabeth II shaded Trump by wearing a tiara that’s a ‘symbol of protection against illness and evil’", "description": "Queen Elizabeth II wore a Burmese Ruby Tiara that guards the wearer \"not only against illness, but also against evil,\" while hosting President Donald Trump during his United Kingdom visit. Twitter users were quick to make assumptions about why the queen opted…", "url": "https://www.insider.com/queen-elizabeth-shaded-trump-tiara-symbol-protection-against-illness-evil-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf684d74cf2703d9d6fe7bd-2732-1366.jpg", "publishedAt": "2019-06-04T14:48:23Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "US could send more troops to Mideast: Pentagon chief", "description": "The United States said Thursday it was considering deploying more troops to the Middle East as it looks for ways to enhance the protection of its forces in the turbulent region amid simmering tensions with Iran. \"What we're looking at, are there things that w…", "url": "https://news.yahoo.com/us-could-send-more-troops-mideast-pentagon-chief-205909011.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-23T20:59:09Z", "content": "Washington (AFP) - The United States said Thursday it was considering deploying more troops to the Middle East as it looks for ways to enhance the protection of its forces in the turbulent region amid simmering tensions with Iran.\r\nBut acting Defense Secretar… [+2156 chars]"}, {"source": {"id": null, "name": "Hubspot.com"}, "author": "jdick@hubspot.com (Jon Dick)", "title": "The General Data Protection Regulation: One Year Later", "description": "One year ago on May 25, 2018, the General Data Protection Regulation (GDPR) went into effect and replaced the 1995 EU Data Protection Directive (DPD) with the goal of significantly enhancing the protection of the personal data of E.U. citizens and increasing …", "url": "https://blog.hubspot.com/marketing/general-data-protection-regulation-consumer-attitudes", "urlToImage": "https://blog.hubspot.com/hubfs/gdpr-2019.jpg#keepProtocol", "publishedAt": "2019-05-20T11:00:00Z", "content": "One year ago on May 25, 2018, the General Data Protection Regulation (GDPR) went into effect and replaced the 1995 EU Data Protection Directive (DPD) with the goal of significantly enhancing the protection of the personal data of E.U. citizens and increasing … [+5637 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Joe Maring", "title": "This is the best thin case you can buy for the Galaxy S10", "description": "Still one of the best thin cases out there. If you're like me, you despise big, bulky cases. They're great for people that are rough on their phones, but for those of us that just want some basic protection without turning our devices into meatballs, they're …", "url": "https://www.androidcentral.com/samsung-galaxy-s10-totallee-case-review", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/totallee-galaxy-s10-case-review-4.jpg?itok=Sq3la0r-", "publishedAt": "2019-06-01T17:00:02Z", "content": "If you're like me, you despise big, bulky cases. They're great for people that are rough on their phones, but for those of us that just want some basic protection without turning our devices into meatballs, they're kind of the worst.\r\nThe Totallee Thin Case i… [+3681 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Former Planned Parenthood executive slams Alabama abortion restrictions: ‘Women are watching’", "description": "Former Planned Parenthood president and CEO Cecile Richards has a message for politicians cheering the passage of the Alabama Human Life Protection Act: “Women are watching.”", "url": "https://news.yahoo.com/former-planned-parenthood-executive-slams-alabama-abortion-restrictions-women-are-watching-231707262.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jGOYCLoBu.bBxUcmHALQFA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-05/1c54b950-781d-11e9-ae83-8d1422b9d0fe", "publishedAt": "2019-05-16T23:17:07Z", "content": "Through Her Eyes is a weekly show hosted by human rights activist Zainab Salbi that explores contemporary news issues from a female perspective. You can watch the full episode of Through Her Eyes every Tuesday at 8 p.m. ET on Roku.\r\nFormer Planned Parenthood … [+2923 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "Bolster Your Home Security With This New Alexa Feature", "description": "We normally bring up AI assistants and smart speakers in the context of keeping your conversations and home life separate from the vigilant ears of these digital helpers (and those who may be listening in) but it turns out, they can serve as security measures…", "url": "https://lifehacker.com/bolster-your-home-security-with-this-new-alexa-feature-1834750032", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--dsiWYL6T--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/c2iehaflvuppoxxxcfem.jpg", "publishedAt": "2019-05-14T17:00:00Z", "content": "We normally bring up AI assistants and smart speakers in the context of keeping your conversations and home life separate from the vigilant ears of these digital helpers (and those who may be listening in) but it turns out, they can serve as security measures… [+2006 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "A Photo Agency Took Photos of Prince Harry’s Bedroom From a Helicopter. It’s Now Paid Him “Substantial Damages”", "description": "Prince Harry settled privacy and data protection claims against a news agency that hovered over his home in a helicopter and took photos.", "url": "http://time.com/5590470/prince-harry-invasive-photos-damages-apology/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/prince-harry-splash-photo-damages.jpg?quality=85", "publishedAt": "2019-05-16T16:52:51Z", "content": "(LONDON) — Prince Harry settled privacy and data protection claims Thursday against a news agency that hovered over his home in a helicopter and took photos directly into his living room and bedroom.\r\nHarry accepted substantial damages and an apology from Spl… [+1545 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Body of Young Girl Believed to Be From India Found in Remote Arizona Wilderness Near U.S. Border", "description": "The body of a young girl was found near the U.S.-Mexico border in Arizona Thursday morning, according to U.S. Customs and Border Protection.", "url": "https://time.com/5607019/body-young-girl-border/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/04/u.s.-mexico-border-fence-militia.jpg?quality=85", "publishedAt": "2019-06-14T00:42:41Z", "content": "The body of a young girl was found in a remote area near the U.S.-Mexico border in Arizona on Wednesday, according to U.S. Customs and Border Protection (CBP).\r\nOfficials said in a press release that they believe the child was a 7-year-old citizen of India wh… [+1033 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Trade bulk for ultra-slim protection with iPhone cases made of real body armor", "description": "Cases that actually do a good job protecting your iPhone don't have to be bulky. In fact, you'll be shocked at how slim and sleek the Pitaka MagCase is for Apple's latest iPhone models. This awesome case is available for the iPhone XS Max, iPhone XS, and iPho…", "url": "https://news.yahoo.com/trade-bulk-ultra-slim-protection-160704574.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-22T16:07:04Z", "content": "Cases that actually do a good job protecting your iPhone dont have to be bulky. In fact, youll be shocked at how slim and sleek the Pitaka MagCase is for Apples latest iPhone models. This awesome case is available for the iPhone XS Max, iPhone XS, and iPhone … [+2156 chars]"}, {"source": {"id": null, "name": "Uncrate.com"}, "author": "Uncrate", "title": "United Protection Dogs", "description": "Dogs can offer more than companionship - they can also offer protection. United Protection Dogs trains dogs for precisely this purpose. Unlike many competing services, their training is customized to fit your needs, whether you need a family guardian or...", "url": "https://uncrate.com/united-protection-dogs/", "urlToImage": "https://uncrate.com/p/2019/06/united-protection-dogs.jpg", "publishedAt": "2019-06-12T18:10:33Z", "content": null}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Mobile Chrome, Safari and Firefox Failed To Show Phishing Warnings For More Than a Year", "description": "An anonymous reader writes: For more than a year, mobile browsers like Google Chrome, Firefox, and Safari failed to show any phishing warnings to users, according to a research paper published this week. \"We identified a gaping hole in the protection of top m…", "url": "https://news.slashdot.org/story/19/05/24/1638219/mobile-chrome-safari-and-firefox-failed-to-show-phishing-warnings-for-more-than-a-year", "urlToImage": "https://a.fsdn.com/sd/topics/chrome_64.png", "publishedAt": "2019-05-24T16:40:00Z", "content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."}, {"source": {"id": null, "name": "Slashdot.org"}, "author": "msmash", "title": "Lessons From 5 Years of Free Cybersecurity For At-Risk Groups", "description": "Cloudflare's Project Galileo, which offers free high-tier DDoS protection service to journalists, dissidents, civil liberties groups and other at-risk groups, turned 5 years old this week. From a report: The project currently serves over 600 accounts. An LGBT…", "url": "https://tech.slashdot.org/story/19/06/13/1931212/lessons-from-5-years-of-free-cybersecurity-for-at-risk-groups", "urlToImage": "https://a.fsdn.com/sd/topics/security_64.png", "publishedAt": "2019-06-13T19:31:00Z", "content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Homeland Security’s Jeanette Manfra is coming to Disrupt SF", "description": "We can’t talk cybersecurity without hearing from the government. We’re thrilled to announce Homeland Security Assistant Director Jeanette Manfra, a senior executive at the department’s Cybersecurity and Infrastructure Security Agency (CISA), will be at Disrup…", "url": "http://techcrunch.com/2019/06/12/jeanette-manfra-disrupt-sf/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/Screen-Shot-2019-06-12-at-9.11.39-AM.png?w=552", "publishedAt": "2019-06-12T16:05:09Z", "content": "We can’t talk cybersecurity without hearing from the government.\r\nWe’re thrilled to announce Homeland Security Assistant Director Jeanette Manfra, a senior executive at the department’s Cybersecurity and Infrastructure Security Agency (CISA), will be at Disru… [+1589 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Richard Lawler", "title": "Install updates now to address a vulnerability in most Intel CPUs", "description": "In January 2018, a pair of security exploits dubbed Spectre and Meltdown showed how attackers could take advantage of commonly-implemented CPU technology to access data they shouldn't have been able to. They were followed by a similar bug, Foreshadow, late la…", "url": "https://www.engadget.com/2019/05/15/intel-mds-exploit/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D7359%252C4912%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1068%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-05%252Fe79a2310-76d9-11e9-b9bf-423eea09f390%26client%3Da1acac3e1b3290917d92%26signature%3D593f4050c97a08e41295595ed83e949dcbb2b36a&client=amp-blogside-v2&signature=a39510736244d3325f1cb1eef6ad8fafb2894de6", "publishedAt": "2019-05-15T06:40:00Z", "content": "In January 2018, a pair of security exploits dubbed Spectre and Meltdown showed how attackers could take advantage of commonly-implemented CPU technology to access data they shouldn't have been able to. They were followed by a similar bug, Foreshadow, late la… [+628 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Nicole Lee", "title": "Amazon's updated Echo Dot for kids is louder and more colorful", "description": "Last year, Amazon unveiled a child-friendly version of its affordable Echo Dot, which came in bright primary colors, offered age-appropriate content and parental controls. Today, the company is announcing a brand new version of the Echo Dot Kids Edition for $…", "url": "https://www.engadget.com/2019/06/12/amazon-echo-dot-kids-edition-freetime-2019/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-06%252F71947e00-8c9a-11e9-adf7-5f843c806b5f%26client%3Da1acac3e1b3290917d92%26signature%3Dae73e80629497c5ad1037277c4cfd090b943a09a&client=amp-blogside-v2&signature=0c1580382587add64b7c84fff3d4eb13b9580f24", "publishedAt": "2019-06-12T13:00:00Z", "content": "The 2019 Echo Dot Kids Edition isn't too different from its predecessor, as it has the same basic form factor. It does, however, now come in new colors such as Rainbow and Frost Blue. According to Amazon, the new Echo Dot Kids Edition will also be 70 percent … [+1933 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Amrita Khalid", "title": "La Liga fined €250k for using its app to catch illegal soccer streams", "description": "Spanish soccer league La Liga has been fined for inappropriately using its app to catch illegal streaming. The Spanish data protection agency charged La Liga with a fine of 250 thousand euros for violating several EU laws on transparency and data privacy, and…", "url": "https://www.engadget.com/2019/06/11/la-liga-fined-250k-for-using-its-app-to-catch-illegal-soccer-streams/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-06%252F37945030-8ca5-11e9-bd7f-9738d2bd6888%26client%3Da1acac3e1b3290917d92%26signature%3Db0951d1d36dbbe0a44ab7337377947bc6f10f3ac&client=amp-blogside-v2&signature=81f4c08e30abf1645bac9294cdebeec91a4b42fa", "publishedAt": "2019-06-12T03:03:00Z", "content": "La Liga in a statement to El País (translated from Spanish) expressed disappointment in the decision and accused regulators of not properly understanding the technology involved. The soccer league argued that users were asked twice by the app for their consen… [+446 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "A hammer started the largest wildfire in California history", "description": "410,203 acres burned. Last summer, the Ranch Fire — which was part of a greater complex of fires — ripped through Northern California, smashing the previous, short-lived record for the largest wildfire in state history by some 128,000 acres. And it all starte…", "url": "https://mashable.com/article/california-ranch-fire-hammer/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F06%252F2b%252Fb9d9829fb3884b619f789e751922202c.e8266.jpg%252F1200x630.jpg?signature=G93zzorDZ42RcUiMFv7VuvbubmI=", "publishedAt": "2019-06-06T21:31:01Z", "content": "410,203 acres burned.\r\nLast summer, the Ranch Fire which was part of a greater complex of fires ripped through Northern California, smashing the previous, short-lived record for the largest wildfire in state history by some 128,000 acres.\r\nAnd it all started … [+2513 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Andy Campbell", "title": "Abortions In Alabama Would Carry Harsher Penalties Than Many Sex Crimes", "description": "Alabama's Human Life Protection Act would make it a felony to perform abortions, even in cases involving incest -- a crime with a lesser penalty.", "url": "https://www.huffpost.com/entry/in-alabama-performing-abortions-would-carry-harsher-penalties-than-many-sex-crimes_n_5cdc1467e4b061f71b88d11e", "urlToImage": "https://img.huffingtonpost.com/asset/5cdb8b5724000032007efecc.jpeg?cache=9jEWj3CKAn&ops=1200_630", "publishedAt": "2019-05-15T15:38:12Z", "content": "The Alabama abortion bill that passed the state Senate on Tuesday night would make performing an abortion punishable by up to 99 years in prison a penalty more severe than for some sex crimes that might result in an unwanted pregnancy, including incest.\r\nThe … [+2094 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Julian Shen-Berro", "title": "Debate Over Gun ‘Silencers’ Resurfaces Following Virginia Beach Shooting", "description": "Opponents note silencers make it harder for potential victims and police to identify gunshots. Pro-gun advocates say they’re important hearing protection.", "url": "https://www.huffpost.com/entry/gun-silencer-debate-virginia-beach_n_5cf5705ce4b0e346ce82cbe4", "urlToImage": "https://img.huffingtonpost.com/asset/5cf7c4fe210000690de699dd.jpeg?cache=iixobnhywl&ops=1910_1000", "publishedAt": "2019-06-05T16:04:08Z", "content": "The mass shooting in Virginia Beach last week has reinvigorated the debate over the regulation of gun suppressors also known as silencers which muffle the sounds of gunfire.\r\nThe shooter behind the attack, which left 12 people dead on Friday, used a suppresso… [+3652 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Marc Lagace", "title": "These are the best rugged cases for the Samsung Galaxy Note 9", "description": "The Samsung Galaxy Note 9 is the latest phone to push the boundaries for smartphone dimensions — with a price tag to match. The last thing you want is to damage your new phone, so protect your investment with a rugged case designed to absorb drop damage and k…", "url": "https://www.androidcentral.com/best-heavy-duty-cases-samsung-galaxy-note-9", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2018/08/spigen-tough-armor-note-9-hero.jpg?itok=D4WYZQLx", "publishedAt": "2019-05-24T11:00:00Z", "content": "The Samsung Galaxy Note 9 is the latest phone to push the boundaries for smartphone dimensions — with a price tag to match. The last thing you want is to damage your new phone, so protect your investment with a rugged case designed to absorb drop damage and k… [+2352 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "JILL COWAN", "title": "California Today: California Today: What to Know About Pacific Gas & Electric’s Role in the Camp Fire", "description": "Thursday: Get caught up on the embattled utility’s bankruptcy. Also: President Trump’s immigration overhaul; and the resurrection of “Deadwood.”", "url": "https://www.nytimes.com/2019/05/16/us/pge-camp-fire-bankruptcy.html", "urlToImage": "https://static01.nyt.com/images/2019/05/16/us/16campfirecatoday/merlin_154898295_de741251-e1a1-49d0-b5df-00bee6c99d18-facebookJumbo.jpg", "publishedAt": "2019-05-16T13:09:18Z", "content": "Good morning.\r\n(Heres the sign-up, if you dont already get California Today by email.)\r\nOn Wednesday, about six months after Californias deadliest and most destructive wildfire rampaged through Butte County, decimating the town of Paradise and killing 85 peop… [+889 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Clive Hammond", "title": "Trump’s specialist KILLING team to join him on UK tour amid safety concerns - Express", "description": "Trump’s specialist KILLING team to join him on UK tour amid safety concerns Express DONALD TRUMP is set to be accompanied by Hawkeye, his specialist killing team, when he arrives in the UK for his state visit today. Some estimate that protection costs will re…", "url": "https://www.express.co.uk/news/uk/1135410/Trump-UK-visit-latest-news-us-president-hawkeye-assassination-attempt-donald-queen", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/1/750x445/1135410.jpg", "publishedAt": "2019-06-03T02:32:00Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Ryan W. Miller, USA TODAY", "title": "Is your sunscreen 'safe'? What you need to know about protecting yourself from the sun this summer", "description": "The Environmental Working Group says many sunscreens on the market today provide inferior protection or contain potentially harmful chemicals.", "url": "https://www.usatoday.com/story/news/health/2019/05/22/sunscreens-safest-environmental-working-group-2019-review/3740857002/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/-mm-/1e0b9a9b417ee9e2990d5b4d976eddb66c66ffbe/c=16-0-2483-1394/local/-/media/2018/06/18/USATODAY/USATODAY/636649163199187943-Screen-Shot-2018-06-18-at-10.57.58-AM.png?width=3200&height=1680&fit=crop", "publishedAt": "2019-05-22T04:01:03Z", "content": "A recent FDA study found that certain sunscreen chemicals exceeded the FDAs recommended threshold without a government safety inspection.\r\n Wochit\r\nWith Memorial Day around the corner, sunscreens on the market today may be providing inferior sun protection or… [+7380 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Motherboard Staff, Emanuel Maiberg", "title": "What Happens When a US Border Protection Contractor Gets Hacked?", "description": "The government wants all the data it can get from you at the border. But what happens when a hacker shows they can’t store it safely?", "url": "https://www.vice.com/en_us/article/mb8k3p/what-happens-when-a-us-border-protection-contractor-gets-hacked", "urlToImage": "https://video-images.vice.com/articles/5d039a27a6589e0008165844/lede/1560517277756-cyber-podcast-art.png?crop=1xw:0.562xh;0xw,0xh&resize=1200:*", "publishedAt": "2019-06-14T13:43:49Z", "content": "Every day, 1.1 million people travel through American points of entry, according to statistics from US Custom and Border Protection (CBP). Of those 1.1 million, almost 700,000 are people coming in by land, and of those almost 300,000 come in by privately owne… [+937 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Amanda Krause", "title": "Tourists in Japan are flocking to 'otter cafés,' but there's evidence that the animals are illegally taken from the wild and kept in small cages", "description": "Japan is home to tons of animal cafés, many of which charge visitors to pet and spend time with Asian small-clawed otters, a threatened species. In a new documentary, British environmentalist and photojournalist Aaron Gekoski worked with World Animal Protecti…", "url": "https://www.insider.com/evidence-suggests-otter-cafes-in-japan-harmful-conditions-2019-5", "urlToImage": "https://static.businessinsider.com/image/5ceecaebf2f4796e8633cd6d-750.jpg", "publishedAt": "2019-05-29T18:09:00Z", "content": "The business of animal cafés in Japan is booming. Currently, tourists and locals can pet and spend time with species ranging from cats to owls for a small fee. Similarly, a search for the hashtag \"Animalcafé\" on Instagram brings more than 17,000 results, many… [+6636 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Joseph Green", "title": "Save £50 on a Ring Video Doorbell Pro kit with chime and transformer", "description": "Technology has helped to transform the world we live in. We are now better connected and more informed than ever before. Technology has also made it a whole lot easier to stay rooted to the sofa for the whole day. You can now answer the door from anywhere and…", "url": "https://mashable.com/uk/shopping/best-deal-ring-video-doorbell-pro-may-29/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F29%252Fda%252F3d2089f6481740d498b5dbd263203b5e.ca4ab.png%252F1200x630.png?signature=LIxj9ttPgiccCB0qDgCXw2OTdR4=", "publishedAt": "2019-05-29T13:53:42Z", "content": "Technology has helped to transform the world we live in. We are now better connected and more informed than ever before. Technology has also made it a whole lot easier to stay rooted to the sofa for the whole day. \r\nYou can now answer the door from anywhere a… [+908 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Miller Kern", "title": "Save $65 on this wireless charging station for your iPhone, AirPods, and Apple Watch", "description": "TL;DR: Cut down on charging cords with this handy 3-in-1 wireless charging station that's on sale for $35. Just like the chair covered in clothes that you refuse to acknowledge, your nightstand could probably use some life-changing magic of cleaning up. And w…", "url": "https://mashable.com/shopping/june-13-wireless-charging-station-on-sale/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F13%252F50%252F25e5723ac47e4dd4a2d69b00650439c4.8168c.png%252F1200x630.png?signature=O0AeleYaSl7kZcSy8KIR-j8f-hc=", "publishedAt": "2019-06-13T09:00:00Z", "content": "TL;DR: Cut down on charging cords with this handy 3-in-1 wireless charging station that's on sale for $35.\r\nJust like the chair covered in clothes that you refuse to acknowledge, your nightstand could probably use some life-changing magic of cleaning up. And … [+1005 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Miller Kern", "title": "VPNs on sale: Stay safe online for as little as $10", "description": "In this era of internet privacy (or lack thereof), much ado has been made about a little something called a virtual private network, or VPN. But what is it, exactly? In a nutshell, a VPN is a service that creates a private, secure internet connection between …", "url": "https://mashable.com/shopping/may-19-vpns-on-sale/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F19%252Fcd%252F442207a9f054412ca6cc158c0f52d33c.76005.jpg%252F1200x630.jpg?signature=Dl2d_NhrQVAOMfQtyAuJMzzkzRM=", "publishedAt": "2019-05-19T09:00:00Z", "content": "In this era of internet privacy (or lack thereof), much ado has been made about a little something called a virtual private network, or VPN. But what is it, exactly?\r\nIn a nutshell, a VPN is a service that creates a private, secure internet connection between… [+4467 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "AZI PAYBARAH", "title": "New York Today: New Yorkers Are Beach-bound. So, Where Are the Sharks?", "description": "Wednesday: Sharks are constantly in motion, and that keeps researchers busy.", "url": "https://www.nytimes.com/2019/05/22/nyregion/newyorktoday/nyc-news-beaches-sharks.html", "urlToImage": "https://static01.nyt.com/images/2019/06/01/nyregion/22nytoday-shark/01shark-facebookJumbo.jpg", "publishedAt": "2019-05-22T09:59:47Z", "content": "In 1973, The New York Post was distributed in the afternoon by a unionized work force. \r\nThanks to a strong sense of job protection, some staff members would call out sick on Friday nights, leaving the paper in a bind for its Saturday edition. When that happe… [+901 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lauren Hepler", "title": "As Wildfire Season Looms, Finding Tree Trimmers is a New Problem", "description": "For Pacific Gas & Electric, it isn’t easy mustering crews to thin the forests where its equipment might cause fires.", "url": "https://www.nytimes.com/2019/05/23/business/energy-environment/pge-wildfire-trees.html", "urlToImage": "https://static01.nyt.com/images/2019/05/23/business/23trees2/23trees2-facebookJumbo-v2.jpg", "publishedAt": "2019-05-23T19:10:20Z", "content": "PG&amp;E, Californias largest electric utility, recently told state regulators that it would take until 2026 to catch up on inspecting up to 100 million trees and cutting or trimming as needed. The company, which filed for bankruptcy protection in January aft… [+1021 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Stephanie Ebbs", "title": "EPA improperly spent an extra $140,000 on travel under Scott Pruitt: Report", "description": "A report from the Environmental Protection Agency watchdog found former chief Scott Pruitt and his staff spent an estimated $124,000 more than necessary on travel.", "url": "https://abcnews.go.com/Politics/epa-improperly-spent-extra-140000-travel-scott-pruitt/story?id=63076865", "urlToImage": "https://s.abcnews.com/images/Politics/scott-pruitt-ap-jpo-180622_hpMain_6_16x9_992.jpg", "publishedAt": "2019-05-16T18:00:36Z", "content": "Former Environmental Protection Agency chief Scott Pruitt and his staff spent an estimated $124,000 more than necessary on first class flights \"without sufficient justification to support security concerns\" used to support the spending, according to a report … [+5021 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Quinn Owen", "title": "DHS watchdog finds 'dangerous overcrowding' at Texas migrant detention center", "description": "Homeland Security inspector general has found “dangerous overcrowding” and unsanitary conditions at a Customs and Border Protection facility in El Paso, Texas.", "url": "https://abcnews.go.com/Politics/900-migrants-found-texas-facility-125-person-capacity/story?id=63404988", "urlToImage": "https://s.abcnews.com/images/US/us-mexico-border-ap-jef-190530_hpMain_2_16x9_992.jpg", "publishedAt": "2019-05-31T20:48:00Z", "content": "In a new report out Friday, the Homeland Security inspector general has found dangerous overcrowding and unsanitary conditions at a Customs and Border Protection facility in El Paso, Texas, where hundreds more migrants were being housed than the center was de… [+2462 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Anne Flaherty", "title": "Feds stop processing migrants at Texas border center after suspected flu outbreak", "description": "U.S. Customs and Border Protection is moving migrants out of a processing center in McAllen, Texas, amid fears that many people there have contracted the flu.", "url": "https://abcnews.go.com/Politics/govt-stops-processing-migrants-texas-border-center-suspected/story?id=63196466", "urlToImage": "https://s.abcnews.com/images/Politics/twip-05-ap-jpo-180621_hpMain_2_16x9_992.jpg", "publishedAt": "2019-05-22T14:20:32Z", "content": "U.S. Customs and Border Protection has stopped taking in undocumented migrants at a border processing center in McAllen, Texas, citing a \"large number\" of people in custody with high fevers and other flu-like symptoms.\r\nInterested in Immigration?\r\nAdd Immigra… [+2830 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Ara Wagoner", "title": "These are the best OnePlus 7 Pro screen protectors so far", "description": "6.67 inches of beautifully notchless curved Gorilla Glass 5 cover the front of the OnePlus 7 Pro's 90 Hz Fluid AMOLED screen, which means that there's more reason than ever to protect it, but that curvature also presents more challenges to delivering a screen…", "url": "https://www.androidcentral.com/best-oneplus-7-pro-screen-protectors", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2019/05/oneplus-7-pro-2-16w8i.jpg?itok=BbNAnp3N", "publishedAt": "2019-05-16T11:30:03Z", "content": "6.67 inches of beautifully notchless curved Gorilla Glass 5 cover the front of the OnePlus 7 Pro's 90 Hz Fluid AMOLED screen, which means that there's more reason than ever to protect it, but that curvature also presents more challenges to delivering a screen… [+2922 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Joe Maring", "title": "These are the best OnePlus 7 Pro cases so far", "description": "The OnePlus 7 Pro is powerful, eye-catching, and incredibly slippery. As much as we love the phone, it's almost impossible to use the thing without a case of some sort. Here are our top recommendations so far! Striking hybrid Ringke Fusion-X Staff pick Ringke…", "url": "https://www.androidcentral.com/best-oneplus-7-pro-cases", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/05/oneplus-7-pro-home-screen.jpg?itok=2Wg5WeIT", "publishedAt": "2019-05-14T16:21:44Z", "content": "Staff pick\r\nRingke's Fusion-X takes the best bits of a clear and rugged case, mashes them into one package, and calls it a day. There's a dot matrix pattern on the clear portion to prevent an unwanted rainbow effect, lanyard hole, and a raised lip around the … [+2291 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Arizona Republic, Rafael Carranza, Arizona Republic", "title": "Guatemalan teen dies at Border Patrol station, 5th minor to die in U.S. custody in 6 months", "description": "Customs and Border Protection said the 16-year-old from Guatemala was found unresponsive during a welfare check in the Rio Grande Valley.", "url": "https://www.azcentral.com/story/news/politics/border-issues/2019/05/20/migrant-child-dies-cbp-custody-border-patrol-texas-customs-protection-carlos-gregario-hernandez-vasq/3744554002?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/02/PCCT/0b9099a2-f2a2-4bd0-b635-8e6e643ff989-Border_Patrol_temporary_shelter_RGV-0012.JPG?crop=5471,3063,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-20T23:41:00Z", "content": "The body of a 7-year-old girl who died while in custody of the U.S. Border Patrol arrived in her native Guatemala on Sunday. Government representatives received the white coffin containing Jakelin Caal's remains. (Dec. 24)\r\n AP\r\nPHOENIX - A 16-year-old boy di… [+6040 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Opinion contributors, Richard Blumenthal and Derrick Johnson, Opinion contributors", "title": "On Brown V. Board of Education, Trump judicial nominees take the 5th on law and values", "description": "Brown is more than a historic ruling. It paved the way for civil rights progress and laid the very foundation for equal protection under the law.", "url": "https://www.usatoday.com/story/opinion/2019/05/17/trump-judicial-nominees-dodge-law-values-brown-board-education-column/3695469002/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/authoring/2019/05/16/USAT/e5e0a7a7-8ff0-468c-a266-54c98c7ae5d8-AFP_AFP_1GI8GK.JPG?crop=5567,3118,x0,y221&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-17T08:00:05Z", "content": "Do you believe Brown v. Board of Education was correctly decided? This might seem like a strange question to ask a judicial nominee in 2019. Sadly, it is starkly relevant thanks to recent signals from the Supreme Court that it is open to reconsidering long-es… [+4837 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Michelle Mark and Associated Press", "title": "A woman plunged to her death down a California waterfall after she slipped while taking photos", "description": "A woman died when she slipped and lost her footing at a Northern California waterfall while she was taking photos, California authorities said. Witnesses reported the young woman was too close to the edge. There was no guardrail blocking access to the area. \"…", "url": "https://www.insider.com/woman-dies-waterfall-while-taking-photos-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf339fff2f4791ae65e0b12-960-480.jpg", "publishedAt": "2019-06-02T02:52:12Z", "content": "A woman plunged to her death down a Northern California waterfall after she slipped and lost her footing while taking photos, authorities said Friday. \r\n The North Tahoe Fire Protection District said in a statement that the woman died Friday at Eagle Falls, a… [+953 chars]"}, {"source": {"id": null, "name": "Hackaday.com"}, "author": "Jenny List", "title": "An Exhaustive Guide To Building 18650 Packs", "description": "Most of us know the basics of building packs of lithium-ion batteries. We’re familiar with cell balancing and the need for protection circuitry, and we understand the intricacies of the various serial and parallel configurations. It’s still a process that can…", "url": "https://hackaday.com/2019/06/12/an-exhaustive-guide-to-building-18650-packs/", "urlToImage": "https://hackaday.com/wp-content/uploads/2019/06/18650-pack-featured.jpg", "publishedAt": "2019-06-12T08:00:00Z", "content": "Most of us know the basics of building packs of lithium-ion batteries. We’re familiar with cell balancing and the need for protection circuitry, and we understand the intricacies of the various serial and parallel configurations. It’s still a process that can… [+1034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rene Marsh and Gregory Wallace, CNN", "title": "TSA to deploy hundreds, including air marshals, to border", "description": "The Transportation Security Administration plans to send hundreds of officials to help with efforts to deal with migrant inflows on the southern border just as the busy summer travel season begins, according to an internal email obtained by CNN.", "url": "https://www.cnn.com/2019/05/15/politics/tsa-border-security/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/131102133751-tsa-logo-story-top.jpg", "publishedAt": "2019-05-15T09:00:11Z", "content": "Washington (CNN)The Transportation Security Administration plans to send hundreds of officials to help with efforts to deal with migrant inflows on the southern border just as the busy summer travel season begins, according to an internal email obtained by CN… [+4612 chars]"}, {"source": {"id": null, "name": "Hyundaimotorgroup.com"}, "author": null, "title": "Hyundai Motor Introduces Electric Double-Decker Bus", "description": "Operation of the 70-passenger electric bus improves traffic congestion and environment protection", "url": "https://www.hyundaimotorgroup.com/MediaCenter/News/Press-Releases/Hyundai-Motor-Introduces-Electric-Double-Decker-Bus.hub", "urlToImage": "https://www.hyundaimotorgroup.com/upload/image/mp210/mp210-39535-230999.jpg", "publishedAt": "2019-06-01T00:46:38Z", "content": "Hyundai Motor Company2019/05/29"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Trump administration staff to abandon protection of president under threat of fines, congressman suggests: 'It could be a game changer'", "description": "Trump administration staff who are protecting the president by refusing to comply with congressional subpoenas could abandon him under threat of huge fines, senior Democrats have suggested.Adam Schiff, Democratic chair of the House intelligence committee, has…", "url": "https://news.yahoo.com/trump-administration-staff-abandon-protection-080852923.html", "urlToImage": null, "publishedAt": "2019-05-14T08:08:52Z", "content": null}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elizabeth Dias", "title": "Michigan Attorney General Announces First Arrests in Catholic Clergy Abuse Investigation", "description": "Five former Catholic priests have been charged with criminal sexual conduct, and Michigan officials are still examining hundreds of tips.", "url": "https://www.nytimes.com/2019/05/24/us/michigan-arrests-catholic-clergy-sex-abuse.html", "urlToImage": "https://static01.nyt.com/images/2019/05/24/us/24michigan-church/24michigan-church-facebookJumbo.jpg", "publishedAt": "2019-05-24T16:46:51Z", "content": "Michigan reformed its statute of limitations laws last summer, after the case against Larry Nassar, the former Michigan State University sports doctor convicted of widespread sexual abuse. The new laws allow victims who were sexually assaulted as minors to fi… [+1445 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jane Margolies", "title": "The Toxic Secret Underneath the Seaport", "description": "Residents of a historic neighborhood have been trying to preserve its character as major building projects loom. Now the discovery of a 19th-century thermometer factory there has further complicated matters.", "url": "https://www.nytimes.com/2019/06/07/nyregion/south-street-seaport-mercury.html", "urlToImage": "https://static01.nyt.com/images/2019/06/09/nyregion/09jpseaport1/31seaport1-facebookJumbo.jpg", "publishedAt": "2019-06-08T09:22:17Z", "content": "Mr. Carpi said that exposure to mercury vapors is a particular concern for children, whose nervous systems are still developing. And because the respiratory rates of children are higher than those of adults, he added, they are likely to take in more of it.\r\nI… [+1670 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Jennings Brown", "title": "Senate Passes Bill That Would Slap Robocallers With Fine of Up to $10,000 Per Call", "description": "In a nearly unanimous vote, the Senate approved a bill that would hinder robocalls and ramp up penalties for scammers who make illegal robocalls. Read more...", "url": "https://gizmodo.com/senate-passes-bill-that-would-slap-robocallers-with-fin-1834990113", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Te4gYTvB--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/yqiedjs06sqr9diwauct.jpg", "publishedAt": "2019-05-23T22:30:00Z", "content": "In a nearly unanimous vote, the Senate approved a bill that would hinder robocalls and ramp up penalties for scammers who make illegal robocalls. \r\nThe TRACED (Telephone Robocall Abuse Criminal Enforcement and Deterrence) Act was introduced in November by Mas… [+1466 chars]"}, {"source": {"id": null, "name": "Coolhunting.com"}, "author": "Evan Orensten", "title": "Moto Boot", "description": "Made in Portugal from Italian, vegetable-tanned leather, Aether’s moto boots—which are specifically designed for motorcycle riding—include a bounty of built-in safety features. From the internal D3O ankle-protection pads to the double-layered leather toe to p…", "url": "http://coolhunting.com/buy/moto-boot/", "urlToImage": "https://i1.wp.com/coolhunting.com/wp-content/uploads/2019/06/boots.jpg?fit=700%2C700&ssl=1", "publishedAt": "2019-06-11T17:09:19Z", "content": "Made in Portugal from Italian, vegetable-tanned leather, Aether’s moto bootswhich are specifically designed for motorcycle ridinginclude a bounty of built-in safety features. From the internal D3O ankle-protection pads to the double-layered leather toe to pre… [+231 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Daily Crunch: Peloton files to go public", "description": "The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 9am Pacific, you can subscribe here. 1. Connected bike and treadmill-maker Peloton files confidentially f…", "url": "http://techcrunch.com/2019/06/05/daily-crunch-peloton-files-to-go-public/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2017/01/peloton-logo.jpg?w=600", "publishedAt": "2019-06-05T17:32:05Z", "content": "The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 9am Pacific, you can subscribe here.\r\n1. Connected bike and treadmill-maker Peloton files confidentially … [+1907 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Google says some G Suite user passwords were stored in plaintext since 2005", "description": "Google says a small number of its enterprise customers mistakenly had their passwords stored on its systems in plaintext. The search giant disclosed the exposure Tuesday but declined to say exactly how many enterprise customers were affected. “We recently not…", "url": "http://techcrunch.com/2019/05/21/google-g-suite-passwords-plaintext/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/GettyImages-915586254.jpg?w=600", "publishedAt": "2019-05-21T21:15:37Z", "content": "Google says a small number of its enterprise customers mistakenly had their passwords stored on its systems in plaintext.\r\nThe search giant disclosed the exposure Tuesday but declined to say exactly how many enterprise customers were affected. “We recently no… [+2121 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jon Russell", "title": "SoundCloud buys artist distribution platform Repost Network", "description": "The past year has seen Spotify embark on a series of acquisitions to beef up its service, particularly on podcast content. Now it is the turn of SoundCloud, another European music startup — albeit one that had lost its way in recent years — to go deal-making:…", "url": "http://techcrunch.com/2019/05/28/soundcloud-repost-network/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/soundcloud.jpg?w=750", "publishedAt": "2019-05-28T08:09:25Z", "content": "The past year has seen Spotify embark on a series of acquisitions to beef up its service, particularly on podcast content. Now it is the turn of SoundCloud, another European music startup — albeit one that had lost its way in recent years — to go deal-making:… [+2137 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Emma Comeau", "title": "Reserve your demo table for TC Sessions: Mobility 2019", "description": "Early-stage startup ingenuity is one of the driving forces shaping the rapid, radical changes taking place in mobility and transportation. Come July 10, TechCrunch will host more than 1,000 movers, shakers and makers in San Jose for TC Sessions: Mobility 2019…", "url": "http://techcrunch.com/2019/05/22/reserve-your-demo-table-for-tc-sessions-mobility-2019/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/mobility-header-1.png?w=734", "publishedAt": "2019-05-22T16:00:32Z", "content": "Early-stage startup ingenuity is one of the driving forces shaping the rapid, radical changes taking place in mobility and transportation. Come July 10, TechCrunch will host more than 1,000 movers, shakers and makers in San Jose for TC Sessions: Mobility 2019… [+2323 chars]"}, {"source": {"id": null, "name": "Autoblog.com"}, "author": "Reuters", "title": "IndyCar to use 'Aeroscreen' cockpit protection next season", "description": "Filed under: Motorsports, Safety, Racing Polycarbonate screen will be anti-reflective, anti-fogging Continue reading IndyCar to use 'Aeroscreen' cockpit protection next season IndyCar to use 'Aeroscreen' cockpit protection next season originally appeared on A…", "url": "https://www.autoblog.com/2019/05/24/indycar-aeroscreen-cockpit-driver-protection-next-season/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/660x371+0+0/resize/800x450!/format/jpg/quality/85/https://media.zenfs.com/de/sport1_737/96b902bda5d5b6f2305c7b8612afcd36", "publishedAt": "2019-05-24T21:45:00Z", "content": "INDIANAPOLIS — IndyCar will use an \"Aeroscreen\" to provide cockpit protection from next season, with the Red Bull Advanced Technologies-designed system giving cars a jet fighter appearance, the U.S. open wheel series announced on Friday.\r\nIndyCar believes the… [+2377 chars]"}]}