{"status": "ok", "totalResults": 5350, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Mental Health Awareness Week: The five things men don't talk about enough", "description": "With Mental Health Awareness Week starting Monday, BBC Sport got five men in a room to sit down and discuss their own issues with mental health.", "url": "https://www.bbc.co.uk/sport/48218327", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/C35B/production/_106911005_manupindex.png", "publishedAt": "2019-05-14T05:21:32Z", "content": "Media playback is not supported on this device\r\nMan Up: Five guys discuss mental health for men in 2019\r\n\"What's it like being a man in 2019?\"\r\nTo coincide with Mental Health Awareness Week, BBC Sport got five men to sit down together and discuss their issues… [+6193 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "You May Want to Avoid This Anti-Abortion Fertility App", "description": "The FEMM Period Ovulation Tracker looks like any other fertility app, asking you to log your menstruation data and promising “cutting edge science that helps you keep track of your health.” But the Guardian found that the app is backed by an anti-abortion act…", "url": "https://vitals.lifehacker.com/you-may-want-to-avoid-this-anti-abortion-fertility-app-1835134804", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--lhp7szOF--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xsiunbcj2fakkd3pk6dv.jpg", "publishedAt": "2019-05-31T13:00:00Z", "content": "The FEMM Period Ovulation Tracker looks like any other fertility app, asking you to log your menstruation data and promising cutting edge science that helps you keep track of your health. But the Guardian found that the app is backed by an anti-abortion activ… [+1221 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "https://www.facebook.com/680CJOB", "title": "Trio bikes from Kansas to Winnipeg to raise awareness, money for eating disorders - Global News", "description": "Trio bikes from Kansas to Winnipeg to raise awareness, money for eating disorders Global News Trio of friends from Wichita, Kan. biked 1600 kilometres to shine light on anorexia, eating disorders and mental health. View full coverage on Google News", "url": "https://globalnews.ca/news/5296055/trio-bikes-from-kansas-to-winnipeg-to-shed-light-on-eating-disorders/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2019/05/image-from-ios-58.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2019-05-21T12:00:00Z", "content": "Paul Harrison lost his daughter to anorexia in May of 2018.\r\nLater that year, his life-long friend, Rick Stephens, suggested the two should ride their bikes from their home town in Wichita, Kan. to Winnipeg to raise money and awareness for anorexia and other … [+1736 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "NHS staff shortage: How many doctors and nurses come from abroad?", "description": "Could the NHS endanger health services in poorer countries by recruiting overseas?", "url": "https://www.bbc.co.uk/news/world-48205445", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/D0C9/production/_106894435_hospital_phone.jpg", "publishedAt": "2019-05-12T23:33:16Z", "content": "Image copyrightGetty Images\r\nThe UK's National Health Service (NHS) will soon begin a major campaign to recruit health workers from other countries to meet growing staff shortages.\r\nReports suggest a strategy has been drawn up to target a number of countries … [+5159 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "David Meltzer", "title": "Why This Entrepreneur Is Focused on Improving Men's Health Nationwide", "description": "A health scare inspired a charity that takes a unique approach to improving men's health.", "url": "https://www.entrepreneur.com/video/334515", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190531185630-Screenshot2019-05-31at25534PM.png", "publishedAt": "2019-06-01T17:30:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nThomas Milana Jr., founder and chairman of Man Cave Health, talks about how his prostate cancer diagnosis empowered him to focus on improving men’s health nationwide, why he is spreading awarenes… [+562 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "ALEX MARSHALL", "title": "Britain’s ‘Jeremy Kyle Show’ Canceled After Death of Guest", "description": "Jeremy Kyle’s daytime TV series, “The Jeremy Kyle Show,” had been one of Britain’s most popular. It was often called a British version of “The Jerry Springer Show.”", "url": "https://www.nytimes.com/2019/05/15/arts/television/jeremy-kyle-show-canceled-death.html", "urlToImage": "https://static01.nyt.com/images/2019/05/15/arts/15Kyle/15Kyle-facebookJumbo.jpg", "publishedAt": "2019-05-16T01:42:44Z", "content": "Similar incidents have been found in other talk shows worldwide. In 1995, The Jenny Jones Show was caught in a media storm after an episode on gay crushes in which one guest, Scott Amedure, admitted to his friend Jonathan Schmitz that he had a secret crush on… [+1204 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Victoria Song", "title": "Why Apple Might Soon Be the Best Choice For Tracking Your Period", "description": "Reproductive health tech is going through some growing pains. On the one hand, there’s been a lot of progress now that menstruation—and all it entails—isn’t quite so taboo. For instance, there’s now a wearable that’s conducting clinical studies about how vari…", "url": "https://gizmodo.com/why-apple-might-soon-be-the-best-choice-for-tracking-yo-1835161704", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--HCbSpGK0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/imd2zixffc6n0x8pbiql.png", "publishedAt": "2019-06-04T18:50:00Z", "content": "Reproductive health tech is going through some growing pains. On the one hand, theres been a lot of progress now that menstruationand all it entailsisnt quite so taboo. For instance, theres now a wearable thats conducting clinical studies about how various fa… [+6626 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Facebook’s Blood Donations feature arrives in U.S., will alert donors in times of need", "description": "Facebook today is expanding its set of features focused on blood donations. The company since 2017 has been working with blood donation centers worldwide who have been able to use the platform to reach potential donors and then reach out to them in times of n…", "url": "http://techcrunch.com/2019/06/12/facebooks-blood-donations-feature-arrives-in-u-s-will-alert-donors-in-times-of-need/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/06/Blood-Donation-Hub.jpg?w=600", "publishedAt": "2019-06-12T14:15:08Z", "content": "Facebook today is expanding its set of features focused on blood donations. The company since 2017 has been working with blood donation centers worldwide who have been able to use the platform to reach potential donors and then reach out to them in times of n… [+3119 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "Samyukta Mullangi, John P. Pollak, Said Ibrahim", "title": "Harnessing Digital Information to Improve Population Health", "description": "We have more ways to gather health-related data than ever.", "url": "https://hbr.org/2019/05/harnessing-digital-information-to-improve-population-health", "urlToImage": "https://hbr.org/resources/images/article_assets/2019/05/May19_14_130406188.jpg", "publishedAt": "2019-05-14T15:00:40Z", "content": "Health systems do not systematically collect information on social determinants of health (SDH)  the conditions in which people are born, live, grow, and age  despite knowing that they have a big impact on individual and population health. But the shift from … [+7251 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "SAUL DUBOW", "title": "South Africa’s Racist Founding Father Was Also a Human Rights Pioneer", "description": "How did Jan Smuts reconcile his belief in freedom abroad with his efforts to suppress it at home?", "url": "https://www.nytimes.com/2019/05/18/opinion/jan-smuts-south-africa.html", "urlToImage": "https://static01.nyt.com/images/2019/05/18/opinion/18Dubow/18Dubow-facebookJumbo.jpg", "publishedAt": "2019-05-18T15:00:07Z", "content": "Smuts felt a different affinity with another famous American, Woodrow Wilson. In the latter stages of drafting the 1919 Treaty, Smuts was privately critical of Wilson, fearing that he was capitulating to those who wanted to punish Germany, and so endangering … [+2435 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jeremy Berke and Aylin Woodward", "title": "Stunning photos reveal the fragility and resilience of the Earth and its animals", "description": "June 5th is World Environment Day — an annual celebration of our environment meant to encourage people to protect it. Human activities like carbon emissions and deforestation are threatening Earth's flora and fauna in unprecedented ways. Many species are resi…", "url": "https://www.businessinsider.com/photos-climate-change-pollution-affecting-earth-animals-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cbdf011b8342c65317cca0e-2732-1366.jpg", "publishedAt": "2019-06-04T21:17:02Z", "content": "June 5 marks the 35th annual World Environment Day— a global event spearheaded by the United Nations that aims to increase worldwide action to protect our environment. \r\n Every year, the UN campaigns to raise awareness about environmental issues like marine p… [+1248 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kamakshi Ayyar", "title": "Meet the Woman Sailing Around the World to Raise Awareness About Plastic Pollution", "description": "Activist Emily Penn leads eXXpedition, an all-women sailing crew, that studies plastic and toxic pollution in the world's oceans", "url": "https://time.com/5597447/exxpedition-world-oceans-day-plastic-pollution/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/exxpedition-crew.jpg?quality=85", "publishedAt": "2019-06-07T03:44:41Z", "content": "The first time self-described “ocean advocate” Emily Penn was confronted by the magnitude of the plastic pollution problem was during an international sailing expedition 10 years ago. She spotted bits of debris, things like toothbrushes, floating in the water… [+5005 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Victoria Song", "title": "Fertility App Downloaded by Thousands Is Reportedly Funded by Anti-Abortion Groups", "description": "Period tracking apps aren’t anything new, but recently, a few have been subject to greater scrutiny regarding their privacy, and efficacy—especially those marketed as contraceptive methods. The latest is Femm, which a Guardian report has found to be funded by…", "url": "https://gizmodo.com/fertility-app-downloaded-by-thousands-is-reportedly-fun-1835117921", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--uxweHlcj--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rmpci8dy60clkxb5mxj7.png", "publishedAt": "2019-05-30T19:10:00Z", "content": "Period tracking apps arent anything new, but recently, a few have been subject to greater scrutiny regarding their privacy, and efficacyespecially those marketed as contraceptive methods. The latest is Femm, which a Guardian report has found to be funded by a… [+6152 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Fiona Simpson, Contributor, Fiona Simpson, Contributor https://www.forbes.com/sites/fionasimpson1/", "title": "It's Good To Talk: Mental Health And Franchising", "description": "As it is reported that nearly one half entrepreneurs will experience at least one form of mental health condition during their lifetime, should franchisors give consideration to how they identify and support franchisees with mental health difficulties within …", "url": "https://www.forbes.com/sites/fionasimpson1/2019/05/25/its-good-to-talk-mental-health-and-franchising/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1151427972%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-25T13:31:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nLast week in the U.K was Mental Health Awareness Week, which actually coincides with Mental Health Awareness Month in the U.S.\r\nMental Health Awareness Week (or Month) is of course about trying to raise … [+11023 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "info@hypebeast.com (HYPEBEAST), HYPEBEAST", "title": "John Geiger Prepares 002 \"Cream\" for Mental Health Awareness Month", "description": "After surfacing in a blacked-out makeup, John Geiger has prepared a new iteration of his 002 silhouette in time for the tail end of Mental Health Awareness Month. The footwear designer has realized his bespoke shoe in \"Cream,\" launching the model alongside a …", "url": "https://hypebeast.com/2019/5/john-geiger-002-cream-colorway-release-date-info", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F05%2Fjohn-geiger-002-cream-sneaker-colorway-release-date-info-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2019-05-31T15:44:22Z", "content": "After surfacing in a blacked-out makeup, John Geiger has prepared a new iteration of his 002 silhouette in time for the tail end of Mental Health Awareness Month. The footwear designer has realized his bespoke shoe in “Cream,” launching the model alongside a … [+1994 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Emma Betuel", "title": "Mental Health: Teen Suicide Rates Rising Disproportionately in One Group - Inverse", "description": "Mental Health: Teen Suicide Rates Rising Disproportionately in One Group Inverse Suicide rates in girls are rising, study finds, especially in those age 10 to 14 CNN Teen suicides have surged at twice the rate among girls compared to boys in the last decade D…", "url": "https://www.inverse.com/article/55928-teen-suicide-rates-are-rising-in-girls#article", "urlToImage": "https://fsmedia.imgix.net/2f/93/5d/cd/a741/4022/b63f/45957f47c68a/suicides-amongst-teenage-girls-risen-since-2007-outpacing-the-growth-rates-seen-in-teenage-boys.jpeg?crop=edges&fit=crop&auto=format%2Ccompress&h=600&w=1200", "publishedAt": "2019-05-17T20:12:00Z", "content": "Whether its due to social media, political turmoil, or lack of sleep, American teenagers are facing a mental health crisis. In August 2018, the CDC reported that suicidal ideation had risen among teens in the past decade, and a paper published Friday in JAMA … [+7725 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "John Boitnott", "title": "These Strategies Help Entrepreneur Combat Anxiety and Depression", "description": "The same character traits make people choose entrepreneurship can make them vulnerable to depression and anxiety.", "url": "https://www.entrepreneur.com/article/333636", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190513180816-GettyImages-521983717.jpeg", "publishedAt": "2019-05-14T11:30:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nEntrepreneurs are not strangers to anxiety and depression. They’re just as susceptible as the rest of the population, if not more so, to mental illnesses such as bipolar disorder, sociopathy, sch… [+5868 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Caroline Bologna", "title": "Carson Daly’s Comments About Anxiety Keep Getting More And More Relatable", "description": "The \"Voice\" host has been very open about his mental health and how he copes.", "url": "https://www.huffpost.com/entry/carson-daily-anxiety-weight-gain_l_5cefe7b4e4b0888f89d23e71", "urlToImage": "https://img.huffingtonpost.com/asset/5cf0141d2400005e07855f17.jpeg?cache=1dupYO8HRO&ops=1200_630", "publishedAt": "2019-05-30T20:00:40Z", "content": "Carson Daly knows the challenges of living with anxiety.\r\nThe television host has been opening up about his experience with generalized anxiety disorder and the ways he copes with his feelings of worry, fear and panic. One approach is taking anti-anxiety medi… [+4883 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Erin Daksha-Talati Paquette", "title": "Racism Is Literally Bad for Our Health", "description": "We must change the attitudes, practices and policies that disadvantage some racial and ethnic populations -- Read more on ScientificAmerican.com", "url": "https://blogs.scientificamerican.com/observations/racism-is-literally-bad-for-our-health/", "urlToImage": "https://static.scientificamerican.com/blogs/cache/file/E625B989-8A02-4D90-ADC840D70A939905.jpg", "publishedAt": "2019-06-07T11:00:00Z", "content": "As a woman practicing medicine, raised by a first-generation immigrant father and Hispanic mother, I fit the image of an underrepresented minority. Yet my education and position belie that stereotype.\r\nAs a young girl, I remember walking in our small town in … [+6434 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Sean Captain", "title": "This startup provides health insurance against online harassment", "description": "Leigh Honeywell and Logan Dean have raised a million dollars for a new business, Tall Poppy, that helps companies protect employees against trolls and hackers. Anyone who’s spent some time on Twitter knows that vilification and personal attacks–as extreme as …", "url": "https://www.fastcompany.com/90340622/this-startup-provides-health-insurance-against-online-harassment?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-tall-poppy.jpg", "publishedAt": "2019-05-16T09:00:18Z", "content": "Anyone who’s spent some time on Twitter knows that vilification and personal attacks–as extreme as threats of rape and murder–are a standard feature of some people’s online lives. And Twitter is peewee league in comparison to virulent hate communities on plat… [+12883 chars]"}, {"source": {"id": null, "name": "Staradvertiser.com"}, "author": null, "title": "3 Hawaii island visitors confirmed to have contracted rat lungworm disease - Honolulu Star-Advertiser", "description": "3 Hawaii island visitors confirmed to have contracted rat lungworm disease Honolulu Star-Advertiser 3 unrelated rat lungworm disease confirmed KHON2 News Three Unrelated Cases of Rat Lungworm Confirmed Maui Now Rat Lungworm Confirmed in 3 Big Island Visitors …", "url": "https://www.staradvertiser.com/2019/05/23/breaking-news/3-hawaii-island-visitors-confirmed-to-have-contracted-rat-lungworm-disease/", "urlToImage": "https://www.staradvertiser.com/wp-content/uploads/2019/05/web1_20190425_brk_rld01.jpg", "publishedAt": "2019-05-23T22:35:00Z", "content": "STAR-ADVERTISER / OCT. 2017\r\nA slug in a jar which was suspected to be infected with rat lungworm parasites. The state Health Department has received confirmation from the U.S. Centers for Disease Control and Prevention of three unrelated cases of rat lungwor… [+3213 chars]"}, {"source": {"id": null, "name": "Militarytimes.com"}, "author": "Military Times", "title": "Military doctors are doing fewer amputations, and there's a risk they could forget how to treat them", "description": "Getty Images/Matt Cardy The number of service members with combat-related amputations has declined sharply since 2011, when the number of amputations was at a peak of 260. There were three in 2018. The decline has raised concern that military medical professi…", "url": "https://www.militarytimes.com/news/your-military/2019/06/06/with-amputations-on-the-decline-could-doctors-forget-how-to-do-them/", "urlToImage": "https://amp.businessinsider.com/images/5c1d5419630d9b483c4eb2bc-1334-667.jpg", "publishedAt": "2019-06-07T18:45:46Z", "content": "Doctors aren't performing as many combat-related amputations these days. \r\n But with that good news for service members comes one potential downside: Military medical professionals could forget how to treat patients with missing limbs. That happened after the… [+3089 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Anti-abortion clinics that try to trick women face new Google ad policy", "description": "The move could steer women away from misinformation and abortion \"science fiction.\"", "url": "https://arstechnica.com/science/2019/05/anti-abortion-clinics-that-try-to-trick-women-face-new-google-ad-policy/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/05/GettyImages-1145120647-760x380.jpg", "publishedAt": "2019-05-22T21:38:50Z", "content": "Enlarge/ MONTGOMERY, Ala. - MAY 19, 2019: A protestor dressed as a character from the Hulu TV show The Handmaid's Tale, based on the best-selling novel by Margaret Atwood, walks back to her car after participating in a rally against one of the nation's most r… [+3360 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Aarathi Singh, CommunityVoice, Aarathi Singh, CommunityVoice https://www.forbes.com/sites/forbeschicagocouncil/people/aarathisingh/", "title": "How Leaders Can Begin Redefining Women's Health", "description": "As a society, we uniformly agree it's important, but many of us cannot define it.", "url": "https://www.forbes.com/sites/forbeschicagocouncil/2019/05/28/how-leaders-can-begin-redefining-womens-health/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fforbeschicagocouncil%2Ffiles%2F2019%2F05%2Fa-31-500x500.jpg", "publishedAt": "2019-05-28T12:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nWomen's health is not a lapel pin of a pink ribbon. Its not an app on your phone or the month of October. Its not restricted to one age, demographic or geography. Its not a label or a category. Its not a… [+11432 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": "Li, G., Jiang, Y., Zhang, L.", "title": "HIV upsurge in China's students", "description": "Thirty years ago, China experienced its first indigenous HIV/AIDS cases. Since then, HIV has spread from drug users and blood transfusion recipients to the general urban population, mainly through sexual routes. Particularly worrisome is the recent increase o…", "url": "https://science.sciencemag.org/content/364/6442/711.full", "urlToImage": "https://science.sciencemag.org/sites/default/files/highwire/sci/364/6442.cover-source.gif", "publishedAt": "2019-05-23T17:40:09Z", "content": "Thirty years ago, China experienced its first indigenous HIV/AIDS cases. Since then, HIV has spread from drug users and blood transfusion recipients to the general urban population, mainly through sexual routes. Particularly worrisome is the recent increase o… [+4007 chars]"}, {"source": {"id": null, "name": "Blog.google"}, "author": "Karin  Tuxen-Bettman", "title": "Street View cars measure Amsterdam’s air quality", "description": "The quality of the air we breathe has a major impact on our health. Even in Amsterdam, a city where bikes make up 36 percent of the traffic, the average life span is cut short by a year as a result of polluted air. Information about air quality at the street …", "url": "https://www.blog.google/around-the-globe/google-europe/street-view-cars-measure-amsterdams-air-quality/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+blogspot%2FMKuf+%28The+Keyword+%7C+Official+Google+Blog%29", "urlToImage": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2019-05-15_at_12.19.08_PM.max-1300x1300.png", "publishedAt": "2019-05-16T08:27:07Z", "content": "Project Air View\r\nBuilding on efforts in London and Copenhagen, Google and the municipality of Amsterdam are now working together to gain insight into the citys air quality at the street level. Amsterdam already measures air quality at several points around t… [+1227 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Mark Wilson", "title": "Here are the best ways to protect your privacy on an iPhone", "description": "Every iPhone user should adopt these five methods to guard their data in iOS. For all of Apple’s promises to treat privacy as a “fundamental human right,” the truth is, its own App Store ushered in the surveillance economy we have today. As we explained in ou…", "url": "https://www.fastcompany.com/90352030/here-are-the-best-ways-to-protect-your-privacy-on-an-iphone?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/v1541101333/fcweb/FC-Twitter-Card_new2_mqyz2q.jpg", "publishedAt": "2019-06-10T07:00:00Z", "content": "But you can, and should, still take some proactive steps to protect your privacy when using the iPhone. Here are some best practices to keep in mind.\r\n1. Use Apple’s Own Apps\r\nGoogle’s services, like Google Maps and Chrome, are tempting for their functionalit… [+2320 chars]"}, {"source": {"id": null, "name": "Blog.google"}, "author": "Karin  Tuxen-Bettman", "title": "Working to map the air everywhere and help #BeatAirPollution", "description": "Whenever I go for a bike ride, I use Google Maps to find bike lanes and avoid busy streets. When I take my kids to the park, I check the weather forecast so I know what to expect. Imagine if we could also see maps of air quality in our neighborhoods, and rout…", "url": "https://www.blog.google/products/maps/working-map-air-everywhere-and-help-beatairpollution/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+blogspot%2FMKuf+%28The+Keyword+%7C+Official+Google+Blog%29", "urlToImage": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Env_Day_1_.max-1000x1000.png", "publishedAt": "2019-06-05T08:00:00Z", "content": "How Project Air View can help us understand more about ground-level air quality\r\nAir quality is an important issue and can be difficult to map on hyperlocal level, which is why weve taken time to make sure we get it right. Weve made a lot of progress. After l… [+2260 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Tina Amini", "title": "Nintendo Comments on Crunch and Game Delays", "description": "Nintendo's focus will remain on its high quality and the health of its employees rather than rushing a game to market, even if that means a delay.", "url": "https://www.ign.com/articles/2019/06/11/nintendo-comments-on-crunch-and-game-delays-a-e3-2019", "urlToImage": "https://assets1.ignimgs.com/2019/02/12/nintendo-1550013284720_160w.jpg", "publishedAt": "2019-06-11T17:05:52Z", "content": "As the development community continues to question practices that contribute to a normalized culture of crunch, many studios and individual developers have been reflecting on the conversation, trying to find ways to contribute to the solution. And Nintendo is… [+2323 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "Sam Wong", "title": "Brain scans reveal magic mushroom drug enhances mindfulness meditation", "description": "Both meditation and psychedelic drugs can lead to more self-awareness and serenity. Now a study has found that combining the two seems to magnify the effect", "url": "https://www.newscientist.com/article/2204540-brain-scans-reveal-magic-mushroom-drug-enhances-mindfulness-meditation/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2019/05/29164348/p1phax.jpg", "publishedAt": "2019-05-29T16:27:26Z", "content": "Psychedelic drugs may make meditation more powerful\r\nHero Images Inc. / Alamy Stock Photo\r\nBy Sam Wong\r\nMeditation and psychedelic drugs are both being investigated as potential treatments for improving mental health, but what happens when the two are combine… [+404 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Daniel Pearson", "title": "Madhappy Drops “Positive Reinforcement” Capsule for Mental Health Awareness Month", "description": "Brand: Madhappy Season: SS19 Key Pieces: The tee is the pick of the bunch in this small three-piece capsule, featuring an off-kilter colorful design and the text “The Local Optimistic Group” writ large. Release Date: Available now Buy: Madhappy Editor’s Notes…", "url": "https://www.highsnobiety.com/p/madhappy-mental-health-awareness-capsule/", "urlToImage": "https://static.highsnobiety.com/thumbor/GW8agGhcFp2kOi5oJ7q2fwjYg2M=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2019/05/24102501/madhappy-mental-health-awareness-capsule-00.jpg", "publishedAt": "2019-05-24T11:08:23Z", "content": "Brand: Madhappy\r\nSeason: SS19\r\nKey Pieces: The tee is the pick of the bunch in this small three-piece capsule, featuring an off-kilter colorful design and the text “The Local Optimistic Group” writ large.\r\nRelease Date: Available now\r\nBuy:Madhappy\r\nEditors No… [+575 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Mental Health Awareness Week: Danny Rose & Peter Crouch open up in new BBC interview", "description": "Danny Rose and Peter Crouch have opened up about their own experience of mental health for mental health Awareness week.", "url": "https://www.bbc.co.uk/sport/football/48294687", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/41DA/production/_106985861_ipiccy-collage.jpg", "publishedAt": "2019-05-16T23:05:43Z", "content": "(L-R) Gareth Southgate, pundit Jermaine Jenas, The Duke of Cambridge, Burnley's Peter Crouch, Tottenham's Danny Rose, ex-Arsenal striker Thierry Henry and TV presenter Dan Walker appear in the film\r\nDanny Rose and Peter Crouch have opened up about their perso… [+5918 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Ailsa Sherrington", "title": "And the winner of the Chivas Venture Global Final is…", "description": "Last week, the Chivas Venture Global Final took place at our very own TNW Conference. $1 million of no-strings funding was awarded to the top global startups blending profit with purpose to have a positive impact on the world. From 20 global finalists, Mexico…", "url": "https://thenextweb.com/tnw2019/2019/05/24/winner-chivas-venture-global-final-tnw2019/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw2019?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F05%2FODYS8836_2019050980425123.png&signature=9c6d4339ddf139dbaec653aee81d5a57", "publishedAt": "2019-05-24T14:15:50Z", "content": "Last week, the Chivas Venture Global Final took place at our very own TNW Conference. $1 million of no-strings funding was awarded to the top global startups blending profit with purpose to have a positive impact on the world. \r\nFrom 20 global finalists, Mexi… [+3037 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Mental Health Awareness Week: Five guys discuss mental health for men in 2019 in 'Man Up'", "description": "BBC Sport gathers together five young men for a series of honest conversations about what it's like to be a man in 2019, and the impact that can have on their mental health.", "url": "https://www.bbc.co.uk/sport/av/48260477", "urlToImage": "https://m.files.bbci.co.uk/modules/bbc-morph-sport-page/3.0.2/images/bbc-sport-logo.png", "publishedAt": "2019-05-13T16:20:19Z", "content": "BBC Sport gathers together five young men for a series of honest conversations about what it's like to be a man in 2019, and the impact that can have on their mental health.\r\nJournalist Ben Zand, sprinter James Ellington, footballers David Cox and Olu Maintai… [+296 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Caroline Castrillon, Contributor, Caroline Castrillon, Contributor https://www.forbes.com/sites/carolinecastrillon/", "title": "Why It's Time For Entrepreneurs To Eliminate The Stigma Around Mental Health", "description": "Founders suffer mental health challenges at higher than average rates. It’s time for entrepreneurs to acknowledge the risks, eliminate the stigma and take preventative action around mental health.", "url": "https://www.forbes.com/sites/carolinecastrillon/2019/05/14/why-its-time-for-entrepreneurs-to-eliminate-the-stigma-around-mental-health/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_6870%2Fpt_6870_541_o.jpg%3Ft%3D1557828003", "publishedAt": "2019-05-14T10:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nBy embracing vulnerability, entrepreneurs can free themselves from shame, get the help they need and empower others to do the same.\r\nGetty\r\nHave you ever taken a mental health day from work? According to… [+14126 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Ellen Cranley", "title": "Rapper Bushwick Bill is still alive but 'fighting for his life,' family and publicist say after false death report", "description": "Despite reports published early Sunday on the contrary, rapper Bushwick Bill is alive, according to his family and publicist. Bill's son took to Instagram to insist his dad is still alive but is \"fighting for his life,\" and asked for thoughts and prayers. The…", "url": "https://www.insider.com/rapper-bushwick-bill-not-dead-despite-reports-2019-6", "urlToImage": "https://static.businessinsider.com/image/5cfd74aaf2f4797cb006699b-750.jpg", "publishedAt": "2019-06-09T21:05:33Z", "content": "The family and management for rapper Bushwick Bill hit back at reports Sunday that said the rapper had died, saying he is continuing to battle pancreatic cancer. \r\n Fifty-two-year-old Bill, who is a founding member of the rap trio the Geto Boys, is not dead, … [+1799 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "This Indian School Requires Students to Hand Over Plastic Waste as Tuition", "description": "The school, in India's Assam State, requires pupils to collect 20 plastic items a week and asks parents to promise not to burn plastic waste", "url": "https://time.com/5601124/indian-school-students-plastic-waste-tuition/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/india-school-plastic-waste.jpg?quality=85", "publishedAt": "2019-06-05T07:03:06Z", "content": "A school in India’s northeastern Assam state is now requiring students to pay for tuition in plastic waste they collect.\r\nEach of the 110 students at the Akshar Forum school must bring 20 plastic items to school a week in order to attend, according to Agence … [+1373 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "KC Ifeanyi", "title": "Amid abortion debates, Laverne Cox hits on something no one is talking about", "description": "Cox used her commencement speech at Pitzer College to highlight the importance of language, specifically the erasure of trans men in abortion debates. Amid the roiling abortion debates with multiple states adopting the so-called “ heartbeat bill,” actor and a…", "url": "https://www.fastcompany.com/90344031/amid-abortion-debates-laverne-cox-hits-on-something-no-one-is-talking-about?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-amid-abortion-debates-laverne-cox-hits-on-something-no-one-is-talking-about.jpg", "publishedAt": "2019-05-20T11:15:13Z", "content": "Amid the roiling abortion debates with multiple states adopting the so-called “heartbeat bill,” actor and activist Laverne Cox retweeted a tweet that read, “Woman’s body. Woman’s right to choose. End of story.” It seemed harmless enough at first–she was using… [+3053 chars]"}, {"source": {"id": null, "name": "Lfpress.com"}, "author": null, "title": "London researchers sound alarm over marijuana's toll on fertility - Woodstock Sentinel Review", "description": "London researchers sound alarm over marijuana's toll on fertility Woodstock Sentinel Review Pot might make it harder to get pregnant, London researchers say in a new article. View full coverage on Google News", "url": "http://lfpress.com/news/local-news/smoke-up-sperm-count-down-london-researchers-sound-alarm-over-marijuanas-toll-on-fertility", "urlToImage": "https://nexus.prod.postmedia.digital/wp-content/uploads/2019/06/gettyimages-98579265-594x594.jpg", "publishedAt": "2019-06-10T22:35:08Z", "content": "Pot might make it harder to get pregnant, London researchers say in a new article.\r\nWestern University researchers are trying to set the record straight about how marijuana may affect fertility, rounding up the latest research findings in a podcast episode an… [+2992 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Morgan Sung", "title": "Jake Paul's attempt at calling out 'cyberbully' Cody Ko backfired beautifully", "description": "Jake Paul, a 22-year-old millionaire who built a career out of peddling merch to children and being loud on the internet, took a brave stance against cyberbullying by calling out a reaction vlogger who made fun of him a few times. Fellow YouTuber Cody Ko is k…", "url": "https://mashable.com/article/jake-paul-cody-ko-cyberbully/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F20%252F09%252Fe2b2a862ab9049d080b6f31c8ee5afa1.2b0af.png%252F1200x630.png?signature=LKvqYh00RrZxeWrcKM8HcP78i-E=", "publishedAt": "2019-05-20T21:05:18Z", "content": "Jake Paul, a 22-year-old millionaire who built a career out of peddling merch to children and being loud on the internet, took a brave stance against cyberbullying by calling out a reaction vlogger who made fun of him a few times.\r\nFellow YouTuber Cody Ko is … [+5794 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Alison Foreman", "title": "7 microaggressions to avoid during Pride and beyond", "description": "Mashable is celebrating Pride Month by exploring the modern LGBTQ world, from the people that make up the community to the spaces where they congregate, both online and off. Whether you're a queer person, trans person, or a straight ally, LGBTQ Pride Month (k…", "url": "https://mashable.com/article/common-antiqueer-microaggressions-pride-2019/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F05%252F41%252F6831df3d7204477db3063b6c14aa6184.45e53.jpg%252F1200x630.jpg?signature=97j_BWtaCQDViol0Is2SMifAW-4=", "publishedAt": "2019-06-05T13:00:00Z", "content": "Mashable is celebrating Pride Month by exploring the modern LGBTQ world, from the people that make up the community to the spaces where they congregate, both online and off.\r\nWhether you're a queer person, trans person, or a straight ally, LGBTQ Pride Month (… [+15080 chars]"}, {"source": {"id": null, "name": "Lifehack.org"}, "author": "Liam McClintock", "title": "5 Sleep Therapy Techniques for Better Overall Health And Wellness", "description": "While evidence continues to pile up that sleep is the very backbone of mental health, few of the many Americans who are having trouble getting proper shut-eye choose to try sleep therapy. We’re sadly encouraged to boast about how busy we are or how little sle…", "url": "https://www.lifehack.org/833087/sleep-therapy", "urlToImage": "https://cdn.lifehack.org/wp-content/uploads/2019/05/sleep-therapy.jpeg", "publishedAt": "2019-05-22T14:00:54Z", "content": "While evidence continues to pile up that sleep is the very backbone of mental health, few of the many Americans who are having trouble getting proper shut-eye choose to try sleep therapy.\r\nWe’re sadly encouraged to boast about how busy we are or how little sl… [+10289 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Braudie Blais-Billie", "title": "Frightened Rabbit Auctioning Music Gear for Mental Health Charity", "description": "Half of the proceeds will go towards Tiny Changes, a charity launched in memory of late frontman Scott Hutchison", "url": "https://pitchfork.com/news/frightened-rabbit-auctioning-music-gear-for-mental-health-charity/", "urlToImage": "https://media.pitchfork.com/photos/5cfeea008b427aeac7c5dc34/2:1/w_790/Frightened%20Rabbit_Photo2%20by%20Jimmy%20Fontaine.jpg", "publishedAt": "2019-06-10T23:49:15Z", "content": "Frightened Rabbit have teamed with Reverb to launch an auction for Tiny Changes, their mental health charity. Last year, the band started Tiny Changes in honor of their late frontman Scott Hutchison to raise awareness of a provide support for children and you… [+852 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rory Linnane and Jayne O'Donnell, USA TODAY Network", "title": "Youth put a face - their own - on suicidal thinking, mental health and trauma in new documentary", "description": "There are many causes behind these tragedies. Academic, social and economic pressures weigh on students. Social media can compound anxiety.", "url": "https://www.usatoday.com/story/news/health/2019/05/16/teen-suicide-mental-health-transgender-survival/1183877001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/authoring/2019/05/16/USAT/dedcac5a-7db2-4b8a-b2d7-6c960bc5945e-KIC_ALEX_02workingv2copy.jpg?crop=3647,2079,x0,y546&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-17T00:45:56Z", "content": "A new documentary that gives voice to and puts a face on the child and teen mental health crisis goes live online Thursday at 7:30 CT when it airs on Milwaukee's PBS station. \r\n\"You're Not Alone,\" which follows four young people from Wisconsin as they navigat… [+6030 chars]"}, {"source": {"id": null, "name": "Goodmorningamerica.com"}, "author": "ABC News", "title": "WATCH: Energy drinks may cause heart risks: Study", "description": "ABC News' Dr. Jennifer Ashton reports on what to know about a study that found caffeinated energy drinks may alter the heart's electrical activity.", "url": "https://www.goodmorningamerica.com/wellness/video/energy-drinks-heart-risks-study-63342207", "urlToImage": "https://s.abcnews.com/images/GMA/190529_gma_drinks_hpMain_16x9_992.jpg", "publishedAt": "2019-05-29T12:30:15Z", "content": "Now Playing: New warning about energy drinks and alcohol\r\nNow Playing: FBI searching for $65,000 worth of energy drinks\r\nNow Playing: Energy drinks may cause heart risks: Study\r\nNow Playing: What to know about new abortion restrictions and what that could mea… [+1204 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "ThemeGrill", "title": "STATELINE-As the Opioid Crisis Peaks, Meth and Cocaine… - Brinkwire", "description": "STATELINE-As the Opioid Crisis Peaks, Meth and Cocaine… Brinkwire By Christine and Vestal. May 13 (Stateline) – Most states are keeping a close eye on opioid overdose deaths, but they may need to start focusing on cocaine and...", "url": "http://brinkwire.com/news/stateline-as-the-opioid-crisis-peaks-meth-and-cocaine/", "urlToImage": null, "publishedAt": "2019-05-20T22:45:00Z", "content": "By Christine and Vestal\r\nMay 13 (Stateline) – Most states are keeping a close eye on opioid overdose deaths, but they may need to start focusing on cocaine and other stimulants as well.\r\nIt turns out that the same lethal drug that has been driving the nation´… [+7107 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Michael Potuck", "title": "Apple officially announces watchOS 6 for Apple Watch", "description": "During the WWDC keynote today Apple officially announced watchOS 6. Read on as we update this post with all the details of the latest Apple Watch software. A range of new watch faces are arriving with watchOS 6. These include a new California Dial, Modular Co…", "url": "https://9to5mac.com/2019/06/03/apple-announces-watchos-6/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/06/Screen-Shot-2019-06-03-at-13.14.24-PM.png", "publishedAt": "2019-06-03T17:15:46Z", "content": "During the WWDC keynote today Apple officially announced watchOS 6. Read on as we update this post with all the details of the latest Apple Watch software.\r\nA range of new watch faces are arriving with watchOS 6. These include a new California Dial, Modular C… [+1109 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "K Shiva ShankerHYDERABAD", "title": "No more half-baked knowledge, period", "description": "TSWREIS initiative to generate awareness among adolescent boys and girls about menstruation", "url": "https://www.thehindu.com/news/national/telangana/no-more-half-baked-knowledge-period/article27256415.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-05-26T18:39:08Z", "content": "To this day, even adult men have misconceptions, or, are unaware about one of the biological processes that occurs in women: menstruation. Let alone understanding, some families hand down misconceptions and myths surrounding it and do not allow girls to step … [+1564 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "Lingtao Yu, Mary Zellmer-Bruhn", "title": "What Mindfulness Can Do for a Team", "description": "Developing it together can reduce conflict.", "url": "https://hbr.org/2019/05/what-mindfulness-can-do-for-a-team", "urlToImage": "https://hbr.org/resources/images/article_assets/2019/05/May19_31_82119021.jpg", "publishedAt": "2019-05-31T12:05:47Z", "content": "What happens when you take a team of people from a range of backgrounds and skillsets and ask them to perform a challenging task on a tight deadline? Often, conflicts arise.\r\nSometimes conflicts can be productive: When teams are hammering out ideas and strivi… [+8083 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Joi Ito", "title": "Space Exploration and the Age of the Anthropocosmos", "description": "The new generation of space architects can learn from our successes and failures in protecting the internet commons and build a better paradigm for space.", "url": "https://www.wired.com/story/space-exploration-and-the-age-of-the-anthropocosmos/", "urlToImage": "https://media.wired.com/photos/5ceefd7c2ec6b1231124bbb0/191:100/pass/Ideas-NASA.jpg", "publishedAt": "2019-05-30T13:00:00Z", "content": "I would like to suggest a new word.\r\nAnthropocosmos, n. and adj. Chiefly with \"the.\" The epoch during which human activity is considered to be a significant influence on the balance, beauty, and ecology of the entire universe.\r\nBased on ...\r\nAnthropocene, n. … [+10375 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Kirk A. Bado, USA TODAY", "title": "Arthritis is prevalent in the military. This Army veteran wants to help", "description": "While one in four Americans have arthritis, one in three veterans are affected by the disease, according to the Centers for Disease Control.", "url": "https://www.usatoday.com/story/news/nation/2019/05/27/army-veteran-celena-adams-locke-spreads-word-arthritis/1253946001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/27/USAT/9b4e876a-8d96-44f3-9426-4edd2285f90e-Celena_Adams-Locke.jpg?crop=175,102,x0,y40&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-27T22:40:58Z", "content": "Apparently less than 10 minutes of walking a day may keep arthritis away. Buzz60's Maria Mercedes Galuppo has more.\r\n Buzz60\r\nCelena Adams-Locke is proud of her service.\r\nIt was more than three decades ago that she got her parents permission to sign up for th… [+6239 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Shama Hyder, Contributor, Shama Hyder, Contributor https://www.forbes.com/sites/shamahyder/", "title": "3 Ways Healthcare Professionals Can Use Social Media To Improve Population Health", "description": "From helping chronically ill people feel less isolated, to correcting the spread of diagnostic misinformation, to helping patients get the care they need faster, social media can offer a host of benefits to patients and the healthcare professionals treating t…", "url": "https://www.forbes.com/sites/shamahyder/2019/05/28/3-ways-healthcare-professionals-can-use-social-media-to-improve-population-health/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1149271081%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-28T16:34:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nInnovative healthcare solutions are now offering&amp;nbsp;technologies&amp;nbsp;such as&amp;nbsp;secure video conference for patients to reach their doctors.&amp;nbsp;\r\nGetty\r\nWith as often as we hear ab… [+9386 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Doyle Rice, USA TODAY", "title": "Um, yuk: You're eating about a credit card's worth of plastic every week", "description": "You're eating, swallowing or breathing in about 2,000 tiny pieces of plastic each week, a new study suggests, the equivalent of one credit card.", "url": "https://www.usatoday.com/story/news/nation/2019/06/12/plastic-youre-eating-credit-cards-worth-plastic-each-week/1437150001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/04/16/USATODAY/usatsports/gettyimages-79989029-e1546550958587.jpg?width=3200&height=1680&fit=crop", "publishedAt": "2019-06-12T22:24:24Z", "content": "When researchers studied people from different parts of the world, they found microplastics in the stool of every person they tested.\r\n USA TODAY\r\nFrom the top of Mount Everest to the deepest oceans, we know that plastic trash is everywhere on Earth. Now we k… [+2606 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Julia Brucculieri", "title": "Gucci Takes A Pro-Choice Stance With Its Latest Runway Show", "description": "The Italian luxury label sent one model out in a jacket with the words \"My Body My Choice\" on the back.", "url": "https://www.huffpost.com/entry/gucci-pro-choice-fashion_l_5cee938de4b0975ccf5e9fde", "urlToImage": "https://img.huffingtonpost.com/asset/5ceea30f24000053008558e3.png?cache=ZpmFsp8sTk&ops=1910_1000", "publishedAt": "2019-05-29T16:56:47Z", "content": "Models on the runway at Gucci's cruise 2020 show in Rome on May 28, 2019.\r\nGucci is officially pro-choice.\r\nOn Tuesday night, creative director Alessandro Michele debuted his latest cruise collection for the Italian fashion house. The show, which took place a… [+1943 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Vikas Vasudeva", "title": "Stubble burning incidents down in Punjab this harvest season", "description": "Awareness of the ill-effects one key reason for the dip, say experts", "url": "https://www.thehindu.com/news/national/other-states/stubble-burning-incidents-down-in-punjab-this-harvest-season/article27189804.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/xyrsrb/article27189803.ece/ALTERNATES/LANDSCAPE_615/DE20-STUBBLE", "publishedAt": "2019-05-20T17:28:44Z", "content": "Farmers in Punjab, the key grain producing State, seem to have exercised restraint in burning the wheat crop residue during the ongoing harvesting season. \r\nThe incidents of burning dipped compared to last year, officials told The Hindu. Agriculture experts a… [+1510 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Jang", "title": "My 40 Animal Comics Inspire People To Love And Care For Themselves", "description": "The month of May is dedicated to Mental Health Awareness since 1949. I imagine the day when taking care of our mental health is a part of our life just like brushing our teeth, so that we do not need a month to remind us of it. And before that day comes, self…", "url": "https://www.boredpanda.com/comics-self-love-and-friendship-jang/", "urlToImage": "https://static.boredpanda.com/blog/wp-content/uploads/2019/05/comics-self-love-and-friendship-jang-fb.png", "publishedAt": "2019-05-27T03:25:31Z", "content": "The month of May is dedicated to Mental Health Awareness since 1949. I imagine the day when taking care of our mental health is a part of our life just like brushing our teeth, so that we do not need a month to remind us of it.\r\nAnd before that day comes, sel… [+641 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Measures in place to check Nipah: Health Minister", "description": "Health Minister C. Vijaya Baskar on Thursday said the State and the Health Department had taken steps to prevent the spread of Nipah virus in Tamil Nadu in the wake of the recent outbreak. Talking to", "url": "https://www.thehindu.com/news/national/tamil-nadu/measures-in-place-to-check-nipah-health-minister/article27585099.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-06-06T19:45:10Z", "content": "Health Minister C. Vijaya Baskar on Thursday said the State and the Health Department had taken steps to prevent the spread of Nipah virus in Tamil Nadu in the wake of the recent outbreak. \r\nTalking to reporters at the airport, he said a communication on prec… [+527 chars]"}, {"source": {"id": null, "name": "Popsci.com"}, "author": "Nicole Wetsman, Nicole Wetsman", "title": "Opioid risks are different for kids and teens—the guidelines should be, too", "description": "A pair of new studies, published this week in the journal Pediatrics, turned attention to opioid prescribing rates in the pediatric population. Specifically, they addressed two subsets of that group: adolescents and young adults between the ages of 13 and 22,…", "url": "https://www.popsci.com/opiods-rates-children-young-adults-er", "urlToImage": "https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/05/opioids_prescription.jpg?itok=NZ_4HHhW", "publishedAt": "2019-05-28T22:00:00Z", "content": "As the opioid epidemic took hold and expanded in the United States, physicians and medical organizations researched and created better guidelines for prescribing the drugs and preventing misuse. Those guidelines, though, have focused primarily on adults, says… [+6032 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Marianna Pogosyan Ph.D.", "title": "Mindfulness and Stress: A Tale of Mutual Consequences", "description": "Present moment awareness can be beneficial for our psychological health and a valuable coping mechanism against stress.", "url": "https://www.psychologytoday.com/ca/blog/between-cultures/201905/mindfulness-and-stress-tale-mutual-consequences", "urlToImage": null, "publishedAt": "2019-05-13T14:00:10Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Young Entrepreneur Council, CommunityVoice, Young Entrepreneur Council, CommunityVoice https://www.forbes.com/sites/theyec/people/theyec/", "title": "Why It's Time To Start A Conversation Around Mental Health On Your Sales Team", "description": "Fight the stigma and support your team members.", "url": "https://www.forbes.com/sites/theyec/2019/05/14/why-its-time-to-start-a-conversation-around-mental-health-on-your-sales-team/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ftheyec%2Ffiles%2F2019%2F05%2Fcanva-photo-editor-17-500x500.png", "publishedAt": "2019-05-14T12:30:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSales is emotional, and thats what I love about my profession of choice. There are very few things in life that give me as much of a high as the triumph and surge of energy I feel when a proposal comes b… [+11764 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Olivia Singh", "title": "28 celebrities who have opened up about their struggles with mental illness", "description": "Research shows that stereotypes about mental illness often prevent people from seeking treatment or speaking out. In recent years, stars like Sophie Turner, Chris Evans, Chrissy Teigen, and Prince Harry have spoken candidly about their struggles with mental i…", "url": "https://www.insider.com/celebrities-depression-anxiety-mental-health-awareness-2017-11", "urlToImage": "https://amp.businessinsider.com/images/5ce707a84cf27038cf118dfe-1136-568.jpg", "publishedAt": "2019-05-24T20:24:00Z", "content": "Speaking to The Times UK in May 2019, Turner said that she struggled with her body image as a teenager, and being in the spotlight didn't help. \r\n \"I was too aware of my body at a young age,\" she said. \"And it just kind of took over my mind, it was all I woul… [+730 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Football Association launches new mental health campaign", "description": "A new campaign using football to \"generate the biggest ever conversation around mental health\" is launched by the Football Association.", "url": "https://www.bbc.co.uk/sport/football/48278719", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/14E5C/production/_106969558_princewilliams.jpg", "publishedAt": "2019-05-15T11:41:37Z", "content": "Media playback is not supported on this device\r\nMan Up: Five guys discuss mental health for men in 2019\r\nA new campaign using football to \"generate the biggest ever conversation around mental health\" has been launched by the Football Association.\r\nIn partners… [+1134 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Fiona Simpson, Contributor, Fiona Simpson, Contributor https://www.forbes.com/sites/fionasimpson1/", "title": "It's Good To Talk: Raising Awareness Of Mental Health In Franchising", "description": "With a reported one in six of the population experiencing a common mental health condition in the past week alone, it's never been so important for franchisors to be mental health aware.", "url": "https://www.forbes.com/sites/fionasimpson1/2019/05/17/its-good-to-talk-raising-awareness-of-mental-health-in-franchising/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1148965361%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-17T14:36:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nThis week in the U.K is Mental Health Awareness Week, which actually coincides with Mental Health Month in the U.S.\r\nMental Health Awareness Week (or Month) is of course about trying to raise awareness o… [+11223 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dr. James Somauroo, Contributor, Dr. James Somauroo, Contributor https://www.forbes.com/sites/jamessomauroo/", "title": "Google, Calm and Headspace Among Tech Companies Offering Advice During Mental Health Awareness Week", "description": "It’s Mental Health Awareness Week and I’ve been asking tech companies to tell me about what they’re doing to promote positive mental health. In their companies and through their products.", "url": "https://www.forbes.com/sites/jamessomauroo/2019/05/17/google-calm-and-headspace-among-tech-companies-offering-advice-during-mental-health-awareness-week/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1146545450%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-17T23:35:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAccording to the National Alliance On Mental Illness, 18.5% of Americans will suffer from mental illness this year; 4% of them will suffer so acutely that it will substantially limit their ability to liv… [+16785 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Madhvi Mavadiya, Contributor, Madhvi Mavadiya, Contributor https://www.forbes.com/sites/madhvimavadiya/", "title": "Making Financial Mental Health A Priority", "description": "During Mental Health Awareness Week there was increased discussion about financial wellness – a subject that is becoming more and more debated within the fintech community, as inclusion seemingly becomes more of a focus for traditional financial services play…", "url": "https://www.forbes.com/sites/madhvimavadiya/2019/05/20/making-financial-mental-health-a-priority/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1149505350%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-20T20:29:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nDuring Mental Health Awareness Week there was increased discussion about financial wellness a subject that is increasingly being spoken about within the fintech community, as inclusion seemingly becomes … [+15205 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "US 'nuclear coffin' on island in the Pacific could be 'leaking' radioactive sludge into the sea", "description": "Radioactive waste from Cold War nuclear weapons tests could be leaking into the Pacific Ocean.", "url": "https://www.foxnews.com/science/us-nuclear-coffin-leaking-radioactive-sludge", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/Castle-Bravo-US-Department-of-Energy.jpg", "publishedAt": "2019-05-19T15:46:26Z", "content": "Radioactive waste from Cold War nuclear weapons tests could be leaking into the Pacific Ocean.\r\nAccording to United Nations Secretary-General Antonio Guterres, a concrete dome that was built on Runit Island in the late 1970s to contain waste from massive atom… [+1983 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Charlotte Mitchell", "title": "#IAmTheSudanRevolution: Support for Sudan amid internet blackout", "description": "Sudanese abroad are using social media to raise awareness about a violent crackdown on protesters by Sudan's military.", "url": "https://www.aljazeera.com/news/2019/06/iamthesudanrevolution-support-sudan-internet-blackout-190607053612349.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/6/5/b10f8f1957584ed9a48921d654441dd8_18.jpg", "publishedAt": "2019-06-07T14:40:22Z", "content": "Sudanese around the world have been taking to social media to raise awareness of a violent crackdown on protesters in Sudan amid a partial but crippling internet blackout in the country. \r\nUnder the #IAmTheSudanRevolution hashtag, social media users are showi… [+7748 chars]"}, {"source": {"id": null, "name": "Techinasia.com"}, "author": "Jaclyn Teng", "title": "Health insurance startup nabs $1m from Gobi, Wavemaker, Tryb, others", "description": "Philippine-based MariaHealth will use the cash to expand its tech team and increase brand awareness.", "url": "https://www.techinasia.com/mariahealth-nabs-1m-gobi-wavemaker-tryb?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PennOlson+%28Tech+in+Asia%29", "urlToImage": null, "publishedAt": "2019-05-13T03:01:24Z", "content": null}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Libby Hill", "title": "‘Lorena’ Director Joshua Rofé Brings Something New to the Bobbitt Case: Empathy", "description": "Now entrenched in domestic violence advocacy, Lorena Bobbitt née Gallo participated in the Amazon docuseries to raise awareness.", "url": "https://www.indiewire.com/2019/05/lorena-director-amazon-joshua-rofe-emmys-fyc-1202145101/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2019/05/10226023h-Cropped.jpg", "publishedAt": "2019-05-27T20:06:43Z", "content": "“Lorena” Joshua Rofé\r\nJordan Strauss/January Images/REX/Shutterstock\r\nIt’s been over 25 years since Lorena Bobbitt – now Lorena Gallo – severed John Wayne Bobbitt’s penis, a singular act of violence that sparked a media firestorm. Overnight, the pair were tra… [+6669 chars]"}, {"source": {"id": null, "name": "Manrepeller.com"}, "author": "Starling Irving", "title": "An Intimate Conversation About Mental Health at MR HQ", "description": "For Mental Health Awareness Month, we invited Dr. Jess and Crystal to share their experiences at Man Repeller HQ for our third installment of Good Evening.", "url": "https://www.manrepeller.com/2019/05/dr-jess-good-evening.html", "urlToImage": "https://www.manrepeller.com/wp-content/uploads/2019/05/An-Intimate-Conversation-About-Mental-Health-at-MR-HQ-Man-Repeller-Feature-1.jpg", "publishedAt": "2019-05-30T16:00:57Z", "content": "On days Im tempted to break my no-coffee streak, I remind myself that Man Repeller HQ has something more energizing than coffee: it has Crystal. On occasion, the click of puppy toes on the wooden hallway floors alerts me to the fact that in a mere moment, Cry… [+9691 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kelly Greenwood, Contributor, Kelly Greenwood, Contributor https://www.forbes.com/sites/kellygreenwood/", "title": "Feeling Less Alone This Mental Health Awareness Month", "description": "Workplace culture around mental health has started to change. It's increasingly clear that mental health conditions affect almost everyone. I’ve seen no greater evidence of this than my experiences this Mental Health Awareness Month--from a conference icebrea…", "url": "https://www.forbes.com/sites/kellygreenwood/2019/05/29/feeling-less-alone-this-mental-health-awareness-month/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkellygreenwood%2Ffiles%2F2019%2F05%2FPic-for-May-2019-Forbes-article-1200x675.jpg", "publishedAt": "2019-05-29T23:21:00Z", "content": "Workplace culture around mental health has started to change over the last couple of years, and while the pace of change has been slower than any of us would like, it is happening. Ive seen no greater evidence of this than what I experienced this May during M… [+6041 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Nina Zipkin", "title": "What Do Pitching and Investing Look Like In a Post-Elizabeth Holmes and Theranos World?", "description": "An entrepreneur and VC share their experiences and insights in the wake of the Theranos scandal that shocked the biotech world.", "url": "https://www.entrepreneur.com/article/334616", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190531144434-GettyImages-1138766484.jpeg", "publishedAt": "2019-05-31T14:20:00Z", "content": "At its height in 2015, blood-testing startup Theranos was valued at $9 billion and its founder, the then 31-year-old Elizabeth Holmes had a net worth of $4.5 billion. She was the youngest woman to become a self-made billionaire. She was held up as a Silicon V… [+10253 chars]"}, {"source": {"id": null, "name": "Fb.com"}, "author": "", "title": "Helping Increase Blood Donations in the US", "description": "To help raise awareness and make it easier for people to find opportunities to donate, we're launching our Blood Donations feature in the US.", "url": "http://newsroom.fb.com/news/2019/06/us-blood-donations/", "urlToImage": "https://fbnewsroomus.files.wordpress.com/2019/06/blood-donation-hub.jpg?w=960", "publishedAt": "2019-06-12T11:00:29Z", "content": "By Hema Budaraju, Product Director, Health\r\nEvery two seconds, someone in the US needs blood, and one donation can potentially save three lives. However, blood banks in the US are seeing a decline in blood donors.\r\nTo help raise awareness and make it easier f… [+3745 chars]"}, {"source": {"id": null, "name": "Newrepublic.com"}, "author": "Alan Pyke", "title": "Rahm Emanuel’s Deficit of Self-Awareness", "description": "Rahm Emanuel has identified an alarming problem in American politics. He may as well have found it by staring into a mirror. The explanation for President Donald Trump’s dismaying rise, he argues in The Atlantic on Tuesday, is that economic and political elit…", "url": "https://newrepublic.com/article/153972/rahm-emanuels-deficit-self-awareness", "urlToImage": "https://images.newrepublic.com/1155776b8ea3403b65c2d42e3b877a9d811bf59b.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "publishedAt": "2019-05-21T20:44:02Z", "content": "This supposedly underappreciated revolt has been at the center of the political conversation for many years now. Since Trumps rise, reporters from elite media organizations have been shipped out to the hinterlands to embed with these new enemies of the elite,… [+2117 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "James Rettig", "title": "Advance Base, Gia Margaret, Blithe Field, & More Contribute New Songs To Running From The Dark Charity Compilation", "description": "Running From The Dark is a new compilation, released during Mental Health Awareness Month, meant to shed light on mental health and raise money for the National Alliance On Mental Illness. There are new tracks from a ton of great artists on it, many of them o…", "url": "https://www.stereogum.com/2045333/running-from-the-dark-mental-healthy-charity-compilation/music/album-stream/", "urlToImage": "https://static.stereogum.com/uploads/2019/05/a0552528034_10-1559071491-608x608.jpg", "publishedAt": "2019-05-28T19:33:34Z", "content": "Running From The Dark is a new compilation, released during Mental Health Awareness Month, meant to shed light on mental health and raise money for the National Alliance On Mental Illness. There are new tracks from a ton of great artists on it, many of them o… [+455 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Nina Zipkin", "title": "'Love Actually' Director Richard Curtis: 'To Make Things Happen, You Have to Make Things'", "description": "The famed writer and director shares the creative philosophy that has helped raised more than $1 billion for charity with his organization Comic Relief.", "url": "https://www.entrepreneur.com/article/334246", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190523202415-phpEhtnAp-crop4.jpeg", "publishedAt": "2019-05-23T20:30:00Z", "content": "Richard Curtis, the writer and director of films including Four Weddings and a Funeral and Love Actually, is also the co-founder and vice chair of Comic Relief. He started the organization after visiting Ethiopia for a month during the 1985 famine and felt co… [+3579 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Zina Moukheiber, Contributor, Zina Moukheiber, Contributor https://www.forbes.com/sites/zinamoukheiber/", "title": "Mental Health Awareness Is On The Rise, But Access To Professionals Remains Dismal", "description": "Celebrities, such as Lady Gaga, have helped increase awareness of mental health conditions, but access to professionals remains an obstacle. A report card from AbleTo, which provides virtual therapy, gives the state of behavioral healthcare overall low marks.", "url": "https://www.forbes.com/sites/zinamoukheiber/2019/05/22/mental-health-awareness-is-on-the-rise-but-access-to-professionals-remains-dismal/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fzinamoukheiber%2Ffiles%2F2019%2F05%2Freport-jpeg-1200x3254.jpg", "publishedAt": "2019-05-22T14:50:00Z", "content": "Two Game of Thrones actresses recently revealed their struggle with depression and anxiety, joining a string of celebrities who are publicly sharing their experience with mental health. Lady Gaga, whos been in particular very outspoken, is playing an importan… [+3781 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Naz Beheshti, Contributor, Naz Beheshti, Contributor https://www.forbes.com/sites/nazbeheshti/", "title": "Heath Ledger's Joker Has Some Valuable Advice For Us During Mental Health Awareness Month", "description": "Gaining a competitive advantage in today’s world is serious business. The problems we face as a society are serious as well. Even the most seasoned business leader can become weighed down with life’s challenges, and we rarely perform at our best when we feel …", "url": "https://www.forbes.com/sites/nazbeheshti/2019/05/28/heath-ledgers-joker-has-some-valuable-advice-for-us-during-mental-health-awareness-month/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1141224081%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-28T16:12:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nGaining a competitive advantage in todays world is serious business. The problems we face as a society are serious as well. Even the most seasoned business leader can become weighed down with lifes chall… [+9520 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sophie Medlin, Contributor, Sophie Medlin, Contributor https://www.forbes.com/sites/sophiemedlin/", "title": "Health Versus Aesthetics - How Social Media is Affecting Your Body Image", "description": "It's Mental Health Awareness Week and Body Image is the theme. This article explores the extend of the damage to our body image and ways to start repairing it.", "url": "https://www.forbes.com/sites/sophiemedlin/2019/05/13/health-versus-aesthetics-how-social-media-is-affecting-your-body-image/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1146041265%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-13T19:52:00Z", "content": "It's Mental Health Awareness Week in the UK and this year, the focus is on body image.Body image is a term that is used to define how we think or feel about our bodies.&amp;nbsp;With social media now saturated with flawless, photoshopped and surgically enhanc… [+10663 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Patti Neighmond", "title": "Can You Reshape Your Brain's Response To Pain?", "description": "Changing how the mind reacts to pain can reduce the discomfort experienced, according to scientists who study brain pathways that regulate pain. A new type of therapy aims to enhance that effect.", "url": "https://www.npr.org/sections/health-shots/2019/06/10/727682322/can-you-reshape-your-brains-response-to-pain", "urlToImage": "https://media.npr.org/assets/img/2019/06/03/trauma-pain-7_wide-fd65420d0fcce8aa4849cf4f175c0ec8aa1435a5.jpg?s=1400", "publishedAt": "2019-06-10T09:00:22Z", "content": "Jeannine sorts through a binder of writing assignments from her therapy. In keeping a journal about her past experiences with pain, she noticed that the pain symptoms began when she was around 8 a time of escalating family trauma at home.\r\nJessica Pons for NP… [+10892 chars]"}, {"source": {"id": null, "name": "Gearpatrol.com"}, "author": "Gear Patrol", "title": "The Oris Dive Watch Helping to Save Coral Reefs", "description": "This limited-edition 43mm diver is part of Oris' Oceans Project, helping raise awareness of threats to the health of oceans around the globe.", "url": "https://gearpatrol.com/2019/06/13/the-oris-dive-watch-helping-to-save-coral-reefs/", "urlToImage": "https://cdn.gearpatrol.com/wp-content/uploads/2019/06/Sponsored-Product-Note-Oris-gear-patrol-lead-full.jpg", "publishedAt": "2019-06-13T07:45:00Z", "content": "Oris has been crafting beautiful and innovative mechanical watches for over 115 years — and unlike many watch companies, Oris is still independently owned. Hailing from Hölstein, Switzerland, Oris thrives in the rugged environments of diving, aviation and mot… [+886 chars]"}, {"source": {"id": null, "name": "Mindbodygreen.com"}, "author": "Kate Swoboda", "title": "7 Habits That Build Courage (And A Better Life)", "description": "It starts with an awareness of your relationship with fear.", "url": "https://www.mindbodygreen.com/articles/7-habits-that-build-courage-and-a-better-life", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_108,w_1500,h_843/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/7vkowt8jfjvo3e4hn.jpg", "publishedAt": "2019-05-19T11:47:00Z", "content": "We all want to face the challenges of our lives with more courage. What gets tricky is figuring out just how to do that when (once again) we've gotten caught in our own fear, stress, doubt, or worry. It's easy to talk about courage when we're feeling pumped u… [+1268 chars]"}, {"source": {"id": null, "name": "Greenentrepreneur.com"}, "author": "Josh Wand", "title": "You Can Land a Better Job in Cannabis Than the Job You Have Now", "description": "Emerging companies are enticing candidates with competitive salaries and 14 percent annual raises.", "url": "https://www.greenentrepreneur.com/article/334020", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190521155706-GettyImages-658494724.jpeg", "publishedAt": "2019-05-22T18:00:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nCannabis is flourishing. Even without federal legalization, it’s become the fastest-growing sector in the U.S. job market. ZipRecruiter’s labor economist Julia Pollak recently told The New York T… [+5234 chars]"}, {"source": {"id": null, "name": "Wpsdlocal6.com"}, "author": null, "title": "Paducah bike business hold fundraiser for stroke awareness - WPSD Local 6", "description": "Paducah bike business hold fundraiser for stroke awareness WPSD Local 6 PADUCAH, KY — About 200 people biked today for a good cause. Bike World in Paducah teamed up with Baptist Health to raise money for stroke awareness.", "url": "https://www.wpsdlocal6.com/2019/06/01/paducah-bike-business-hold-fundraiser-for-stroke-awareness/", "urlToImage": null, "publishedAt": "2019-06-02T01:30:23Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bianca Barratt, Contributor, Bianca Barratt, Contributor https://www.forbes.com/sites/biancabarratt/", "title": "These Are Some Of The Best UK Companies With Mental Health Support", "description": "This Mental Health Awareness Week, I take a look at some of the companies that are", "url": "https://www.forbes.com/sites/biancabarratt/2019/05/16/these-are-some-of-the-best-uk-companies-with-mental-health-support/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F828236846%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-16T12:56:00Z", "content": "Picture this: its 5pm on a Tuesday and youve got to give a presentation to a room full of the kind of people who carry briefcases first thing tomorrow. The pressures on for it to be slick, well thought out and expertly delivered. The trouble is, youve also go… [+9559 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Naz Beheshti, Contributor, Naz Beheshti, Contributor https://www.forbes.com/sites/nazbeheshti/", "title": "The Detrimental Effect Of Loneliness On Your Health And What You Can Do About It", "description": "Loneliness kills. It poses a greater threat to health than obesity, and its life-shortening effects are comparable to smoking 15 cigarettes a day. Furthermore, it is rampant in today’s workplace. As we close out Mental Health Awareness Month, let us examine w…", "url": "https://www.forbes.com/sites/nazbeheshti/2019/05/31/the-detrimental-effect-of-loneliness-on-your-health-and-what-you-can-do-about-it/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1066873984%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-31T13:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nLoneliness kills. It poses a greater threat to health than obesity, and its life-shortening effects are comparable to smoking 15 cigarettes a day. Furthermore, it is rampant in todays workplace.\r\nThose a… [+11181 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Is it that time of the month again? How do periods affect athletes & why are they monitored?", "description": "Periods might not turn wine into vinegar but can they affect an athlete's performance? BBC Sport looks at how athletes and doctors cope with menstruation.", "url": "https://www.bbc.co.uk/sport/48243310", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/144CB/production/_106974138_quekmccolgangreenwood_getty.jpg", "publishedAt": "2019-05-21T05:13:46Z", "content": "Media playback is not supported on this device\r\nIs it that time of the month again? - Hockey players talk periods\r\nWhat can turn wine into vinegar, kill bees, cause bacon to become rancid, and even dull a steel sword?\r\nThe answer, according to various theorie… [+8474 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Lidija Globokar, Contributor, Lidija Globokar, Contributor https://www.forbes.com/sites/lidijaglobokar/", "title": "5 Tips To Boost Your Mental Fitness", "description": "May is Mental Health Awareness Month in the United States and in the UK, Mental Health Awareness Week kicks off on Monday, 13 May. That's why it's the perfect timing to have a closer look at what you can do to stay mentally fit.", "url": "https://www.forbes.com/sites/lidijaglobokar/2019/05/17/5-tips-to-boost-your-mental-fitness/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Flidijaglobokar%2Ffiles%2F2019%2F05%2Fluca-bravo-134776-unsplash-1200x828.jpg", "publishedAt": "2019-05-17T10:30:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nLago di Braies\r\nPhoto by Luca Bravo on Unsplash\r\nIn case youre not aware, May is Mental Health Awareness Month in the United States.&amp;nbsp;In the UK, Mental Health Awareness Week kicked off on Monday,… [+9111 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Opinion contributors, Kevin Roster, Opinion contributors", "title": "I'm dying from cancer. I have to move across the country to die on my own terms", "description": "There's no reason anyone with a terminal disease should not have the option to avoid intolerable pain. I don't want to go out choking on my own blood.", "url": "https://www.usatoday.com/story/opinion/2019/06/07/medical-aid-dying-face-death-own-terms-column/1365567001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/06/06/USAT/87b82363-1906-4c65-b85e-2830e8404a10-XXX_CP_Kevin_Roster_poker_player_138064_08.JPG?crop=2999,1687,x1,y222&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-07T07:00:07Z", "content": "I am a 36-year-old dad who is dying of a rare cancer called sarcoma, which invades the bodys connective tissues, including the nerves, muscles, joints, bone, fat and blood vessels.\r\nSarcoma makes up only about 1% of adult cancers and is often diagnosed when i… [+5653 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": "Shi Davidi", "title": "Frustrating questions arise as Blue Jays sit Vlad Guerrero Jr. on holiday - Sportsnet.ca", "description": "Frustrating questions arise as Blue Jays sit Vlad Guerrero Jr. on holiday Sportsnet.ca Red Sox crush Guerrero-less Blue Jays TSN Bad pitching, batting and defense, Jays lose Bluebird Banter Rafael Devers joins Michael Chavis on Boston Red Sox's list of top fi…", "url": "https://www.sportsnet.ca/baseball/mlb/frustrating-questions-arise-blue-jays-sit-vlad-guerrero-jr-holiday/", "urlToImage": "https://assets2.sportsnet.ca/wp-content/uploads/2019/05/vladdy.jpg", "publishedAt": "2019-05-20T20:39:00Z", "content": "TORONTO Validation for the Toronto Raptors controversial management of Kawhi Leonards workload during the regular season has come during these NBA playoffs, scheduled rest days then giving way to an average of 38.7 spectacular minutes per post-season game now… [+5224 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Joseph DeAcetis, Contributor, Joseph DeAcetis, Contributor https://www.forbes.com/sites/josephdeacetis/", "title": "Lambs Is Protecting Men With Space Grade Technology", "description": "Lambs is a tech clothing company with a mission to raise awareness around EMF radiation and to protect customers from environmental dangers.", "url": "https://www.forbes.com/sites/josephdeacetis/2019/05/31/lambs-is-protecting-men-with-space-grade-technology/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjosephdeacetis%2Ffiles%2F2019%2F05%2FDSCF1569.jpg", "publishedAt": "2019-05-31T19:10:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nLambs EMF Blocking Underwear\r\nLambs \r\nA simple principle today is that the ideal of technology is at the heart of our political, economic and fashion system. It is foundational to our sense of justice, o… [+45411 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": "Kumar, B., Jensen, M. M., Strielkowski, W., Johnston, J. T., Sharma, V., Dandara, C., Shehata, M. M., Struett, M. M., Nikolaou, A., Szymanski, D. W., Abdul-Ghani, R., Cao, B., Varzinczak, L. H., Kerman, B. E., Arthur, P. K., Oda, F. S., Bohon, W., Ellwanger, J. H., Tyner, S., Jordan, E. J., Murphy, C.", "title": "NextGen Voices: Science-inspired sustainable behavior", "description": "![Figure][1]</img>\n\nEvidence of climate change inspires some scientists to rely on bicycles instead of cars, like these cyclists in New Delhi, India.\n\nPHOTO: PAUL KENNEDY/ALAMY STOCK PHOTO\n\nWe asked young scientists this question: How has your awareness of sc…", "url": "https://science.sciencemag.org/content/364/6443/822.full", "urlToImage": "https://science.sciencemag.org/sites/default/files/highwire/sci/364/6443.cover-source.gif", "publishedAt": "2019-05-30T17:45:33Z", "content": "Evidence of climate change inspires some scientists to rely on bicycles instead of cars, like these cyclists in New Delhi, India.\r\nPHOTO: PAUL KENNEDY/ALAMY STOCK PHOTO\r\nWe asked young scientists this question: How has your awareness of science inspired you t… [+13634 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Ryan W. Miller, USA TODAY", "title": "Sleeping babies are dying in car seats when parents use them incorrectly, study says", "description": "A study published Monday in Pediatrics found that more than two thirds of infant deaths in sitting devices occurred while in car seats.", "url": "https://www.usatoday.com/story/news/health/2019/05/21/car-seat-safety-sleeping-babies-die-car-seats-used-incorrectly/3750874002/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2018/09/06/USAT/bf0db180-4875-4533-9295-1f84ebcb3a2f-GettyImages-522552270.jpg?crop=2126,1196,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-21T13:56:33Z", "content": "A study published Monday in Pediatrics found that more than two thirds of infant deaths in sitting devices occurred while in car seats.\r\n (Photo: Tramino, Getty Images/iStockphoto)\r\nCar seats can be deadly places for babies to sleep when being used incorrectl… [+2988 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Mikhaila Friel", "title": "Kate Middleton channeled one of Princess Diana's trademark looks at her latest royal engagement", "description": "Kate Middleton made a subtle tribute to her late mother-in-law, Princess Diana, at her latest royal engagement. During a visit to a farm in Cumbria on Tuesday, the duchess wore a white shirt with a ruffled collar. This was a trademark look of Diana's, who was…", "url": "https://www.insider.com/kate-middleton-channeled-princess-diana-cumbria-visit-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5d00dae74cf27023926e1719-1136-568.jpg", "publishedAt": "2019-06-12T10:58:40Z", "content": "When it comes to fashion, Kate Middleton is known for returning to old favorites. At her latest royal engagement in Cumbria on Tuesday, the duchess did exactly that — but with an added twist. \r\n The royal stepped out in a casual outfit for a visit to Deepdale… [+2050 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Megan Bruneau, Contributor, Megan Bruneau, Contributor https://www.forbes.com/sites/meganbruneau/people/meganbruneau/", "title": "Driven By Bullying, Suicide, Grief And Trauma - How These Entrepreneurs Are Scaling Mental Health", "description": "In conclusion of mental health awareness month, I've compiled the powerful stories and advice from five entrepreneurs scaling help and hope – because when it comes to mental health, most of our missions came out of a mess.", "url": "https://www.forbes.com/sites/meganbruneau/2019/05/31/driven-by-bullying-suicide-grief-and-trauma-how-these-entrepreneurs-are-scaling-mental-health/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fmeganbruneau%2Ffiles%2F2019%2F05%2FMHF.png", "publishedAt": "2019-05-31T15:51:00Z", "content": "I intentionally&amp;nbsp;describe myself as a&amp;nbsp;&amp;quot;Writer,&amp;quot; not a&amp;nbsp;&amp;quot;Therapist&amp;quot; on my Hinge profile. Don't get me wrong I'm proud of what I get to do for a living; however, the dudes&amp;nbsp;who aren't immediat… [+31640 chars]"}, {"source": {"id": null, "name": "Hubspot.com"}, "author": "krbaker@hubspot.com (Kristen Baker)", "title": "The Ultimate Guide to Influencer Marketing in 2019", "description": "Have you ever purchased something because a well-known person you admire used the product or service? I’m definitely guilty of this — in fact, I recently bought myself a new waterski because a professional water skier and micro-influencer, Whitney McClintock,…", "url": "https://blog.hubspot.com/marketing/how-to-work-with-influencers", "urlToImage": "https://blog.hubspot.com/hubfs/How-to-Work-with-Influencers-compressor.jpg#keepProtocol", "publishedAt": "2019-05-29T19:26:00Z", "content": "Have you ever purchased something because a well-known person you admire used the product or service?\r\nIm definitely guilty of this in fact, I recently bought myself a new waterski because a professional water skier and micro-influencer, Whitney McClintock, s… [+33241 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Two years for killing wife - Canada News - Castanet.net", "description": "Two years for killing wife - Canada News Castanet.net Montreal man sentenced to two years for killing of Alzheimer's-stricken wife CTV News Caregivers of elderly face stress, tears with scant support CBC News 'She was suffering too much': Montreal man who suf…", "url": "https://www.castanet.net/news/Canada/257354/Two-years-for-killing-wife", "urlToImage": "https://www.castanet.net/content/2019/5/pch10200831_p3388978.jpg", "publishedAt": "2019-05-29T04:00:00Z", "content": "Canada  \r\nHealth Canada has suspended the licences for Biocell breast implants because of an increased cancer risk.\r\nThe department says it has completed an update to a safety review, which was launched two years ago, and suspended the licences for Allergan's… [+30391 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Air Canada back to normal - Canada News - Castanet.net", "description": "Air Canada back to normal - Canada News Castanet.net Operations beginning to come back online after system-wide Air Canada outage CTV News Air Canada says technical systems 'beginning to come back online' CBC News Air Canada says network systems ‘resolved’ — …", "url": "https://www.castanet.net/news/Canada/257365/Air-Canada-back-to-normal", "urlToImage": "https://www.castanet.net/content/2019/5/CPT20900883_p3389074.jpg", "publishedAt": "2019-05-29T12:52:00Z", "content": "Canada  \r\nHealth Canada has suspended the licences for Biocell breast implants because of an increased cancer risk.\r\nThe department says it has completed an update to a safety review, which was launched two years ago, and suspended the licences for Allergan's… [+30391 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Tammy Porter", "title": "I Lost My Husband To Breast Cancer A Year Ago. This Is What I Want You To Know.", "description": "Just like every other challenge and illness, Mike faced this one head-on with absolute optimism.", "url": "https://www.huffpost.com/entry/lost-husband-male-breast-cancer_n_5cd513e6e4b0705e47d96b5a", "urlToImage": "https://img.huffingtonpost.com/asset/5cd67cb62100005800c5cd0f.jpeg?cache=zrkgbx0qno&ops=1910_1000", "publishedAt": "2019-05-14T12:30:21Z", "content": "My husband, Mike, had nine lives, or so it seemed. When we met, he told me of the numerous near-death experiences he had survived over the years too many details to list with the most noteworthy a result of a viral infection that led to a heart transplant at … [+12003 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Kyle Wiggers", "title": "Microsoft announces latest AI for Accessibility grant recipients", "description": "Microsoft has announced the latest beneficiaries of its AI for Accessibility grant program, which was first announced in 2018.", "url": "https://venturebeat.com/2019/05/15/microsoft-announces-latest-ai-for-accessibility-grant-recipients/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2019/05/microsoft.jpg?w=1200&strip=all", "publishedAt": "2019-05-16T04:00:59Z", "content": "Microsoft’s AI for Accessibility, which was unveiled in May 2018, is the Seattle company’s second so-called AI for Good program. It follows on the heels of — and was largely modeled after — the company’s AI for Earth, which provides training and resources to … [+5318 chars]"}]}