{"status": "ok", "totalResults": 1388, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "The Pakistani brides being trafficked to China", "description": "Officials say gangs of Chinese criminals are trafficking Pakistani women under the guise of marriage.", "url": "https://www.bbc.co.uk/news/world-asia-48260397", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/965E/production/_106949483_whbranded_newsappimage2019-04-26at12.43.00pm-1-2.png", "publishedAt": "2019-05-14T23:04:12Z", "content": "Image caption\r\n Sophia (right) married a Chinese man after her pastor made introductions\r\nThe marriage between a local Christian woman and a Chinese Christian man six months ago in the eastern Pakistani city of Faisalabad had all the signs of a perfect match.… [+7565 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Emily Ferguson", "title": "Meghan Markle’s touching advice to Prince Harry that helped repair bond with dad Charles - Express", "description": "Meghan Markle’s touching advice to Prince Harry that helped repair bond with dad Charles Express Harry and Meghan mark first year of marriage with previously unseen wedding photos Sky News Duke and Duchess of Sussex celebrate first wedding anniversary by shar…", "url": "https://www.express.co.uk/news/royal/1129195/meghan-markle-prince-harry-touching-advice-repair-bond-dad-prince-charles", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1129195.jpg", "publishedAt": "2019-05-19T11:43:00Z", "content": null}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Thousands of North Korean Women Are Being Forced Into China’s Sex Trade, a Report Says", "description": "A new report by the Korea Future Initiative says that Chinese traffickers earn $105 million a year from trafficking girls and young women", "url": "http://time.com/5593352/north-korea-women-sex-slavery-china/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/gettyimages-453432909.jpg?quality=85", "publishedAt": "2019-05-22T08:19:53Z", "content": "A new report says thousands of North Korean women and girls are being forced to into marriages and sex slavery in China.\r\nAn investigation by London-based non-profit Korea Future Initiative (KFI) conducted first-hand interviews over two years with 45 survivor… [+1689 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosie Perper", "title": "Thousands of North Korean women are being forced into sexual slavery in China, rights group says", "description": "Thousands of North Korean women and girls are sold and trafficked into sexual slavery in China, generating millions of dollars for local crime syndicates, according to a new report by London-based rights group Korea Future Initiative published Monday. Accordi…", "url": "https://www.businessinsider.com/north-korean-women-sexual-slavery-in-china-report-korea-future-initiative-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce3b18b021b4c12a21af212-960-480.jpg", "publishedAt": "2019-05-21T09:18:13Z", "content": "Thousands of North Korean women and girls are sold and trafficked into sexual slavery in China, generating millions of dollars for local crime syndicates, according to a new report by London-based rights group Korea Future Initiative published Monday. \r\n The … [+2810 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "North Korean women 'forced into sex slavery' in China - report", "description": "Thousands of North Korean women and girls are forced to work in China's sex trade, says a new report.", "url": "https://www.bbc.co.uk/news/world-asia-48340210", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/136AD/production/_107033597_10626355606_e0267b6c83_z.jpg", "publishedAt": "2019-05-20T18:57:14Z", "content": "Image copyrightKorea Future InitiativeImage caption\r\n The trade of North Korean women in China is worth $100m a year to criminal organisations\r\nThousands of North Korean women and girls are forced to work in the sex trade in China, according to a new report b… [+2472 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Elise Cole", "title": "I’m A Female Comedian. Here’s Why I Chose Not To Boycott Louis C.K.", "description": "I feel like I’m being forced to pick a side in an unwinnable battle.", "url": "https://www.huffpost.com/entry/louis-ck-minneapolis-boycott_n_5cdc35cee4b066205c5ff446", "urlToImage": "https://img.huffingtonpost.com/asset/5cdc38f12100003100d0ca97.jpeg?ops=1910_1000", "publishedAt": "2019-05-15T18:08:26Z", "content": "Im a stand-up comedian. I went to the open mic at Acme Comedy Co in downtown Minneapolis on Monday, May 6, 2019. I was there because that is where I go to practice my craft on Mondays. I was not there to make some kind of statement but as a woman in comedy, a… [+6724 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Taiwan Lays Down Historic Marker for Same-Sex Marriage in Asia", "description": "Lawmakers from President Tsai Ing-wen’s Democratic Progressive Party voted in favor of the bill drafted by Taiwan’s cabinet, rather than two rival proposals that would have limited rights and protections for same-sex couples. Tsai praised the vote in a tweet …", "url": "https://news.yahoo.com/taiwan-leader-stakes-career-landmark-210000685.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/mL9gZlp7I5HYYtDqlc7kyw--~B/aD0xOTM0O3c9MjkwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/bloomberg_politics_602/8138992a569554a1e8e7766ac5bd632b", "publishedAt": "2019-05-17T11:40:06Z", "content": "(Bloomberg) -- Taiwans ruling party forced through a landmark marriage-equality law in the face of staunch local opposition Friday, making it the first place in Asia to legalize same-sex unions.\r\nLawmakers from President Tsai Ing-wens Democratic Progressive P… [+4381 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Rosie Perper", "title": "Japan's labor minister says it's 'necessary' for women to wear heels at work despite mass backlash over the policy many are calling outdated", "description": "A Japanese minister defended workplace policies requiring women to wear high heels as \"necessary and reasonable,\" despite growing support of a petition to abolish the practice. The minister spoke out after an online petition created by 32-year-old Japanese ac…", "url": "https://www.insider.com/japan-labor-minister-heels-at-work-necessary-for-women-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf8a88cf2f47957b070ee74-2732-1366.jpg", "publishedAt": "2019-06-06T05:44:41Z", "content": "A Japanese minister defended workplace policies requiring women to wear high heels as \"necessary and reasonable,\" despite growing support of a petition to ban the practice.\r\n \"It's generally accepted by society that (wearing high heels) is necessary and reaso… [+2405 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Sahaj Kohli", "title": "What It’s Like To Be The First Woman In My Family In An Interracial Marriage", "description": "When I met my husband, I wasn’t making a conscious decision to be with someone who wasn’t Indian or Sikh.", "url": "https://www.huffpost.com/entry/choosing-interracial-marriage-sikhism_n_5d02841be4b0304a120bc888", "urlToImage": "https://img.huffingtonpost.com/asset/5d029739250000ae13e60aaf.jpeg?ops=1910_1000", "publishedAt": "2019-06-14T12:30:12Z", "content": "Growing up, my dad would repeat his house rule almost every week: When you get married, marry a Sikh.\r\nHe couldnt fathom that after moving to America for more opportunities for his family, one of his kids would make the mistake of losing touch with her roots.… [+10336 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Peter Sheridan", "title": "Clooney’s divorce, Obama’s divorce, and the truth about Brad & Jen, in this week’s dubious tabloids", "description": "How wrong can one story be?", "url": "https://boingboing.net/2019/06/06/clooneys-divorce-obamas.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/05/9165862441_a001e4780f_k.jpg", "publishedAt": "2019-06-06T19:27:06Z", "content": "How wrong can one story be?\r\nThe National Enquirer goes a long way to finding out with its latest cover proclaiming the end of George Clooneys marriage to human rights attorney Amal.\r\n$500 million Divorce Bombshell, it yells. \"Furious Clooney Takes The Twins!… [+5463 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Frida Garza on The Slot, shared by Frida Garza to Jezebel", "title": "Trump Reportedly Dumped Marla Maples Via FedEx", "description": "A new report from Vanity Fair reveals that Trump and Marla Maples’s prenup negotiations were, predictably, a nightmare, and that he all but forced her into accepting an agreement she didn’t think would fairly compensate her in the event of their divorce. He a…", "url": "https://theslot.jezebel.com/trump-reportedly-dumped-marla-maples-via-fedex-1835249938", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--YMAdc7Ve--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ckxk5cj78c5yktqdkocq.jpg", "publishedAt": "2019-06-04T22:10:00Z", "content": "A new report from Vanity Fair reveals that Trump and Marla Mapless prenup negotiations were, predictably, a nightmare, and that he all but forced her into accepting an agreement she didnt think would fairly compensate her in the event of their divorce. He acc… [+2777 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Kristin Samuelson-Northwestern", "title": "Teen depression treatment should extend to parents’ marriage", "description": "Parents often seek mental health treatment for a child struggling with depression, but the treatment shouldn't stop there, say researchers.", "url": "https://www.futurity.org/teen-depression-marriage-satisfaction-2079442-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/06/marriage_counseling_1600.jpg", "publishedAt": "2019-06-07T15:24:22Z", "content": "A teen’s depression can affect parents’ satisfaction in their marriage, research finds.\r\nParents often seek mental health treatment for a child struggling with depression, but the treatment shouldn’t stop with the depressed teen, suggests the study.\r\n“Familie… [+2741 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "‘Child marriage figures stand at 765 million’", "description": "Globally, 115 mn boys and men were married as children", "url": "https://www.thehindu.com/news/national/child-marriage-figures-stand-at-765-million/article27698542.ece", "urlToImage": "https://www.thehindu.com/news/national/bwnbz1/article27698540.ece/ALTERNATES/LANDSCAPE_615/THJC-WESTAFRICACHILDMARRIAGE", "publishedAt": "2019-06-08T15:53:18Z", "content": "An estimated 115 million boys and men around the world were married as children, UNICEF said on Friday in its first ever in-depth analysis of child grooms. Of these, one in five children, or 23 million, were married before the age of 15. \r\nUsing data from 82 … [+1623 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Cases of child marriage worry officials in Hassan", "description": "Recent instances of child marriage have left the district machinery worried. From January to April this year, 13 cases of child marriage were reported in the district. Besides this, in a couple of ins", "url": "https://www.thehindu.com/news/national/karnataka/cases-of-child-marriage-worry-officials-in-hassan/article27256439.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-05-26T18:41:50Z", "content": "Recent instances of child marriage have left the district machinery worried. From January to April this year, 13 cases of child marriage were reported in the district. \r\nBesides this, in a couple of instances, government officers and NGOs working for the welf… [+2237 chars]"}, {"source": {"id": "the-economist", "name": "The Economist"}, "author": null, "title": "Politics this week", "description": "Early results from India’s election, which was carried out in seven stages from mid-April, showed that the Bharatiya Janata Party led by Narendra Modi would remain in power. During the campaign, Mr Modi had stressed Hindu nationalism more than economic develo…", "url": "https://www.economist.com/the-world-this-week/2019/05/25/politics-this-week", "urlToImage": "https://cdn.static-economist.com/sites/default/files/images/2019/05/articles/main/20190525_wwp003.jpg", "publishedAt": "2019-05-23T14:58:20Z", "content": "Early results from Indias election, which was carried out in seven stages from mid-April, showed that the Bharatiya Janata Party led by Narendra Modi would remain in power. During the campaign, Mr Modi had stressed Hindu nationalism more than economic develop… [+5600 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Sonia Narang", "title": "Helen Clark Can Do It All: Run A Country, Fight For Women's Rights... And Snapchat", "description": "The former prime minister of New Zealand and gender equality champion is at the Women Deliver conference in Vancouver, where attendees treat her like a rock star.", "url": "https://www.npr.org/sections/goatsandsoda/2019/06/06/729918102/helen-clark-can-do-it-all-run-a-country-fight-for-womens-rights-and-snapchat", "urlToImage": "https://media.npr.org/assets/img/2019/06/05/unknown-1_wide-36cf61714c6233f4fe97858c344e6c37c4d608cf.jpeg?s=1400", "publishedAt": "2019-06-06T20:08:12Z", "content": "Helen Clark, former prime minister of New Zealand and gender equality champion, takes a selfie with attendees of the Women Deliver conference in Vancouver.\r\nSonia Narang for NPR\r\nHelen Clark, the former prime minister of New Zealand and champion of women's ri… [+4698 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Julia Naftulin", "title": "My in-laws drive me up a wall, but my partner loves spending time with them. How can I make the experience bearable?", "description": "Pop culture tends to portray in-laws as people you'll never relate to or enjoy spending time with, but in reality most people like the experiences they have with their partner's parents. If you feel bored or misunderstood, first tell your partner how you feel…", "url": "https://www.insider.com/what-to-do-if-you-dont-like-in-laws-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5cdb0340e9f08a35a5330cb0-1334-667.jpg", "publishedAt": "2019-05-14T18:03:00Z", "content": "Since we got married last year, my partner has stressed the importance of spending time with her parents. They live an hour away and we've been visiting them once a month, but I dread the trip every time and leave feeling like it was a waste of time. I don't … [+3849 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": null, "title": "N.L. voters re-elect Dwight Ball’s Liberals to form minority government - Global News", "description": "N.L. voters re-elect Dwight Ball’s Liberals to form minority government Global News Liberals to hold minority government in N.L., PCs not conceding defeat CBC News Newfoundland and Labrador wakes up to rare minority government after Liberal win CTV News In Ne…", "url": "https://globalnews.ca/news/5286644/nl-liberals-pcs-election/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2019/05/21082872.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2019-05-16T23:08:00Z", "content": "ST. JOHN’S, N.L. — Voters in Newfoundland and Labrador have elected a minority Liberal government, confounding critics and pollsters who said the incumbent party had been hobbled by a stalled economy and a disinterested electorate.\r\nWith most of the polls rep… [+5021 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Joseph Green", "title": "Match review UK: A user-friendly dating site for people who actually want something serious", "description": "Let's just state the obvious real quick: Dating can be an absolute nightmare. Blind dates are awkward, people become disinterested and ghost, and dating a close friend can end awkwardly. This is probably a pessimistic outlook, but sometimes, it genuinely seem…", "url": "https://mashable.com/uk/review/match-review-online-dating-uk/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F16%252Fdf%252Fa758e4250c8e4a40823a9173d21194ed.8ea9b.jpg%252F1200x630.jpg?signature=96BWmoZk0jQCJIHNNXl2Ufvsb6U=", "publishedAt": "2019-05-16T14:49:56Z", "content": "Let's just state the obvious real quick: Dating can be an absolute nightmare.\r\nBlind dates are awkward, people become disinterested and ghost, and dating a close friend can end awkwardly. This is probably a pessimistic outlook, but sometimes, it genuinely see… [+20662 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Isabella Steger", "title": "Thinking about a gay destination wedding in Taiwan? Not so fast", "description": "Gay couples where one party comes from a country that does not allow same-sex marriage are not yet allowed to marry in Taiwan.", "url": "https://qz.com/1626158/thinking-about-a-gay-destination-wedding-in-taiwan-not-so-fast/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/05/RTS27FZ4-e1558606270280.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-05-23T11:08:07Z", "content": "Taiwan made history last week by becoming the first place in Asia to legalize same-sex marriage. Activists, however, say the fight is not yet over.\r\nWhen same-sex couples will be officially allowed to register for marriage starting tomorrow (May 24), M.P. Tan… [+4080 chars]"}, {"source": {"id": null, "name": "Reviewed.com"}, "author": "Camryn Rabideau", "title": null, "description": "There are several items that make the worst wedding gifts, including thing like artwork, regifted presents, live animals, and more.", "url": "https://www.reviewed.com/home-outdoors/features/18-wedding-gifts-you-should-never-give", "urlToImage": "https://reviewed-com-res.cloudinary.com/image/fetch/s--aIEIt7-1--/b_white,c_fill,cs_srgb,f_auto,fl_progressive.strip_profile,g_center,q_auto,w_1200/https://reviewed-production.s3.amazonaws.com/1558556909915/lead.jpg", "publishedAt": "2019-05-28T18:31:39Z", "content": "Wedding gifts can be tricky. On one hand, choosing a random pot or pan off the couples registry seems impersonal and thoughtless. On the flip side? Its so easy to commit a faux pas when you go off-registry. \r\nIf you do want to pick a unique gift for the newly… [+8940 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Shawn Langlois", "title": "The Margin: Alabama Public Television refuses to air two gay cartoon animals getting married", "description": "While the rest of the country aired the Season 22 premier of “Arthur,” which included the same-sex wedding of two cartoon animals, Alabama Public Television instead decided to go with a less-controversial rerun. This is the South, after all.", "url": "https://www.marketwatch.com/story/alabama-public-television-refuses-to-air-two-gay-cartoon-animals-getting-married-2019-05-21", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HK009_alabam_MG_20190521124801.jpg", "publishedAt": "2019-05-21T18:34:40Z", "content": "This is not the kind of change Neil Young was referring to when he sang, Southern change gonna come at last in his 1970 anthem Southern Man. \r\nWhile the rest of the country aired the Season 22 premier of Arthur, which included the same-sex wedding of two cart… [+2595 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Visas of 90 Pakistani brides withheld by China over trafficking fears", "description": "According to the local media reports, poor Christians girls, are lured, with money and promises of 'good life', by the illegal matchmaking centres to marry Chinese men who are either visiting or working in Pakistan. Most of the girls reportedly became victims…", "url": "https://indianexpress.com/article/pakistan/visas-of-90-pakistani-brides-withheld-by-china-over-trafficking-fears-5728930/", "urlToImage": "https://images.indianexpress.com/2018/07/marriageb.jpg?w=759", "publishedAt": "2019-05-15T08:14:21Z", "content": "The Pakistan Government has recently ordered the Federal Investigating Agency (FIA) to take action against the gangs involved in smuggling of Pakistani girls to China on the pretext of contracting marriage.(Representational Image)\r\nAmidst a raging controversy… [+2454 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Ben Farmer, Nicola Smith", "title": "Oppressed, enslaved and brutalised: The women trafficked from North Korea into China's sex trade", "description": "Thousands of North Korean women and girls are being subjected to forced marriage, prostitution and sadistic abuse by trafficking gangs running a multi-million dollar illicit sex industry in China.", "url": "https://www.telegraph.co.uk/news/0/oppressed-enslaved-brutalised-women-trafficked-north-korea-chinas/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/19/20190516_telegraphAdhoc-7-xlarge_trans_NvBQzQNjv4BqZgEkZX3M936N5BQK4Va8RWtT0gK_6EfZT336f62EI5U.jpg", "publishedAt": "2019-05-20T08:00:00Z", "content": "Fast forward to 2019 and the US state department identifies China as a source and destination of trafficking, and a Tier 3 country  meaning it does not meet minimum standards and is not making significant efforts to do so.\r\nIts 2018 trafficking in persons rep… [+2024 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Gwen Ihnat on News, shared by Gwen Ihnat to The A.V. Club", "title": "Sammy Davis Jr.’s epic life reportedly on its way to becoming a miniseries", "description": "Old-school Hollywood continues to be a treasure trove for movies and TV projects. On the heels of recent productions like Feud and Fosse/Verdon, Deadline reports that Tom Hanks and Lee Daniels apparently want to get in on the TV biopic action with a miniserie…", "url": "https://news.avclub.com/sammy-davis-jr-s-epic-life-reportedly-on-its-way-to-be-1835276011", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Yls30OeY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/sqfe9rlktm2wdifsdgxv.jpg", "publishedAt": "2019-06-05T18:33:00Z", "content": "Old-school Hollywood continues to be a treasure trove for movies and TV projects. On the heels of recent productions like Feud andFosse/Verdon, Deadline reports that Tom Hanks and Lee Daniels apparently want to get in on the TV biopic action with a miniseries… [+1383 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "Marriage licenses end in Alabama? What's next, what it means if you're getting married - AL.com", "description": "Marriage licenses end in Alabama? What's next, what it means if you're getting married AL.com Alabama votes to end marriage licenses | TheHill The Hill Alabama lawmakers pass workaround bill on same-sex marriage NBC News Doctors question need for Alabama 'bor…", "url": "https://www.al.com/news/2019/05/marriage-licenses-end-in-alabama-whats-next-what-it-means-if-youre-getting-married.html", "urlToImage": "https://www.al.com/resizer/w6GIDC5Ns5hv7QCkXIPdgxEpcp4=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/NSVE2EWQWFBKLO3ITDIMJPJWM4.jpg", "publishedAt": "2019-05-24T17:30:00Z", "content": "A bill to end the issuance of marriage licenses in Alabama a process currently overseen by each countys probate judge is headed to Gov. Kay Ivey for her signature.\r\nHeres whats in the bill and what it means for those getting married and the rest of Alabamians… [+3056 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "1 in every 10 men in Nepal gets married underage: UNICEF", "description": "Using data from 82 countries, the study revealed that child marriage among boys is prevalent across many countries around the world, spanning sub-Saharan Africa, Latin America and the Caribbean, South Asia, and East Asia and the Pacific.", "url": "https://indianexpress.com/article/world/1-in-every-10-men-in-nepal-gets-married-underage-unicef-5769930/", "urlToImage": "https://images.indianexpress.com/2019/03/child_marriage-759.jpg?w=759", "publishedAt": "2019-06-07T12:22:11Z", "content": "In Nepal, one in every 10 men aged between 20 and 24 was married as a child, UNICEF said in its report. (Representational)\r\nNepal has been listed as one of the top 10 countries in the world where child marriage is rampant among boys, the United Nations Childr… [+1341 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "New York Times", "title": "Duped by ‘rich Chinese farmer’, Pakistan woman’s story reveals larger trafficking patterns", "description": "In recent weeks, Pakistan has been rocked by charges that at least 150 women were brought to China as brides under false pretences — not only lied to, but in some cases forced into prostitution.", "url": "https://indianexpress.com/article/pakistan/duped-by-rich-chinese-farmer-pakistan-womans-story-reveals-larger-trafficking-patterns-5751748/", "urlToImage": "https://images.indianexpress.com/2019/05/pakistan-china-759.jpg?w=759", "publishedAt": "2019-05-28T04:32:22Z", "content": "An undated handout image shows Rabia Kanwal and her husband, Zhang Shucheng, in Islamabad, Pakistan, January 2019. (Photo via The New York Times) \r\nWritten by Salman Masood and Amy Qin\r\nRabia Kanwals parents were sure her marriage to a wealthy Chinese Muslim … [+8576 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Ludmila Leiva, interviewed by Ludmila Leiva", "title": "I'm A First-Generation Latinx Woman & I Make $116K As A Marriage & Family Therapist", "description": "In our series My 6-Figure Paycheck, women making more than $100,000 open up about how they got there and what exactly they do. We take a closer look at what it feels like to be a woman making six-figures — when only 5% of American women make that much, accord…", "url": "https://www.refinery29.com/en-us/six-figure-paycheck-tktk", "urlToImage": "https://s3.r29static.com//bin/entry/b35/0,675,2000,1050/x,80/2186938/im-a-firstgeneration-latinx-woman-2186938.jpg", "publishedAt": "2019-05-24T15:30:00Z", "content": "Skip navigation!We noticed you're in Canada, would you like to see your local site? Click on the flag above to switch.\r\nNow ReadingI Make $116K As A Marriage &amp; Family Therapist\r\nIn our seriesMy 6-Figure Paycheck, women making more than $100,000 open up ab… [+6727 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Gabbi Shaw", "title": "A body language expert reveals what the relationship between Donald and Melania Trump is really like", "description": "Donald and Melania Trump have been married since 2005, long before his now-famous presidential campaign was underway. Since then, their marriage has weathered more than a few storms. Body language expert Patti Wood took a look at three photos of the Trumps du…", "url": "https://www.insider.com/donald-melania-trump-body-language-expert-analysis-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce2dd3ff2f47901af2436fa-1920-960.jpg", "publishedAt": "2019-05-20T16:59:03Z", "content": "According to Wood, this resembles the first lady that we see now, what Wood calls \"iconic Melania, the president's wife.\" \r\n She continued, \"He's reaching out, but reaching out and down. He often pushes her hand down when they hold hands, and he's lifting up … [+926 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Delhi confidential: What’s cooking?", "description": "Rahul Gandhi is abroad and the leadership vaccum has forced the Congress chief ministers to take matter into their own hands as there is not direction coming from the AICC. Personally, Nath is also perhaps trying to emerge as a central force among the party’s…", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-whats-cooking-kamal-nath-niti-aayog-amit-shah-5781527/", "urlToImage": "https://images.indianexpress.com/2019/05/kamal-nath-759.jpg?w=759", "publishedAt": "2019-06-14T19:45:32Z", "content": "Madhya Pradesh Chief Minister Kamal Nath\r\nOn the eve of the fifth meeting of the Governing Council of NITI Aayog to be chaired by Prime Minister Narendra Modi, Madhya Pradesh Chief Minister Kamal Nath had a dinner meeting with CMs of other Congress-ruled stat… [+1696 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Brianne Tracy", "title": "Tori Kelly on Her 'Awesome' First Year of Marriage and Expanding Her Family — with a Puppy!", "description": "The Jonas Brothers weren’t the only ones to turn the world premiere of their new documentary, Chasing Happiness, into a date night. At the event held in Los Angeles on Monday night, Tori Kelly brought along her husband, basketball player André Murillo, whom s…", "url": "https://people.com/music/tori-kelly-first-year-of-marriage-new-puppy/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/tori-kelly.jpg?crop=0px%2C66px%2C1800px%2C946px&resize=1200%2C630", "publishedAt": "2019-06-04T19:20:03Z", "content": "The Jonas Brothers weren’t the only ones to turn the world premiere of their new documentary, Chasing Happiness, into a date night.\r\nAt the event held in Los Angeles on Monday night, Tori Kelly brought along her husband, basketball player André Murillo, whom … [+1838 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Alexia Fernandez", "title": "Jada Pinkett Smith Says Will Smith 'Felt Abandoned’ When She Tried to Become More Independent", "description": "Jada Pinkett Smith is opening up about the strains in her marriage to Will Smith. On Monday’s episode of Facebook Watch’s Red Table Talk, the actress, 47, spoke to world-renowned therapist Esther Perel about trying to gain control of her life within and outsi…", "url": "https://people.com/movies/jada-pinkett-smith-says-will-smith-felt-abandoned-marriage-independence/", "urlToImage": "https://peopledotcom.files.wordpress.com/2018/10/will-jada.jpeg?crop=0px%2C246px%2C2000px%2C1051px&resize=1200%2C630", "publishedAt": "2019-06-10T21:01:13Z", "content": "Jada Pinkett Smith is opening up about the strains in her marriage to Will Smith.\r\nOn Monday’s episode of Facebook Watch’s Red Table Talk, the actress, 47, spoke to world-renowned therapist Esther Perel about trying to gain control of her life within and outs… [+3303 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Philip Wen", "title": "China dreams on hold: heartland city feels chill of economic slowdown", "description": "For the last decade, the city of Zhengzhou has been getting a taste of the Chinese dream.", "url": "https://www.reuters.com/article/us-china-economy-henan-socialmobility-in-idUSKCN1SY017", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190528&t=2&i=1391678953&w=1200&r=LYNXNPEF4R01E", "publishedAt": "2019-05-28T06:15:27Z", "content": "ZHENGZHOU, China (Reuters) - For the last decade, the city of Zhengzhou has been getting a taste of the Chinese dream. \r\nFueled by investment, including large subsidies from the central government in Beijing, the provincial capital of the inland province of H… [+8264 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "peterdeadline", "title": "Laszlo Barna’s Pier 21 Films Options Teen Bride Memoir ‘A Good Wife: Escaping The Life I Never Chose’", "description": "EXCLUSIVE: Canadian producer Pier 21 Films, set up by former eOne Television chief Laszlo Barna, is to adapt A Good Wife: Escaping The Life I Never Chose, the story of a teen bride being forced to move to Canada, into a television series. The company has opti…", "url": "https://deadline.com/2019/06/a-good-wife-pier-21-films-1202627341/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2019/06/samrazafar.jpg?w=750", "publishedAt": "2019-06-05T14:01:10Z", "content": "EXCLUSIVE: Canadian producer Pier 21 Films, set up by former eOne Television chief Laszlo Barna, is to adapt A Good Wife: Escaping The Life I Never Chose, the story of a teen bride being forced to move to Canada, into a television series.\r\nThe company has opt… [+2673 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Diane Herbst", "title": "Heiress Scammed Celebrity Hairstylist Into 'Lavish Wedding' & Sham Marriage as PR Stunt: Lawsuit", "description": "At their lavish wedding at a Utah resort, heiress Andi Potamkin and celebrity hairstylist William Jordan Blackmore exchanged rings and said, “I do.” Their friend and yoga instructor, Dana Rizer, officiated and pronounced the couple married during the November…", "url": "https://people.com/human-interest/william-jordan-blackmore-scammed-heiress-sham-marriage-lawsuit/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/05/andi-potamkin.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "publishedAt": "2019-05-15T00:56:35Z", "content": "At their lavish wedding at a Utah resort, heiress Andi Potamkin and celebrity hairstylist William Jordan Blackmore exchanged rings and said, “I do.” Their friend and yoga instructor, Dana Rizer, officiated and pronounced the couple married during the November… [+3445 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Char Adams", "title": "New Mom Forced to Pay Former Employer Thousands After Switching Jobs During Maternity Leave", "description": "Emily Manley, of Iowa, says she never imagined that taking time off from work to give birth would lead to a hefty bill. Manley, who has a 3-month-old son Jettson, says her former employer is forcing her to pay over $2,600 after she switched jobs following her…", "url": "https://people.com/human-interest/new-mom-forced-pay-maternity-leave-company/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/05/emily-manely.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "publishedAt": "2019-05-15T22:18:27Z", "content": "Emily Manley, of Iowa, says she never imagined that taking time off from work to give birth would lead to a hefty bill.\r\nManley, who has a 3-month-old son Jettson, says her former employer is forcing her to pay over $2,600 after she switched jobs following he… [+3229 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Swati Deshpande", "title": "#MenToo: Karan's bail hearing to continue today", "description": "In a three way hearing of actor Karan Oberoi’s bail plea on Thursday, his defence counsel was vociferous that rape case filed by a tantric and healer 'inspires no confidence' and is a 'misuse of rape law' in a relationship that was 'consensual'.", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/mentoo-custody-not-justified-over-false-rape-case-argues-actor-karan-oberois-lawyer/articleshow/69365008.cms", "urlToImage": "https://static.toiimg.com/photo/msid-69365028/69365028.jpg?22132", "publishedAt": "2019-05-16T18:44:44Z", "content": "In a three way hearing of actor Karan Oberois bail plea on Thursday, his defence counsel was vociferous that rape case filed by a tantric and healer 'inspires no confidence' and is a 'misuse of rape law' in a relationship that was 'consensual', while the pros… [+6139 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "For Gaza grooms, crippling debt overshadows marital bliss", "description": "Many have tried to renegotiate their debts. Others have gone into hiding and some have ended up in jail.", "url": "https://www.thehindu.com/news/international/for-gaza-grooms-crippling-debt-overshadows-marital-bliss/article27215394.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-05-23T06:08:08Z", "content": "Hundreds of young men in the Gaza Strip have turned to a small industry of lenders in the coastal territory to help them pay for their weddings, only to fall onto hard times because of crushing debt and a lack of jobs. \r\nMany have tried to renegotiate their d… [+463 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": "Reuters", "title": "UN report finds 115 million child grooms globally", "description": "About 115 million boys were married off as children, with one in five wed before they turned 15, according to the first United Nations study to track the prevalence of child grooms.", "url": "https://www.cbc.ca/news/world/child-grooms-united-nations-report-1.5165922", "urlToImage": "https://i.cbc.ca/1.5165958.1559869668!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/nicaragua-child.JPG", "publishedAt": "2019-06-07T01:16:38Z", "content": "About 115 million boys were married off as children, with one in five wed before they turned 15, according to the first United Nations study to track the prevalence of child grooms.\r\nThe UN children's agency, UNICEF, analyzed marriage and population data acro… [+1699 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Millions of child grooms forced into marriage, UN says", "description": "Some 115 million boys worldwide entered marriage before the age of 18, a new study by the UN's children's agency shows. The marriage of minors \"steals childhood,\" UNICEF's executive director said.", "url": "https://www.dw.com/en/millions-of-child-grooms-forced-into-marriage-un-says/a-49096258", "urlToImage": "https://www.dw.com/image/49096289_304.jpg", "publishedAt": "2019-06-07T06:04:00Z", "content": "Child marriage is a problem that affects girls as well as boys, with early wedlock damaging children's chances of gaining a proper education and having good work opportunities, UNICEF said.\r\nSome 115 million men now aged between 20 and 24 were married off bef… [+1517 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Danette Chavez on TV Club, shared by Danette Chavez to The A.V. Club", "title": "An exhilarating Fleabag sets some boundaries while breaking down others", "description": "What is it about fancy parties that brings out the worst in everyone but Fleabag? The opening reception for Godmother’s “Sexhibition” in the season-one finale saw Fleabag get dumped by Arsehole Guy, but only after being made to work the event and pick out a m…", "url": "https://tv.avclub.com/an-exhilarating-fleabag-sets-some-boundaries-while-brea-1834875978", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--uhPj8A1o--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cq5vowpnhr1qx2sseeqa.png", "publishedAt": "2019-05-19T18:15:00Z", "content": "What is it about fancy parties that brings out the worst in everyone but Fleabag? The opening reception for Godmothers Sexhibition in the season-one finale saw Fleabag get dumped by Arsehole Guy, but only after being made to work the event and pick out a mold… [+7339 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ruby McConnell", "title": "My Husband And I Left Our Spouses To Be Together. Here’s What I Learned.", "description": "The judgment we faced from some of our family members and friends was the least of our worries.", "url": "https://www.huffpost.com/entry/leaving-marriage-for-new-partner_n_5ceff4a5e4b0888f89d274bb", "urlToImage": "https://img.huffingtonpost.com/asset/5cf004e9210000e108e6807b.jpeg?ops=1910_1000", "publishedAt": "2019-06-01T13:00:11Z", "content": "Paul and I were friends for 16 years before we realized we were in love. After that, it took us less than a week to decide to leave our spouses for each other.\r\nWait, its not as simple as that. Let me explain.\r\nFirst, we werent friends in any traditional sens… [+12839 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Michael Reichert Ph.D.", "title": "Love, Sex, and Emotion in Boys' Development", "description": "Behind masks forced upon them, boys can look like the sex-obsessed machines they are portrayed as. But provided with opportunities to be themselves, they long for connection.", "url": "https://www.psychologytoday.com/ca/blog/the-power-connection/201906/love-sex-and-emotion-in-boys-development", "urlToImage": "", "publishedAt": "2019-06-14T16:43:49Z", "content": "I have the rare privilege of bearing witness to boys hearts. As they share those places where they register their trials, trauma and tribulations, often their hurt rises up in sobs, bursts of rage or throbbing heartache. Over the decades I have led the emotio… [+7966 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Maurie Backman)", "title": "Younger Americans Refuse to Overspend on Engagement Rings, a Survey Shows", "description": "Talk about setting some smart priorities.", "url": "https://www.fool.com/retirement/2019/06/06/younger-americans-refuse-to-overspend-on-engagemen.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/527766/proposal_gettyimages-491923890.jpg", "publishedAt": "2019-06-06T23:36:00Z", "content": "It's no secret that getting married is expensive. And a big part of the cost comes in the form of the engagement ring that starts it all.\r\nFor years, the convention was to spend three months' salary on an engagement ring (or at least that's what advertisers w… [+2972 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Ginger Rough, USA TODAY", "title": "Saying ‘Game of Thrones' fans should regret naming kids after Daenerys is sexist. Stop it!", "description": "No one suggested parents regret choosing Dexter, a serial killer, or Kylo (Ren), a warrior committed to the Dark Side, when their names were popular.", "url": "https://www.usatoday.com/story/life/allthemoms/2019/05/14/stop-saying-game-thrones-fans-should-regret-naming-kids-daenerys-because-it-is-sexist/3669642002/?utm_source=google&utm_medium=amp&utm_campaign=speakabl", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/14/USAT/c9b196f4-e9eb-46df-84bd-ce31707820cc-Dany_on_Game_of_Thrones.jpg?crop=539,303,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-15T00:00:48Z", "content": "Suddenly, some blogs would have us believe that the \"Game of Thrones\" names \"Khaleesi and Daenerys\" won't be so popular among new parents. Don't be too sure.\r\n (Photo: HBO)\r\nSpoiler alert: This story contains significant details about Sunday's episode of HBO'… [+6299 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Opinion contributors, Kevin Roster, Opinion contributors", "title": "I'm dying from cancer. I have to move across the country to die on my own terms", "description": "There's no reason anyone with a terminal disease should not have the option to avoid intolerable pain. I don't want to go out choking on my own blood.", "url": "https://www.usatoday.com/story/opinion/2019/06/07/medical-aid-dying-face-death-own-terms-column/1365567001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/06/06/USAT/87b82363-1906-4c65-b85e-2830e8404a10-XXX_CP_Kevin_Roster_poker_player_138064_08.JPG?crop=2999,1687,x1,y222&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-07T07:00:07Z", "content": "I am a 36-year-old dad who is dying of a rare cancer called sarcoma, which invades the bodys connective tissues, including the nerves, muscles, joints, bone, fat and blood vessels.\r\nSarcoma makes up only about 1% of adult cancers and is often diagnosed when i… [+5653 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "China: Thousands of North Korean women forced into prostitution: report", "description": "A UK-based organization has documented widespread violence against women in North Korea, claiming that thousands of the communist country's women are being subjected to forced marriage and prostitution in China.", "url": "https://www.dw.com/en/china-thousands-of-north-korean-women-forced-into-prostitution-report/a-48808827", "urlToImage": "https://www.dw.com/image/17677003_304.jpg", "publishedAt": "2019-05-20T18:07:00Z", "content": "A report published by the Korea Future Initiative, a London-based NGO, reveals that thousands of North Korean women and girls are being subjected to forced marriage and prostitution in China.\r\nThe report, which was presented in the UK Parliament on Monday, fo… [+7665 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Natalie Stone", "title": "The Gosselins' Marriage Ended 10 Years Ago: How Kate Overcame the Shocking Split", "description": "One decade ago, Kate Gosselin ‘s world was turned upside down. In 2009, Kate and her then-husband Jon Gosselin were starring on the hit TLC series Jon & Kate Plus Eight with their eight children: twins Mady and Cara, now 18, and 15-year-old sextuplets Hannah,…", "url": "https://people.com/tv/kate-gosselin-divorced-jon-gosselin-10-years-ago/", "urlToImage": "https://peopledotcom.files.wordpress.com/2017/08/jon-kate-gosselin.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "publishedAt": "2019-05-17T20:15:40Z", "content": "One decade ago, Kate Gosselin‘s world was turned upside down.\r\nIn 2009, Kate and her then-husband Jon Gosselin were starring on the hit TLC series Jon &amp; Kate Plus Eight with their eight children: twins Mady and Cara, now 18, and 15-year-old sextuplets Han… [+15202 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Erika W. Smith, written by Erika W. Smith", "title": "These Wedding Night Sex Stories Are Funny, Sexy, & Incredibly Memorable", "description": "Even in an era when the majority of couples have sex before marriage, there’s still an allure around the wedding night. Brides pick out expensive lingerie, hotels offer luxurious wedding suites, and friends tease the newlyweds about consummating the marriage.…", "url": "https://www.refinery29.com/en-us/wedding-sex-stories", "urlToImage": "https://s3.r29static.com//bin/entry/81d/0,504,2000,1050/x,80/2194367/these-wedding-night-sex-stories-2194367.jpg", "publishedAt": "2019-06-07T14:41:51Z", "content": "Skip navigation!\r\nNow ReadingWhat Wedding Night Sex Is Really Like\r\nEven in an era when the majority of couples have sex before marriage, theres still an allure around the wedding night. Brides pick out expensive lingerie, hotels offer luxurious wedding suite… [+1453 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Will Yakowicz, Forbes Staff, Will Yakowicz, Forbes Staff https://www.forbes.com/sites/willyakowicz/", "title": "When We Exposed Keith Raniere, The Leader Of The Nxivm ‘Sex Cult’", "description": "In this 2003 cover story, Forbes first raised questions about Keith Raniere—who now stands trial for charges that include sex-trafficking and forced labor involving his alleged cult, Nxivm.", "url": "https://www.forbes.com/sites/willyakowicz/2019/05/15/keith-raniere-the-leader-of-the-nxivm-sex-cult/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5cdb11de169cc600095f4077%2F960x0.jpg%3FcropX1%3D33%26cropX2%3D1562%26cropY1%3D18%26cropY2%3D878", "publishedAt": "2019-05-15T10:00:00Z", "content": "Beginning in 1998, Keith Raniere attracted thousands of acolytes to his self-help groups headquarters near Albany, New York, with the promise of life-transforming classes. Raniere didnt just promise to unlock clients greater potential; he claimed that his met… [+38043 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Salman Masood and Amy Qin", "title": "She Thought She’d Married a Rich Chinese Farmer. She Hadn’t.", "description": "Pakistan has charged dozens of people with trafficking women to China as wives. Rabia Kanwal was one bride who says she was lied to. In China, her husband has a different story.", "url": "https://www.nytimes.com/2019/05/27/world/asia/pakistan-china-trafficking.html", "urlToImage": "https://static01.nyt.com/images/2019/05/16/world/00pakistan-china-2/00pakistan-china-2-facebookJumbo.jpg", "publishedAt": "2019-05-27T07:58:40Z", "content": "Outside the family home, Mr. Zhangs mother, who is in her 60s, recalled being puzzled by Ms. Kanwals reactions.\r\nShe is religious, so when she came here I went out of my way not to give her any pork, she said, as a small guard dog barked nearby. I stir-fried … [+1748 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Patti Verbanas-Rutgers", "title": "Child abuse linked to elder abuse of Chinese Americans", "description": "Chinese American older adults who reported a history of child abuse were twice as likely to experience domestic violence and elder abuse later on.", "url": "https://www.futurity.org/elder-abuse-violence-2067192-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/05/elderly_hands_1600.jpg", "publishedAt": "2019-05-20T18:36:23Z", "content": "Chinese Americans abused as children and those who experienced intimate partner violence face an increased risk of abuse when they are elderly, according to a new study.\r\nResearchers surveyed 3,157 Chinese American adults over age 60 and found that those who … [+2828 chars]"}, {"source": {"id": null, "name": "Patheos.com"}, "author": "Hemant Mehta", "title": "Alabama PBS Affiliate Refuses to Show “Arthur” Episode Featuring Gay Rat Wedding", "description": "In Alabama, a 12-year-old rape victim can now be forced to give birth against her will, but gay cartoon rats?! NEVER!", "url": "https://friendlyatheist.patheos.com/2019/05/21/alabama-pbs-affiliate-refuses-to-show-arthur-episode-featuring-gay-rat-wedding/", "urlToImage": "https://wp-media.patheos.com/subdomain/sites/8/2019/05/RatburnMarryingArthur-768x431.png", "publishedAt": "2019-05-21T14:15:29Z", "content": "A PBS station in Alabama is refusing to show the episode of the kids TV series Arthur that featured a gay rat getting married to his partner. Alabama Public Television chose to show a rerun instead… which means that a state where legislators voted to force ch… [+2676 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "James Whitbrook", "title": "If You're Going to Miss Jessica Jones, Her Current Comics Are the Perfect Pick Me Up", "description": "At the end of next week, Jessica Jones—and the Marvel Netflix adventure that began just four years ago—will come to an end. But if you’re already getting a Jess-level amount of pre-drinking in before you prepare to say goodbye, not all is lost when it comes t…", "url": "https://io9.gizmodo.com/if-youre-going-to-miss-jessica-jones-her-current-comic-1835364557", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--i8-Bq8HH--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/endx1qnttduulisxkwzu.png", "publishedAt": "2019-06-10T22:45:00Z", "content": "At the end of next week, Jessica Jonesand the Marvel Netflix adventure that began just four years agowill come to an end. But if youre already getting a Jess-level amount of pre-drinking in before you prepare to say goodbye, not all is lost when it comes to A… [+6204 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Andrew Desiderio", "title": "Khashoggi's fiancée pleads with U.S. to hold Saudi Arabia accountable for journalist's murder", "description": "“Every day, I have nightmares thinking of Jamal’s suffering,” she says.", "url": "https://www.politico.com/story/2019/05/16/jamal-khashoggi-saudi-arabia-1328882", "urlToImage": "https://static.politico.com/73/09/6f2bcd87422e8bfcf423e5db316c/19516-hatice-cengiz-gty-773.jpg", "publishedAt": "2019-05-16T19:01:24Z", "content": "Ozan Kose/AFP/Getty Images\r\nJamal Khashoggis fiancée Hatice Cengiz offered pointed criticisms of the Trump administrations response to the slain Saudi journalist's brutal 2018 murder, pleading with the United States and other western governments to hold Saudi… [+3004 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Joan Summers", "title": "This Week In Tabloids: Priyanka Chopra Jonas Demanded A Retraction Because She's 'Very Much In Love'", "description": "Welcome to Jezebel’s Midweek Madness, where local menace Joan Summers has received a mysterious package in the mail. A strange and anonymous person in a trench coat, fake mustache, and Party City wig delivered it to my front door this morning. Inside the pack…", "url": "https://jezebel.com/this-week-in-tabloids-priyanka-chopra-jonas-demanded-a-1834760245", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--wxogqjWE--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qqf7unbekrszdwx2g0ng.jpg", "publishedAt": "2019-05-15T17:00:00Z", "content": "Welcome to Jezebels Midweek Madness, where local menace Joan Summers has received a mysterious package in the mail. A strange and anonymous person in a trench coat, fake mustache, and Party City wig delivered it to my front door this morning. Inside the packa… [+14506 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Crossing Divides: The Sri Lankan civil war enemies who fell in love", "description": "Gauri Malar and Roshan Jayathilake were bitter foes during Sri Lanka's civil war, then they fell in love.", "url": "https://www.bbc.co.uk/news/world-asia-48540002", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/14483/production/_107257038_2592313d-92f7-4f21-a43c-79d95d9ab095.jpg", "publishedAt": "2019-06-12T23:14:06Z", "content": "To watch Gauri Malar and Roshan Jayathilake playing with their 11-month-old daughter, you'd never guess that just 10 years ago they were mortal enemies.\r\nGauri, 26, was a child soldier for the separatist Tamil Tigers, fighting what they saw as an oppressive r… [+5795 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Nikita Malik, Contributor, Nikita Malik, Contributor https://www.forbes.com/sites/nikitamalik/", "title": "Here's How We Can Overcome The Obstacles In Ending Honour-Based Violence", "description": "We must focus on regularly publishing statistics on the extent of HBV, ensure that victims are given support, and stress that testimonies are taken seriously. By ratifying the Istanbul Convention, the UK will solidify its efforts to extradite those who must b…", "url": "https://www.forbes.com/sites/nikitamalik/2019/06/03/heres-how-we-can-overcome-the-obstacles-in-ending-honour-based-violence/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fa88e58ff656a465aa21496338c6629e6%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-06-03T16:30:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nPeople, mostly women, march during a protest marking the International Women's Day in Brussels, Friday, March 8, 2019. Marches and protests are held Friday across the globe to mark International Women's … [+10467 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Matt McNulty", "title": "Ree Drummond Says Her Ranch Is 'Fine' After Tornadoes—But 'Many of Our Oklahoma Neighbors Are Not'", "description": "Ree Drummond’s Pawhusha, Oklahoma ranch is “fine” after tornadoes ripped through the state this past weekend, according to the Food Network star. The Pioneer Woman assured fans that her family and home were unscathed by the deadly tornadoes that leveled a mot…", "url": "https://people.com/food/ree-drummond-oklahoma-ranch-tornado/", "urlToImage": "https://peopledotcom.files.wordpress.com/2017/11/ree-drummond.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "publishedAt": "2019-05-28T18:46:23Z", "content": "Ree Drummond’s Pawhusha, Oklahoma ranch is “fine” after tornadoes ripped through the state this past weekend, according to the Food Network star.\r\nThe Pioneer Woman assured fans that her family and home were unscathed by the deadly tornadoes that leveled a mo… [+1521 chars]"}, {"source": {"id": "daily-mail", "name": "Daily Mail"}, "author": "https://www.facebook.com/DailyMail", "title": "Tracey Cox reveals signs that show second marriage will work", "description": "Sex and relationship expert Tracey Cox reveals that most people getting married for a second time have accepted the wise adage: Do you want to be right or do you want to be married?", "url": "https://www.dailymail.co.uk/femail/article-7079875/Tracey-Cox-reveals-signs-second-marriage-work.html", "urlToImage": "https://i.dailymail.co.uk/1s/2019/05/29/09/14089314-0-image-a-2_1559117055730.jpg", "publishedAt": "2019-05-29T08:21:12Z", "content": "Meghan is on her second marriage, so is Jude Law. Idris Elbas working on the third time lucky formula and J-Lo is engaged for the sixth time to her about to be fourth husband.\r\nWe all vow well never go there again and yet, there we are, all bright-eyed and lo… [+11826 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "John Wasik, Contributor, John Wasik, Contributor https://www.forbes.com/sites/johnwasik/", "title": "5 Solid Paths To Retirement Security", "description": "Want to successfully retire? Here are 5 key factors.", "url": "https://www.forbes.com/sites/johnwasik/2019/06/10/5-solid-paths-to-retirement-security/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F521085356%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-06-10T13:20:00Z", "content": "When you look at the research on retirement success, the same factors keep popping up. Saving enough money, of course, really helps, but there are some solid reasons why some do better in retirement than others.Boston University Sociologist Deborah Carr, howe… [+5306 chars]"}, {"source": {"id": null, "name": "Houzz.com"}, "author": "Victoria Villeneuve", "title": "Design Through the Decades: The 1950s (30 photos)", "description": "This series looks back at iconic designs from each decade, starting in 1900. This installment covers such midcentury classics as the Tulip table, Diamond and Egg chairs,...", "url": "https://www.houzz.com/magazine/design-through-the-decades-the-1950s-stsetivw-vs~121911434", "urlToImage": "https://st.hzcdn.com/simgs/ebd11083069f01ce_4-7554/midcentury.jpg", "publishedAt": "2019-06-01T13:00:20Z", "content": "First Lady PinkMamie Eisenhower knew a thing or two about making the White House a home when she and Ike moved in, in 1953. She estimated that it was their 33rd residence in 37 years of marriage and, for decorating expediency, she carried around a stick paint… [+1622 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "By Pilar.Melendez@thedailybeast.com (Pilar Melendez)", "title": "Allison Mack Kept Sex Slave Photos for Blackmail, Ex-NXIVM Member Testifies", "description": "REUTERS The founder of the alleged cult NXIVM forced member Allison Mack to store naked photos of women branded with his initials to blackmail them into becoming sex slaves, a former member testified in court Monday. Lauren Salzman said in Brooklyn federal co…", "url": "https://www.thedailybeast.com/allison-mack-kept-sex-slave-photos-for-blackmail-ex-nxivm-member-testifies", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1981,w_3522,x_0,y_28/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1558376152/RTS1PW68_yfunhr", "publishedAt": "2019-05-20T18:37:28Z", "content": "The founder of the alleged cult NXIVM forced member Allison Mack to store naked photos of women branded with his initials to blackmail them into becoming sex slaves, a former member testified in court Monday. \r\nLauren Salzman said in Brooklyn federal court Ma… [+4016 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": "Laura Sirikul", "title": "25 Amazing Books by Asian American and Pacific Islander Authors You Need to Read", "description": "May is Asian American Pacific Islander Heritage Month, and there are plenty of books to crack open in honor of the holiday. Here are a few to start with.", "url": "http://mentalfloss.com/article/583476/amazing-books-asian-american-and-pacific-islander-authors", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1148,w_2044,x_0,y_27/v1558631750/shape/mentalfloss/583476-photocollageshaunacyferro.jpg?itok=IDiPr5vG", "publishedAt": "2019-05-24T18:00:00Z", "content": "May is Asian American Pacific Islander Heritage Month, which celebrates the lives and contributions of inspiring Asian Americans and Pacific Islanders through various mediums. In honor of the holiday, here are 25 books from Asian American and Pacific Islander… [+15686 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Christina Cauterucci", "title": "Men Are Sharing Their Abortion Stories on Social Media. Is That Helpful?", "description": "They might not be the most important voices for reproductive rights. But right now, the movement could use all the voices it can get.", "url": "https://slate.com/news-and-politics/2019/05/abortion-alabama-missouri-men-social-media-stories.html", "urlToImage": "https://compote.slate.com/images/fdc13592-1b6b-47d4-b9ac-6d97d186a60a.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2019-05-17T23:23:25Z", "content": "Some men have been tweeting about abortions in their own pasts.\r\nAlabamas Extremist Abortion Bill Ruins John Roberts Roe Plan\r\nWhy the Anti-Abortion Movement Stopped Making Allowances for Rape and Incest\r\nWar With Iran Wouldnt Be Like Iraq. It Would Be Worse.… [+9718 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Kim Renfro", "title": "Daenerys Targaryen's downfall on 'Game of Thrones' aligns brilliantly with George R.R. Martin's beliefs about the troubling morals of war", "description": "Warning: Spoilers ahead for the series finale of HBO's \"Game of Thrones.\" With Daenerys Targaryen's rise to power and fall into violent destruction, George R.R. Martin crafted one of the most brilliant fantasy characters of all time. Her arc is about the inhe…", "url": "https://www.insider.com/game-of-thrones-daenerys-george-rr-martin-morality-war-violence-2019-5", "urlToImage": "https://amp.businessinsider.com/images/57911c60dd089552598b4acf-1920-960.jpg", "publishedAt": "2019-05-20T03:41:05Z", "content": "The final season of HBO's \"Game of Thrones\" brought Daenerys Targaryen, one of the show's long-admired protagonists, into unprecedented horrific territory when she burned hundreds of thousands of innocent people alive as she destroyed King's Landing. \r\n By th… [+13028 chars]"}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Eric Kohn", "title": "Cannes 2019: Palme d’Or Winner ‘Parasite’ Defined a Year of Movies About Class Warfare", "description": "Bong Joon-ho's brilliant family saga captured modern anxieties, but it wasn't alone.", "url": "https://www.indiewire.com/2019/05/cannes-palme-dor-analysis-parasite-1202144914/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2019/05/ahuZpSlA.jpeg", "publishedAt": "2019-05-26T01:22:20Z", "content": "Bong Joon-ho’s Palme d’Or winner “Parasite” revolves around a family that overtakes a wealthy residence, bit by bit, but the best sequence finds them trapped. When an unexpected development (no spoilers here) puts their scheme at risk, they’re forced to hide … [+5338 chars]"}, {"source": {"id": null, "name": "Dailywire.com"}, "author": "Paul Bois", "title": "California City Officials Fight To Keep Chick-Fil-A From Doing Business - The Daily Wire", "description": "California City Officials Fight To Keep Chick-Fil-A From Doing Business The Daily Wire Another city has taken up the torch in the Left's ongoing quest to hound fast-food giant Chick-fil-A.", "url": "https://www.dailywire.com/news/48127/california-city-fights-keep-chick-fil-doing-paul-bois", "urlToImage": "https://www.dailywire.com/sites/default/files/styles/open_graph/public/uploads/2019/05/chick-fil-a.jpg?itok=ZTYxhwTr", "publishedAt": "2019-06-06T20:39:00Z", "content": "Another city has taken up the torch in the Left's ongoing quest to hound fast-food giant Chick-fil-A.\r\n\"A San Mateo County official is pushing to stop a Chick-fil-A restaurant from opening up in Redwood City,\" reports CBS Local news. \"The McDonalds restaurant… [+3471 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Bindu Shajan Perappadan", "title": "‘Children of today better off than 20 years ago’", "description": "Report also warns that the number of them living in war zones or forced to flee homes has gone up", "url": "https://www.thehindu.com/news/national/children-of-today-better-off-than-20-years-ago/article27356776.ece", "urlToImage": "https://www.thehindu.com/news/national/pch0sg/article27356775.ece/ALTERNATES/LANDSCAPE_615/THJC-SCHOOLREOPENSTUDENTS", "publishedAt": "2019-05-30T16:55:45Z", "content": "Children born today have a better chance than at any time in history to grow up healthy, educated and protected, with the opportunity to reach their full potential, says the Global Childhood Report recently released by Save the Children, an NGO working for th… [+1808 chars]"}, {"source": {"id": null, "name": "Jezebel.com"}, "author": "Joan Summers", "title": "Uh Oh, The Tabloids Got Their Hands On Snapchat's 'Gender Swap' Filter!", "description": "Welcome to Jezebel’s Midweek Madness, where local menace Joan Summers has just learned that Leighton Meester and Gywneth Paltrow starred in Country Strong together. Would anyone like to take my hand and believe in a world where Goop asked her publicist to cal…", "url": "https://jezebel.com/uh-oh-the-tabloids-got-their-hands-on-snapchats-gender-1835080395", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--_6CFYg2f--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qhcxfgxz5zzjznmswvfh.jpg", "publishedAt": "2019-05-29T17:00:00Z", "content": "Welcome to Jezebels Midweek Madness, where local menace Joan Summers has just learned that Leighton Meester and Gywneth Paltrow starred in Country Strong together. Would anyone like to take my hand and believe in a world where Goop asked her publicist to call… [+12463 chars]"}, {"source": {"id": null, "name": "Dlisted.com"}, "author": "Allison", "title": "The Rumors About Rose Hanbury Hurt Duchess Kate And Prince William’s Marriage", "description": "Prince William and Duchess Kate are as close as we can get to a real-life version of The Heart Family. But as we all know, The Royal Heart Family recently experienced a dramatic cheating scandal when it was rumored that Prince William cheated with Duchess Kat…", "url": "http://dlisted.com/2019/06/12/the-rumors-about-rose-hanbury-hurt-duchess-kate-and-prince-williams-marriage/", "urlToImage": "http://dlisted.com/wp-content/uploads/2019/06/wenn36577585.jpg", "publishedAt": "2019-06-12T17:12:49Z", "content": "Prince William and Duchess Kate are as close as we can get to a real-life version of The Heart Family. But as we all know, The Royal Heart Family recently experienced a dramatic cheating scandal when it was rumored that Prince William cheated with Duchess Kat… [+2074 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Erin Handley", "title": "'We were forced to mate like dogs': The Handmaid's Tale was real life for Khmer Rouge survivors", "description": "For Cambodian women living under the Khmer Rouge regime, the reproductive violence depicted in The Handmaid's Tale's dystopia is far from a fiction.", "url": "https://www.abc.net.au/news/2019-06-07/handmaids-tale-forced-pregnancy-khmer-rouge/11172214", "urlToImage": "https://www.abc.net.au/news/image/9693356-16x9-700x394.jpg", "publishedAt": "2019-06-07T01:38:36Z", "content": "Posted \r\nJune 07, 2019 11:38:36\r\nThe next chapter of The Handmaid's Tale's stark dystopia returned to Australian screens yesterday.\r\nAnd while the show is often said to depict inconceivable horrors, for Cambodian women who lived under the Khmer Rouge, they're… [+7253 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Corinne Heller", "title": "Princess Jasmine Is Very Different in Aladdin Reboot: Watch Her Belt Out Her New Song", "description": "Princess Jasmine is more empowered and has got bigger dreams and aspirations in Disney's live-action Aladdin reboot. In the beloved 1992 animated film, she is depicted as an...", "url": "https://www.eonline.com/news/1042531/princess-jasmine-is-very-different-in-aladdin-reboot-watch-her-belt-out-her-new-song", "urlToImage": "https://akns-images.eonline.com/eol_images/Entire_Site/2019417/rs_600x600-190517141953-600-princess-jasmine-aladdin-051719.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90", "publishedAt": "2019-05-20T16:00:00Z", "content": "Princess Jasmine is more empowered and has got bigger dreams and aspirations in Disney's live-action Aladdin reboot.\r\nIn the beloved 1992 animated film, she is depicted as an independent, strong daughter of the Sultan of Agrabah, who is sick of feeling \"trapp… [+761 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Stephanie Petit", "title": "Prince Albert's Daughter Is Taking After Grandmother Princess Grace — on The Marvelous Mrs. Maisel", "description": "Jazmin Grace Grimaldi has inherited the acting bug. The granddaughter of Grace Kelly (known as Monaco’s Princess Grace following her marriage to Prince Rainier III in 1956) has landed a role on the third season of Amazon Prime’s hit show The Marvelous Mrs. Ma…", "url": "https://people.com/royals/jazmin-grimaldi-role-marvelous-mrs-maisel-grace-kelly-granddaughter/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/jazmin-grace-grimaldi.jpg?crop=0px%2C0px%2C1432px%2C751.8px&resize=1200%2C630", "publishedAt": "2019-06-04T18:20:18Z", "content": "Jazmin Grace Grimaldi has inherited the acting bug.\r\nThe granddaughter of Grace Kelly (known as Monaco’s Princess Grace following her marriage to Prince Rainier III in 1956) has landed a role on the third season of Amazon Prime’s hit show The Marvelous Mrs. M… [+2347 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jessica Dickler", "title": "Your marriage could suffer due to the strong economy", "description": "Overall, divorces tend to pick up, rather than decrease, in periods of economic growth, when incomes rise across the board, according to the American Academy of Matrimonial Lawyers.", "url": "https://www.cnbc.com/2019/05/31/your-marriage-could-suffer-due-to-the-strong-economy.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/104518320-estranged.jpg?v=1532563825", "publishedAt": "2019-06-01T13:00:01Z", "content": "It's no surprise that your likelihood of divorce is somewhat based on your relationship with money.\r\nMoney is the leading cause of stress in a relationship, according to data from Northwestern Mutual's 2018 Planning &amp; Progress Study. The survey of over 2,… [+3360 chars]"}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Brad Stephenson", "title": "The popular Dragon’s Lair video games return, this time on Xbox One consoles", "description": "All three classic video games, Dragon’s Lair, Space Ace, and Dragon’s Lair 2: Time Warp have been re-released on Microsoft’s Xbox One consoles today as the Dragon’s Lair Trilogy. Dragon’s Lair Trilogy contains all of the content from the original games, the f…", "url": "https://www.onmsft.com/news/the-popular-dragons-lair-video-games-return-this-time-on-xbox-one-consoles", "urlToImage": "https://i0.wp.com/www.onmsft.com/wp-content/uploads/2019/05/dragonslair.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2019-05-21T09:49:49Z", "content": "All three classic video games, Dragon’s Lair, Space Ace, and Dragon’s Lair 2: Time Warp have been re-released on Microsoft’s Xbox One consoles today as the Dragon’s Lair Trilogy.\r\nDragon’s Lair Trilogy contains all of the content from the original games, the … [+1248 chars]"}, {"source": {"id": null, "name": "Hotair.com"}, "author": "John Sexton", "title": "Women in Pakistan face child marriage, domestic abuse, and ‘honor killings’", "description": "\"We aren’t free—we are limited to hiding behind veils.\" The post Women in Pakistan face child marriage, domestic abuse, and ‘honor killings’ appeared first on Hot Air.", "url": "https://hotair.com/archives/2019/06/05/women-pakistan-often-subject-threats-abuse/", "urlToImage": "https://hotair.com/wp/wp-content/uploads/2019/06/Pakistani-women.jpg", "publishedAt": "2019-06-06T01:21:04Z", "content": "A group called the Center for Investigative Reporting has produced a short film which is mostly about what it’s like to be a woman in Pakistan. Not surprisingly, it’s a terrible, dehumanizing experience. The film centers on three women who have stood up for t… [+2306 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Number of men forced into marriage reaches seven-year high", "description": "The number of forced marriage cases dealt with by a specialist British unit tackling the issue leapt to a record high last year.", "url": "https://news.sky.com/story/number-of-men-being-forced-into-marriage-reaches-seven-year-high-11727985", "urlToImage": "https://e3.365dm.com/19/05/1600x900/skynews-forced-marriage-tv_4677738.jpg?20190524213403", "publishedAt": "2019-05-24T19:26:00Z", "content": null}, {"source": {"id": null, "name": "Spin.com"}, "author": "Maggie Serota", "title": "Fleabag Season 2 Gives a Fresh and Honest Perspective on Grief", "description": "Season 2 of Phoebe Waller-Bridge's acclaimed dark comedy Fleabag is charming and emotionally devastating, possibly more so than its first season. The British series follows a complicated and damaged woman as she deals with an emotionally distant father, a suc…", "url": "https://www.spin.com/2019/05/fleabag-season-2-review/", "urlToImage": "https://static.spin.com/files/2019/05/fleabag-season-2-grief-1559055420-compressed.jpg", "publishedAt": "2019-05-28T20:59:54Z", "content": "Season 2 of Phoebe Waller-Bridge’s acclaimed dark comedy Fleabag is charming and emotionally devastating, possibly more so than its first season. The British series follows a complicated and damaged woman as she deals with an emotionally distant father, a suc… [+5686 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Beth Elderkin", "title": "The Riverdale Finale Spoiler Q&A: What The Hell Just Happened?", "description": "Ladies and gentlemen, boys and girls, anyone and everyone: Let me officially welcome you to the great town of Riverdale, where we just got the exposition-dumping, poison-wielding mother of all season finales. Death cults, serial killers, organ harvesting, Arc…", "url": "https://io9.gizmodo.com/the-riverdale-finale-spoiler-q-a-what-the-hell-just-ha-1834789128", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--kQ8ioSQq--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nejfivtuxqlbrzmlvgv3.jpg", "publishedAt": "2019-05-16T15:00:00Z", "content": "Ladies and gentlemen, boys and girls, anyone and everyone: Let me officially welcome you to the great town of Riverdale, where we just got the exposition-dumping, poison-wielding mother of all season finales. Death cults, serial killers, organ harvesting, Arc… [+8638 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Krishnadev Calamur", "title": "The U.S. System for ‘Skilled’ Migrants Is Broken", "description": "Obtaining an H-1B visa was always complicated. Now it’s even harder to get one.", "url": "https://www.theatlantic.com/international/archive/2019/05/us-visa-system-skilled-migrants/589615/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/mt/2019/05/GettyImages_143452813/facebook.jpg?1558025700", "publishedAt": "2019-05-17T10:00:00Z", "content": "Tamsyn Mahoney-Steel took a winding path to Johns Hopkins University in Baltimore. She began by studying politics and philosophy in her native Britain, then trained as a singer, before getting a doctoral degree in medieval music and literature. Working with c… [+10136 chars]"}, {"source": {"id": null, "name": "Bookriot.com"}, "author": "Heather Bottoms", "title": "50 Must-Read Books About Complicated Marriages", "description": "Marriage is the joining of two souls. It brings together two independent people, each with their own strengths and weaknesses, opinions and preferences, joys and sorrows. It can be a blissful experien", "url": "https://bookriot.com/2019/05/16/books-about-complicated-marriages/", "urlToImage": "https://s2982.pcdn.co/wp-content/uploads/2019/05/marriage-wedding-ring-feature-640x340.jpg", "publishedAt": "2019-05-16T10:39:55Z", "content": "Marriage is the joining of two souls. It brings together two independent people, each with their own strengths and weaknesses, opinions and preferences, joys and sorrows. It can be a blissful experience, but even the best marriages have challenges. And frankl… [+23323 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Anita Singh", "title": "June Spencer: I'll be working on The Archers after my 100th birthday", "description": "In the week of her 100th birthday, June Spencer celebrated by doing what she loves best:", "url": "https://www.telegraph.co.uk/news/2019/06/11/june-spencer-working-archers-100th-birthday/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/06/11/TELEMMGLPICT000200416216-xlarge_trans_NvBQzQNjv4Bq_KT1CG95t6Xu13suSZraGeVwKQA-9Kytx9ORqB6nl_g.jpeg", "publishedAt": "2019-06-11T20:30:00Z", "content": "Spencer said that dementia had once been brushed under the carpet and she was pleased that the issue was being highlighted. Of the personal resonance, she said: It was when I listened to the recordings afterwards that it got me a little bit.\r\nIn the interview… [+1284 chars]"}, {"source": {"id": null, "name": "Cultofmac.com"}, "author": "Luke Dormehl", "title": "‘Find my iPad’ helps track down stolen cop’s gun", "description": "The “Find my iPad” feature on an Apple tablet helped cops track down the thieves responsible for taking a police deputy’s gun and tactical gear. The app let officers find the stolen goods, in addition to other items relating to nearby burglaries, at a home in…", "url": "https://www.cultofmac.com/630266/find-my-ipad-helps-track-down-stolen-cops-gun/", "urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2018/11/IMG_1011.jpeg", "publishedAt": "2019-06-10T12:30:03Z", "content": "The Find my iPad feature on an Apple tablet helped cops track down the thieves responsible for taking a police deputys gun and tactical gear.\r\nThe app let officers find the stolen goods, in addition to other items relating to nearby burglaries, at a home in C… [+1646 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Alex McLevy on TV Club, shared by Alex McLevy to The A.V. Club", "title": "The wildest thing about Doom Patrol is how it carries on the work of Norman Lear", "description": "In terms of television series, Doom Patrol is pretty out there. Based on a DC Comics property (specifically, the late-1980s iteration written by Grant Morrison), the show revolves around outcasts and weirdos of the superhero universe, people who see themselve…", "url": "https://tv.avclub.com/the-wildest-thing-about-doom-patrol-is-how-it-carries-o-1835074002", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--iYxLuGYb--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rf09da9viuy1eqwr9jgf.jpg", "publishedAt": "2019-06-04T11:00:00Z", "content": "In terms of television series, Doom Patrol is pretty out there. Based on a DC Comics property (specifically, the late-1980s iteration written by Grant Morrison), the show revolves around outcasts and weirdos of the superhero universe, people who see themselve… [+11908 chars]"}, {"source": {"id": null, "name": "Radaronline.com"}, "author": "Radar Staff", "title": "Ariel Castro Victim Reveals Marriage Joy After Years Of Captivity", "description": "One of Ariel Castro‘s victim has revealed her life joy after years of being tortured by the notorious kidnapper and rapist. Castro held Michelle Knight, Amanda Berry, and Georgina “Gina” DeJesus captive in his home in Cleveland, Ohio for years until Berry esc…", "url": "https://radaronline.com/exclusives/2019/06/ariel-castro-victim-michelle-knight-is-in-love-with-husband/", "urlToImage": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/06/ariel-castro-victim-michelle-knight-is-in-love-with-husband-pp.jpg?fit=1100%2C618&ssl=1", "publishedAt": "2019-06-01T21:06:42Z", "content": "One of Ariel Castro‘s victim has revealed her life joy after years of being tortured by the notorious kidnapper and rapist.\r\nCastro held Michelle Knight, Amanda Berry, and Georgina “Gina” DeJesuscaptive in his home in Cleveland, Ohio for years until Berry esc… [+2161 chars]"}, {"source": {"id": null, "name": "Radaronline.com"}, "author": "James Vituscka", "title": "Keeping It Together! Kim & Kanye’s Rocky Marriage Finally Solid After Baby #4 & Letterman Tell-All", "description": "Kim Kardashian and Kanye West‘s rocky marriage is finally on solid ground! After suffering through a few rough years that began when the Keeping Up With the Kardashians star was robbed at gunpoint in Paris, RadarOnline.com has exclusively learned that the A-l…", "url": "https://radaronline.com/exclusives/2019/06/kim-kardashian-kanye-west-marriage-saved-by-baby/", "urlToImage": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/05/Kim-Kardshian-Kanye-West-Marriage-Saved-Baby-pp.jpg?fit=1100%2C618&ssl=1", "publishedAt": "2019-06-04T10:29:33Z", "content": "Kim Kardashian and Kanye West‘s rocky marriage is finally on solid ground!\r\nAfter suffering through a few rough years that began when the Keeping Up With the Kardashians star was robbed at gunpoint in Paris, RadarOnline.com has exclusively learned that the A-… [+1562 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Catherine Rottenberg", "title": "Abortion and the decimation of American democracy", "description": "Recent anti-abortion measures in the US are a symptom of a dangerous malady which has afflicted its democracy for years.", "url": "https://www.aljazeera.com/indepth/opinion/abortion-decimation-american-democracy-190528202120649.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/29/7d56a2d12cd24cbe935c1b612162fe57_18.jpg", "publishedAt": "2019-05-29T09:01:40Z", "content": "On May 14, the US state of Alabama passed new draconian legislation banning abortion in almost all cases. Less than 10 days later, Missouri followed suit with its own restrictive abortion measure.\r\nThese laws come on the heels of similar legislative initiativ… [+6279 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Erin Parke", "title": "For Australia's 'internet brides', the reality of wedded bliss is abuse and exploitation", "description": "An explosion of social media sites promoting young Asian women keen for marriage causes a spike in abuse and exploitation, with claims some women are being held captive in suburban homes in situations that could constitute human trafficking.", "url": "https://www.abc.net.au/news/2019-06-02/internet-brides-abused-held-captive-suburban-australian-homes/11165506", "urlToImage": "https://www.abc.net.au/news/image/11160656-16x9-700x394.jpg", "publishedAt": "2019-06-01T19:11:11Z", "content": "Posted \r\nJune 02, 2019 05:11:11\r\nAn explosion of social media sites promoting prospective young Asian brides has caused a spike in abuse and exploitation, with reports some women are being held captive in suburban homes in situations that could constitute hum… [+10512 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Robyn Merrett", "title": "Warren Jeffs' Son, Who Publicly Spoke Out About His Father's Cult and Years of Abuse, Dead at 26", "description": "Warren Jeffs’ son, who publicly accused him of sexual abuse and spoke out about his cult — the Fundamentalist Church of Jesus Christ of Latter-Day Saints — has died. Leroy “Roy” Jeffs was found dead on Friday in Salt Lake City, Utah, The Salt Lake Tribune rep…", "url": "https://people.com/crime/warren-jeffs-son-roy-jeff-dead-suicide/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/shutterstock_editorial_6085966b_huge.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "publishedAt": "2019-06-04T03:11:43Z", "content": "Warren Jeffs’ son, who publicly accused him of sexual abuse and spoke out about his cult the Fundamentalist Church of Jesus Christ of Latter-Day Saints has died.\r\nLeroy “Roy” Jeffs was found dead on Friday in Salt Lake City, Utah, The Salt Lake Tribunereports… [+5209 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Rachel DeSantis", "title": "Channing Tatum and Jessie J Share Sultry Bedroom Portraits Taken By One Another", "description": "Channing Tatum and Jessie J aren’t shy about flaunting their love — or their skills as photographers. The Magic Mike star and his “Domino” singer girlfriend each shared a sultry snap to Instagram this weekend taken by the other that featured a solo portrait o…", "url": "https://people.com/movies/channing-tatum-jessie-j-share-sultry-bedroom-portraits/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/channing-tatum-jessie-j-1.jpg?crop=5px%2C127px%2C2695px%2C1415px&resize=1200%2C630", "publishedAt": "2019-06-03T16:41:00Z", "content": "Channing Tatum and Jessie J arent shy about flaunting their love or their skills as photographers.\r\nThe Magic Mike star and his Domino singer girlfriend each shared a sultry snap to Instagram this weekend taken by the other that featured a solo portrait of ea… [+3013 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": "Chris Harris", "title": "How Warren Jeffs' Son Exposed Polygamist Cult Leader's Sex Abuse of His Other Children", "description": "In 2011, a Texas jury returned a guilty verdict against self-proclaimed prophet and polygamist cult leader Warren Jeffs, convicting him on two counts of child sexual abuse. Weeks later, a judge sentenced Jeffs, now 63, to life in prison, ending decades of evi…", "url": "https://people.com/crime/warren-jeffs-son-death-exposed-cult-leader-sex-abuse-children/", "urlToImage": "https://peopledotcom.files.wordpress.com/2019/06/shutterstock_editorial_6076940f_huge.jpg?crop=0px%2C0px%2C2724px%2C1430.1px&resize=1200%2C630", "publishedAt": "2019-06-04T15:56:54Z", "content": "In 2011, a Texas jury returned a guilty verdict against self-proclaimed prophet and polygamist cult leader Warren Jeffs, convicting him on two counts of child sexual abuse. Weeks later, a judge sentenced Jeffs, now 63, to life in prison, ending decades of evi… [+2799 chars]"}, {"source": {"id": null, "name": "Lifehack.org"}, "author": "Jacqui Olliver", "title": "How to Stop Yourself from Sabotaging Relationships", "description": "Love can be challenging at times, especially when you really care about keeping your relationship healthy. The ability to maintain a relationship in the long term isn’t a skill that most people naturally have. You want to make your relationship work yet the r…", "url": "https://www.lifehack.org/833085/sabotaging-relationships", "urlToImage": "https://cdn.lifehack.org/wp-content/uploads/2019/04/sabotaging-relationships.jpeg", "publishedAt": "2019-05-30T14:00:21Z", "content": "Love can be challenging at times, especially when you really care about keeping your relationship healthy. The ability to maintain a relationship in the long term isn’t a skill that most people naturally have. You want to make your relationship work yet the r… [+14330 chars]"}, {"source": {"id": null, "name": "Dlisted.com"}, "author": "Michael K", "title": "Afternoon Crumbs", "description": "Jessica Alba gave a tour of her multi-million dollar mansion to Architectural Digest, and says that they tried to use as many natural products as possible when doing their house. (“Too bad you didn’t do the same thing with your DisHonest products,” said the o…", "url": "http://dlisted.com/2019/05/24/afternoon-crumbs-228/", "urlToImage": "http://dlisted.com/wp-content/uploads/2019/05/nightcrumbs052519.jpg", "publishedAt": "2019-05-24T21:10:56Z", "content": "Jessica Alba gave a tour of her multi-million dollar mansion to Architectural Digest, and says that they tried to use as many natural products as possible when doing their house. (“Too bad you didn’t do the same thing with your DisHonest products,” said the o… [+1056 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Oliver Sava on TV Club, shared by Oliver Sava to The A.V. Club", "title": "Jane The Virgin enters stalker mode as she fights against a new status quo", "description": "Michael is out of the picture, and Jane can’t wait to get back together with Rafael. The problem is that Rafael isn’t interested. It’s unlikely that his relationship with Jane is truly over, but for now he needs space, which Jane is incapable of giving him. “…", "url": "https://tv.avclub.com/jane-the-virgin-enters-stalker-mode-as-she-fights-again-1834769606", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--LrpCsumM--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/wkh4k4hnov6qxpkr7fyu.jpg", "publishedAt": "2019-05-16T02:00:00Z", "content": "Michael is out of the picture, and Jane cant wait to get back together with Rafael. The problem is that Rafael isnt interested. Its unlikely that his relationship with Jane is truly over, but for now he needs space, which Jane is incapable of giving him. Chap… [+7234 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "News Desk, AFP, News Desk, Our Correspondent, Kamran Yousaf, muneeb, Newsdesk, AFP, AFP, Reuters", "title": "China withholds visas for 90 Pakistani brides over trafficking fears", "description": "China’s DCM Lijian Zhao refutes reports of forced prostitution and organ harvesting The post China withholds visas for 90 Pakistani brides over trafficking fears appeared first on The Express Tribune.", "url": "https://tribune.com.pk/story/1972994/1-china-withholds-visas-90-pakistani-brides-trafficking-fears/", "urlToImage": "https://c.tribune.com.pk/2019/05/1972994-weddingx-1557851344-204-640x480.jpg", "publishedAt": "2019-05-14T16:38:08Z", "content": "Chinas DCM Lijian Zhao refutes reports of forced prostitution and organ harvesting. PHOTO: FILE \r\nVisas of over 90 Pakistani brides have been withheld over fears of sex trafficking and organ trade, Chinas Deputy Chief of Mission in Pakistan Lijian Zhao said o… [+2257 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Bel Trew, Bel Trew", "title": "Saudi mother-of-three seeking asylum in Greece begs for help on Twitter saying her life is 'in danger'", "description": "Ghada al-Fadl's plea follows several cases where women fleeing the Kingdom have turned to social media for help", "url": "https://www.independent.co.uk/news/world/middle-east/saudi-arabia-mother-greece-twitter-help-danger-woman-children-ghada-allfadl-a8922576.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/20/17/ghada-elfadl.jpg", "publishedAt": "2019-05-20T16:35:26Z", "content": "A Saudi mother seeking asylum in Greece has appealed for help on social media, claiming her life is in danger and she will be separated from her husband and children if she is forced to return to Saudi Arabia.\r\nGhada al-Fadl, 40 is the latest Saudi woman to t… [+6742 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "I'm A First-Generation Latinx Woman & I Make $116K As A Marriage & Family Therapist", "description": "In our series My 6-Figure Paycheck, women making more than $100,000 open up about how they got there and what exactly they do. We take a closer look at what it feels like to be a woman making six-figures — when only 5% of American women make that much, accord…", "url": "https://www.yahoo.com/lifestyle/apos-m-first-generation-latinx-153000910.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wkBxIrPp1uIz01ow8.mL5g--~B/aD05MDA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/refinery29_778/968128577df6287d64f9ba111f4f156e", "publishedAt": "2019-05-24T15:30:00Z", "content": "In our seriesMy 6-Figure Paycheck, women making more than $100,000 open up about how they got there and what exactly they do. We take a closer look at what it feels like to be a woman making six-figures when only 5% of American women make that much, according… [+7081 chars]"}, {"source": {"id": null, "name": "Advocate.com"}, "author": "Neal Broverman", "title": "Mormon Church Blasts LGBTQ Equality Act, Won't Support It", "description": "Church officials expressed fear that they would have to hire openly LGBTQ people.", "url": "https://www.advocate.com/religion/2019/5/14/mormon-church-blasts-lgbtq-equality-act-wont-support-it", "urlToImage": "https://www.advocate.com/sites/advocate.com/files/2019/05/14/ldstemple-750x.jpg", "publishedAt": "2019-05-14T18:59:46Z", "content": "The Church of Jesus Christ of Latter-day Saints, commonly known as the Mormon Church, condemned the pro-LGBTQ Equality Act and said it does not support it.\r\n\"The Equality Act now before Congress is not balanced and does not meet the standard of fairness for a… [+2702 chars]"}]}