{"status": "ok", "totalResults": 1819, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Megan Molteni", "title": "Measles Had Been Eliminated. Now It’s Nearly a Daily Threat", "description": "The US declared measles eliminated in 2000, but it could lose that status in September—entering a darker era of heightened infectious disease risk.", "url": "https://www.wired.com/story/measles-had-been-eliminated-now-its-nearly-a-daily-threat/", "urlToImage": "https://media.wired.com/photos/5ce49ca930aeebe0f39233e8/191:100/pass/science_measles_baby-1144426161_featured.jpg", "publishedAt": "2019-05-22T11:00:00Z", "content": "The year 2019 isnt even halfway over yet, and its already the worst year for measles since NBC stopped airing episodes of Saved By The Bell. Since January 1, the rash- and fever-causing virus has sickened 880 people across 24 states. Thats more than all the c… [+7668 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Facebook releases a trio of maps to aid with fighting disease outbreaks", "description": "Facebook this morning announced a new initiative focused on using its data and technologies to help nonprofit organizations and universities working in public health better map the spread of infectious diseases around the world. Specifically, the company is i…", "url": "http://techcrunch.com/2019/05/20/facebook-releases-a-trio-of-maps-to-aid-with-fighting-disease-outbreaks/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/05/mozambique-nrp-header.png?w=583", "publishedAt": "2019-05-20T14:36:00Z", "content": "Facebook this morning announced a new initiative focused on using its data and technologies to help nonprofit organizations and universities working in public health better map the spread of infectious diseases around the world. Specifically, the company is i… [+4261 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lisa Sanders, M.D.", "title": "What Was the Cause of the Excruciating Pain in His Shoulders and Hips?", "description": "Doctors thought the older man most likely had a disease seen in those over 50. But the test results didn’t add up.", "url": "https://www.nytimes.com/2019/06/05/magazine/hip-shoulder-pain-polymyalgia-rheumatica-diagnosis.html", "urlToImage": "https://static01.nyt.com/images/2019/06/09/magazine/09Mag-Diagnosis-1/09Mag-Diagnosis-1-facebookJumbo.jpg", "publishedAt": "2019-06-05T09:00:02Z", "content": "Before each appointment, the patient went to the lab so that Quan could monitor the inflammatory markers. As the pain lessened, the numbers improved. But the patient was now in terrible pain. His inflammatory markers should have been high as well but they wer… [+2261 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Savanna Swain-Wilson", "title": "From smallpox to rubella, here are 6 infectious diseases you can avoid thanks to vaccines", "description": "Over the last century, widespread vaccination efforts have given patients protection against a handful of deadly infectious diseases. Polio, rubella, diphtheria, measles, and smallpox and are among the diseases that vaccines have helped to dramatically reduce…", "url": "https://www.businessinsider.com/vaccines-infectious-diseases-you-wont-get-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5d0111ce6fc920563120ae92-1136-568.jpg", "publishedAt": "2019-06-12T15:21:00Z", "content": "Diphtheria infections affected more than 200,000 people in 1921 and caused approximately 15,520 deaths that year, according to the CDC. \r\n Diphtheria initially causes infected people to develop a sore throat, weakness, and swollen glands. But then a grey-colo… [+937 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "Second Worst Ebola Outbreak in History Is Now Killing 66 Percent of People Who Become Infected", "description": "The current outbreak of Ebola in the Democratic Republic of Congo (DRC) has infected 1,720 and killed 1,136, giving the viral disease a whopping 66 percent fatality rate. And the situation is making public health experts on the ground increasingly nervous. Re…", "url": "https://gizmodo.com/second-worst-ebola-outbreak-in-history-is-now-killing-6-1834780459", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--VqprDjxW--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oinc8ujrxtktsefkaetx.jpg", "publishedAt": "2019-05-15T17:50:00Z", "content": "The current outbreak of Ebola in the Democratic Republic of Congo (DRC) has infected 1,720 and killed 1,136, giving the viral disease a whopping 66 percent fatality rate. And the situation is making public health experts on the ground increasingly nervous.\r\nI… [+5315 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Beatrice Christofaro", "title": "US health officials threatened to invoke a rare airplane 'Do Not Board' order to contain the country's growing measles outbreak", "description": "Health officials from five US states threatened to put people with measles who had travel plans on a rare \"Do Not Board\" list. The eight individuals cancelled their flights after the warning. The US is going through its worst measles outbreak in decades, caus…", "url": "https://www.insider.com/measles-outbreak-us-officials-threaten-travel-ban-on-infected-people-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce7c93e4cf2703d823efdee-1920-960.jpg", "publishedAt": "2019-05-24T10:34:38Z", "content": "US health officials from five states threatened to invoke a rare travel ban in an attempt to contain the country's sweeping outbreak of measles, The Washington Post reported. \r\n Authorities were aware of eight individuals believed to be infected and planning … [+3103 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Catie Keck", "title": "Health Officials Reportedly Threatened Air Travel Ban for Individuals With Measles", "description": "Eight individuals thought to be infected with measles reportedly canceled their air travel plans after they learned they could be placed under a health-related travel ban. Read more...", "url": "https://gizmodo.com/health-officials-reportedly-threatened-air-travel-ban-f-1835026207", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--p4cSbfW7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xadvzparmzczzv1soqrb.jpg", "publishedAt": "2019-05-25T18:25:00Z", "content": "Eight individuals thought to be infected with measles reportedly canceled their air travel plans after they learned they could be placed under a health-related travel ban.\r\nThe Washington Post reported Friday that the individuals were cooperative after they w… [+2895 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Melissa Locker", "title": "Thanks to anti-vaxxers, a measles travel ban may be coming", "description": "Measles could make the rarely used Do Not board list more common. As any armchair epidemiologist can tell you, it’s really, really easy to spread disease through air travel. Now as measles become the hot new trend of 2019, health officials and federal authori…", "url": "https://www.fastcompany.com/90356101/cdc-do-not-board-list-measles-travel-ban-mulled-for-planes?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-thanks-to-anti-vaxxers-a-measles-travel-ban-may-be-coming.jpg", "publishedAt": "2019-05-28T16:00:00Z", "content": "As any armchair epidemiologist can tell you, it’s really, really easy to spread disease through air travel. Now as measles become the hot new trend of 2019, health officials and federal authorities are considering banning people exposed to the measles from fl… [+2252 chars]"}, {"source": {"id": null, "name": "Edmontonjournal.com"}, "author": null, "title": "AHS confirms Edmonton area's first measles case of 2019 - Edmonton Journal", "description": "AHS confirms Edmonton area's first measles case of 2019 Edmonton Journal Confirmed case of measles prompts alert for Sherwood Park, Nisku and Edmonton CBC.ca Potential measles exposure in Edmonton, Sherwood Park, Nisku CTV News Measles Case Confirmed in Edmon…", "url": "https://edmontonjournal.com/news/local-news/ahs-confirms-case-of-measles-in-edmonton-area", "urlToImage": "https://postmediaedmontonjournal2.files.wordpress.com/2019/02/measles-vaccination-20190219.jpg", "publishedAt": "2019-05-20T20:30:31Z", "content": "Health officials are warning the public after confirming the year’s first case of measles in the Edmonton area, and issuing a list of times and places where other people may have been exposed.\r\nOn Monday, Alberta Health Services said an adult with a lab-confi… [+3735 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "https://www.facebook.com/lena.sun.90", "title": "Officials fighting U.S. measles outbreaks threaten to use rare air travel ban - The Washington Post", "description": "Officials fighting U.S. measles outbreaks threaten to use rare air travel ban The Washington Post Health officials in five states have warned people believed to be infected with measles and planning to travel that they could prevent them from getting on plane…", "url": "https://www.washingtonpost.com/health/2019/05/23/officials-fighting-us-measles-outbreaks-threaten-use-rare-air-travel-ban/", "urlToImage": "https://www.washingtonpost.com/resizer/REbrCsa4m7gBkobmYtXIGdP3g9s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3LOT5DDJSYI6TJTNVAWT6PMW2U.jpg", "publishedAt": "2019-05-23T22:16:22Z", "content": "Health officials in five states have warned people believed to be infected with measles and planning to travel that they could prevent them from getting on planes.\r\nAll eight individuals agreed to cancel their flights after learning the officials could ask th… [+6311 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "Alaska officials warn hares could spread deadly disease to people, pets", "description": "Alaska wildlife officials recently issued a warning for residents in Fairbanks: Beware of hares.", "url": "https://www.foxnews.com/science/alaska-hares-pets-deadly-disease", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/Brown-hare.jpg", "publishedAt": "2019-06-07T20:30:18Z", "content": "Alaska wildlife officials recently issued a warning for residents in Fairbanks: Beware of hares.\r\nIn a news release late last month, the Alaska Department of Fish and Game announced it had received calls about an “abundance” of hares — some of which were dead… [+2511 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ann Schmidt", "title": "Trash heaps in downtown Los Angeles continue growing months after multiple typhus cases: report", "description": "Trash is a growing problem for residents in Los Angeles and as the garbage piles up, so do the rats, fueling concerns about flea-borne typhus, according to reports.", "url": "https://www.foxnews.com/science/los-angeles-trash-heaps-grow", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/trash-screen.jpg", "publishedAt": "2019-05-21T23:49:00Z", "content": "Trash is a growing problem for residents in Los Angeles and as the garbage piles up, so do the rats, fueling concerns about flea-borne typhus, according to reports.\r\nLast October, after at least nine reports of the disease, Los Angeles officials cleaned up so… [+2105 chars]"}, {"source": {"id": null, "name": "Thespec.com"}, "author": "Liam Casey", "title": "Toronto Public Health probing two confirmed travel-related measles cases - TheSpec.com", "description": "Toronto Public Health probing two confirmed travel-related measles cases TheSpec.com TORONTO — Two confirmed cases of measles in adults in Toronto are both travel related, the city's public health unit said Monday as it warned the public of... View full cover…", "url": "https://www.thespec.com/news-story/9352189-toronto-public-health-probing-two-confirmed-travel-related-measles-cases/", "urlToImage": "https://www.thespec.com/Contents/Images/Communities/TheSpec_1200x630.png", "publishedAt": "2019-05-14T00:08:16Z", "content": "Toronto Public Health said that members of the public may have been exposed to the measles virus in several locations on May 5 and May 8.\r\nThose locations include Toronto's Pearson International Airport, Terminal 1, between 6 p.m. and 10:30 p.m. on May 5, and… [+1676 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "ThemeGrill", "title": "Health officials and CDC discussed no-fly list for measles patients - Brinkwire", "description": "Health officials and CDC discussed no-fly list for measles patients Brinkwire The current global measles outbreak, mapped Quartz Health Officials Reportedly Threatened Air Travel Ban for Individuals With Measles Gizmodo Air travel expected to be up but so are…", "url": "http://brinkwire.com/canada/health-officials-and-cdc-discussed-no-fly-list-for-measles-patients/", "urlToImage": null, "publishedAt": "2019-05-25T21:37:00Z", "content": "Officials at both the local and state levels consulted with the Centers for Disease Control and Prevention (CDC) about putting some people who were potentially infected with measles on the Do Not Board list, it has been revealed. The discussions aimed to redu… [+1985 chars]"}, {"source": {"id": null, "name": "Capebretonpost.com"}, "author": "Kate Kelland, Health and Science Correspondent", "title": "Scientists edit chicken genes to make them resistant to bird flu - Cape Breton Post", "description": "By Kate Kelland, Health and Science Correspondent LONDON, June 3 (Reuters) - Scientists in Britain have used gene-editing techniques to stop bird flu spreading in chicken cells grown in a lab - a key step towards making genetically-altered chickens", "url": "https://www.capebretonpost.com/news/world/scientists-edit-chicken-genes-to-make-them-resistant-to-bird-flu-317881/", "urlToImage": "https://www.capebretonpost.com/media/photologue/photos/cache/scientists-edit-chicken-genes-to-make-them-resistant-to-bird-flu_medium", "publishedAt": "2019-06-03T11:30:59Z", "content": "By Kate Kelland, Health and Science Correspondent\r\nLONDON, June 3 (Reuters) - Scientists in Britain have used gene-editing techniques to stop bird flu spreading in chicken cells grown in a lab - a key step towards making genetically-altered chickens that coul… [+2237 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Carolyn Crist", "title": "Statistical model could predict future disease outbreaks", "description": "Several University of Georgia researchers teamed up to create a statistical method that may allow public health and infectious disease forecasters to better predict disease reemergence, especially for preventable childhood infections such as measles and pertu…", "url": "https://phys.org/news/2019-05-statistical-future-disease-outbreaks.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/statisticalm.jpg", "publishedAt": "2019-05-21T17:59:12Z", "content": "Several University of Georgia researchers teamed up to create a statistical method that may allow public health and infectious disease forecasters to better predict disease reemergence, especially for preventable childhood infections such as measles and pertu… [+4884 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Susan Scutti, CNN", "title": "CRISPR gene-edited babies may be at increased risk of early death, study finds", "description": "Our genomes contain two copies of the CCR5 gene. It is known that people who carry two defective copies of this gene are highly resistant to HIV. But this double mutation of the CCR5 gene, which a Chinese scientist intentionally edited into human embryos last…", "url": "https://www.cnn.com/2019/06/03/health/crispr-gene-edit-increased-death-risk-study/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/111213103153-dna-helix-genetic-mapping-super-tease.jpg", "publishedAt": "2019-06-03T16:09:12Z", "content": "(CNN)Our genomes contain two copies of the CCR5 gene. It is known that people who carry two defective copies of this gene are highly resistant to HIV. But this double mutation of the CCR5 gene, which a Chinese scientist intentionally edited into human embryos… [+5080 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Bill Hutchinson", "title": "Father calls for U.S. probe of daughter, son-in-law's mysterious deaths in Fiji", "description": "A Texas couple died after coming down with a violent illness in Fiji.", "url": "https://abcnews.go.com/International/father-calls-us-probe-daughter-son-laws-mysterious/story?id=63475288", "urlToImage": "https://s.abcnews.com/images/US/HT_FIJI_DEATHS2_190603KA_hpMain_16x9_992.jpg", "publishedAt": "2019-06-04T17:28:41Z", "content": "The father of a Texas woman who died along with her husband from a mysterious illness while on a dream vacation in Fiji says he wants the U.S. Centers for Disease Control and Prevention to conduct an independent investigation of the deaths to determine if his… [+5190 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "New factor influencing spread of Legionella", "description": "When people fall ill from bacterial infection, the first priority is to treat the disease. An international team has tackled the question where do these pathogens come from using an important bacterial pathogen that causes lung disease.", "url": "https://www.sciencedaily.com/releases/2019/05/190514110320.htm", "urlToImage": null, "publishedAt": "2019-05-14T15:03:20Z", "content": "When people fall ill from bacterial infection, the first priority is to treat the disease. But where do these pathogens come from and how do they thrive in the environment before the infection occurs? An international team led by Matthias Horn from the Centre… [+3912 chars]"}, {"source": {"id": null, "name": "Tes.com"}, "author": null, "title": "MMR: School admissions link to vaccine disputed - TES News", "description": "MMR: School admissions link to vaccine disputed TES News Measles: Compulsory school jabs needed to prevent spread, experts warn Sky News Measles cases on the rise in UK, Public Health England confirms Mirror Online Move towards compulsory vaccinations for sch…", "url": "https://www.tes.com/news/experts-question-call-link-school-admission-mmr-vaccine", "urlToImage": "https://www.tes.com/tesv2/files/styles/twitter_image_card_large/public/media/image/2019-05/Vaccination.jpg?itok=SF4EqYid", "publishedAt": "2019-05-17T16:38:11Z", "content": "The UK should consider introducing compulsory measles vaccinations before children can start school, experts have said.\r\nA team of Italian researchers warned that current vaccination policies are not enough to keep the disease at elimination status and contro… [+4999 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, John Bacon, USA TODAY", "title": "'Spike is concerning': U.S. measles boom heats up with 75 more cases this week", "description": "The number of measles cases reported nationwide this year jumped by 75 last week, pushing the total to 839 in 23 states.", "url": "https://www.usatoday.com/story/news/nation/2019/05/13/measles-outbreak-boom-heats-up-75-more-cases-reported-cdc-says/1187328001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/13/USAT/8a1aadd4-58e8-4ecb-a51a-4895973faedb-Measles_may13.JPG?crop=2599,1467,x0,y47&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-13T15:43:28Z", "content": "Washington Gov. Jay Inslee signed a bill into law on Friday that requires children to get the combined measles, mumps and rubella vaccine if they attend day care or school. Parents against the bill protested outside the signing ceremony. (May 10)\r\n AP, AP\r\nTh… [+3621 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Liam Casey", "title": "Toronto Public Health probing two confirmed travel-related measles cases - CTV News", "description": "Toronto Public Health probing two confirmed travel-related measles cases CTV News Two confirmed cases of measles in adults in Toronto are both travel related, the city's public health unit said Monday as it warned the public of possible places... View full co…", "url": "https://www.ctvnews.ca/health/toronto-public-health-probing-two-confirmed-travel-related-measles-cases-1.4419741", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.2427325.1557754553!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2019-05-13T15:17:00Z", "content": "TORONTO -- Two confirmed cases of measles in adults in Toronto are both travel related, the city's public health unit said Monday as it warned the public of possible places where they may have been exposed to the virus.\r\nThe latest incidents bring the total m… [+2388 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Justin Doom and Kelly Terez", "title": "'Start Here': Trump faces Republican rebellion over tariffs, homelessness jumps in LA", "description": "It's June 5, 2019. Here's what you need to know to start your day.", "url": "https://abcnews.go.com/US/start-here-trump-faces-republican-rebellion-mexico-tariffs-homelessness/story?id=63479198", "urlToImage": "https://s.abcnews.com/images/US/trump-may-gty-jef-190604_hpMain_16x9_992.jpg", "publishedAt": "2019-06-05T09:16:03Z", "content": "It's June 5, 2019. Let's start here.\r\nInterested in Start Here Morning Briefing ?\r\nAdd Start Here Morning Briefing as an interest to stay up to date on the latest Start Here Morning Briefing news, video, and analysis from ABC News.\r\n1. 'Nothing more important… [+4721 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Breakthrough in chronic wasting disease research reveals distinct deer, elk prion strains", "description": "Researchers have developed a new gene-targeted approach to study chronic wasting disease in mice, allowing opportunities for research that has not previously existed.", "url": "https://www.sciencedaily.com/releases/2019/06/190611102715.htm", "urlToImage": null, "publishedAt": "2019-06-11T14:27:15Z", "content": "Infectious proteins called prions cause a group of related, fatal and incurable neurodegenerative disorders, including bovine spongiform encephalopathy or Mad Cow disease and Creutzfeldt-Jakob disease, both of which affect humans.Chronic wasting disease or CW… [+2599 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Anne Gulland", "title": "'High impact' outbreaks such as Ebola the 'new normal', WHO warns", "description": "The world is facing a &ldquo;new normal&rdquo; when it as at heightened risk of &ldquo;high impact&rdquo; infectious disease outbreaks, the World Health Organization has said.", "url": "https://www.telegraph.co.uk/news/0/high-impact-outbreaks-ebola-new-normal-warns/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/06/07/TELEMMGLPICT000199643857-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg", "publishedAt": "2019-06-07T10:06:11Z", "content": "The world is facing a new normal when it as at heightened risk of high impact infectious disease outbreaks, the World Health Organization has said.\r\nDr Mike Ryan, WHOs assistant director for emergencies, said that a range of factors such as population movemen… [+551 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Evolution and diversity of Leptospira bacteria", "description": "Leptospirosis is an emerging zoonotic disease that affects more than one million people around the world each year. Researchers have now sequenced the genomes of Leptospira collected from environments around the globe and revealed 30 new species and new patte…", "url": "https://www.sciencedaily.com/releases/2019/05/190523142207.htm", "urlToImage": null, "publishedAt": "2019-05-23T18:22:07Z", "content": "Leptospirosis is an emerging zoonotic disease that affects more than one million people around the world each year. Researchers reporting in PLOS Neglected Tropical Diseases have now sequenced the genomes of Leptospira collected from environments around the g… [+1725 chars]"}, {"source": {"id": null, "name": "Torontosun.com"}, "author": null, "title": "GIFFORD-JONES: Louis Pasteur's grave a reminder of great medical discoveries - CANOE", "description": "GIFFORD-JONES: Louis Pasteur's grave a reminder of great medical discoveries CANOE Today, we face a recurrence of measles because some parents have refused to have their children vaccinated. This error reminded me of a time several years...", "url": "https://torontosun.com/health/diet-fitness/0608-giffordjones", "urlToImage": "https://postmediacanoe.files.wordpress.com/2019/06/gettyimages-918159704-e1559920909328.jpg", "publishedAt": "2019-06-08T11:00:00Z", "content": "Today, we face a recurrence of measles because some parents have refused to have their children vaccinated. This error reminded me of a time several years ago when I interviewed professor Etienne-Emile Baulieu, a researcher at the famous Pasteur Institute in … [+4105 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Immune cells play unexpected role in early tuberculosis infection", "description": "A class of immune cells called innate lymphoid cells mediates the body's initial defense against tuberculosis (TB), according to new research. Boosting this response may provide a new approach to developing treatments and vaccines against TB.", "url": "https://www.sciencedaily.com/releases/2019/06/190605133509.htm", "urlToImage": "https://www.sciencedaily.com/images/2019/06/190605133509_1_540x360.jpg", "publishedAt": "2019-06-05T17:35:09Z", "content": "A class of immune cells called innate lymphoid cells (ILCs) mediates the body's initial defense against tuberculosis (TB), according to a report published online today in Nature. Boosting this response may provide a new approach to developing treatments and v… [+1891 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "How the immune system keeps the Epstein-Barr virus in check", "description": "A protein called PD-1, which is found on immune cells called CD8+ T cells, plays a key role in controlling infection with the Epstein-Barr virus, according to a study published May 30 in the open-access journal PLOS Pathogens by Christian Münz of the Universi…", "url": "https://www.sciencedaily.com/releases/2019/05/190530141527.htm", "urlToImage": null, "publishedAt": "2019-05-30T18:15:27Z", "content": "A protein called PD-1, which is found on immune cells called CD8+ T cells, plays a key role in controlling infection with the Epstein-Barr virus, according to a study published May 30 in the open-access journal PLOS Pathogens by Christian Münz of the Universi… [+2536 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Be alert, no need for panic: Shylaja", "description": "Nipah becomes infectious only when symptoms appear, not in incubation period", "url": "https://www.thehindu.com/news/national/kerala/be-alert-no-need-for-panic-shylaja/article27473739.ece", "urlToImage": "https://www.thehindu.com/news/national/kerala/txwf51/article27473738.ece/ALTERNATES/LANDSCAPE_615/05TVTVNIPAH1", "publishedAt": "2019-06-04T17:46:59Z", "content": "Health Minister K.K. Shylaja on Tuesday reiterated that there was no need for panic in the community as Nipah virus, though highly contagious, cannot be spread just because a suspected case was living in the neighbourhood or the family of the patient was in t… [+1385 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Sarah Webb", "title": "Research group uses supercomputing to target the most promising drug candidates from a daunting number of possibilities", "description": "Identifying the optimal drug treatment is like hitting a moving target. To stop disease, small-molecule drugs bind tightly to an important protein, blocking its effects in the body. Even approved drugs don't usually work in all patients. And over time, infect…", "url": "https://phys.org/news/2019-05-group-supercomputing-drug-candidates-daunting.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/researchgrou.jpg", "publishedAt": "2019-05-20T13:31:59Z", "content": "Identifying the optimal drug treatment is like hitting a moving target. To stop disease, small-molecule drugs bind tightly to an important protein, blocking its effects in the body. Even approved drugs don't usually work in all patients. And over time, infect… [+7311 chars]"}, {"source": {"id": null, "name": "Kmaland.com"}, "author": "Matt Kelley -- Radio Iowa", "title": "Infectious disease found in dogs of Marion County breeder - KMAland", "description": "Infectious disease found in dogs of Marion County breeder KMAland Iowa confirms 'multiple cases' of dog disease Canine brucellosis that can be transmitted to humans The Washington Post Dog disease that can be passed to humans confirmed in Iowa NBC News Iowa O…", "url": "http://www.kmaland.com/news/infectious-disease-found-in-dogs-of-marion-county-breeder/article_f1b66358-75ea-11e9-862b-d37bc73e120f.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kmaland.com/content/tncms/assets/v3/editorial/1/95/1953c0a4-75eb-11e9-b8e2-078ae785affc/5cda1fc351777.image.jpg?resize=267%2C200", "publishedAt": "2019-05-14T01:52:00Z", "content": "(Knoxville) -- Some 200 people who recently bought dogs from a breeder in south-central Iowa are being urged to have the animals tested for canine brucellosis.\r\nKeely Coppess, spokeswoman for the Iowa Department of Agriculture, says four of the dogs are confi… [+1382 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Morgan Winsor", "title": "'We have no time to lose': UN names Ebola chief to tackle 2nd largest outbreak", "description": "The United Nations on Thursday named an emergency Ebola response coordinator to help contain the growing outbreak in the eastern Democratic Republic of the Congo.", "url": "https://abcnews.go.com/International/names-ebola-chief-tackle-worlds-2nd-largest-outbreak/story?id=63226412", "urlToImage": "https://s.abcnews.com/images/International/ebola-1-ap-er-190523_hpMain_16x9_992.jpg", "publishedAt": "2019-05-23T18:50:55Z", "content": "United Nations officials on Thursday named an emergency Ebola response coordinator to help bolster efforts to contain the growing outbreak in the eastern Democratic Republic of the Congo that has killed more than 1,200 people in 10 months.\r\nInterested in Ebol… [+5667 chars]"}, {"source": {"id": null, "name": "Nextavenue.org"}, "author": "Stephenie Overman", "title": "Next Avenue: You may need a measles or shingles vaccination, especially if you’re older", "description": "College students, health care personnel and international travelers are also at increased risk for measles.", "url": "https://www.nextavenue.org/measles-shingles-vaccines/", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HK141_na_Mea_ZG_20190522162457.jpg", "publishedAt": "2019-05-29T08:59:00Z", "content": "This article is reprinted by permission from NextAvenue.org.\r\nYou probably know theres a measles outbreak. And you may have heard that theres a shortage of the most effective vaccine to prevent shingles, a cousin of the childhood disease chickenpox.\r\nDid you … [+5708 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "21 young people are suing the US government, claiming a constitutional right to a stable climate. Here's what happened in court yesterday.", "description": "In 2015, 21 young people sued the federal government, claiming the US government was violating their constitutional rights by contributing to climate change despite knowledge of its dangerous consequences. The Obama and Trump administrations have both attempt…", "url": "https://www.businessinsider.com/climate-change-lawsuit-young-people-suing-government-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf7e1ca11e20515330738ea-2732-1366.jpg", "publishedAt": "2019-06-05T22:18:00Z", "content": "Four years ago, 21 young people sued the US government, alleging that its role in contributing to climate change violates their constitutional rights. \r\n In the landmark lawsuit, the plaintiffs allege that their generation has already suffered and will contin… [+7878 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Morgan Winsor", "title": "Ebola-stricken boy who became 1st cross-border case in growing outbreak dies", "description": "A young child who became the first cross-border case of Ebola in the world's second-largest outbreak has died, health officials said.", "url": "https://abcnews.go.com/International/ebola-stricken-boy-1st-cross-border-case-growing/story?id=63656559", "urlToImage": "https://s.abcnews.com/images/International/ebola-1-ap-er-190612_hpMain_16x9_992.jpg", "publishedAt": "2019-06-12T17:43:41Z", "content": "A young child who became the first cross-border case of Ebola in the world's second-largest outbreak has died, health officials said.\r\nInterested in Ebola?\r\nAdd Ebola as an interest to stay up to date on the latest Ebola news, video, and analysis from ABC New… [+8317 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Talia Ogliore-WUSTL", "title": "Invasive mosquitoes protect local ones from a parasite", "description": "A mosquito native to Missouri has fewer parasites when it shares its watery home with an intruder, research finds.", "url": "https://www.futurity.org/mosquito-parasites-invasive-species-2067532-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/05/Asian_Rock_Pool_Mosquito_1600.jpg", "publishedAt": "2019-05-21T23:40:49Z", "content": "A mosquito native to Missouri can thank the larvae of an invasive intruder for keeping parasites away, say researchers.\r\n“The extra energy put into fighting an infection, or lost to consumption by a parasite, can lead to changes in behavior in the host. That … [+2783 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Ants maintain essential interactions despite environmental flux", "description": "Ants adjust their social interactions to accommodate changes in population density, according to researchers. The findings suggest that ant colonies are capable of maintaining their sophisticated social organization despite potentially drastic changes in thei…", "url": "https://www.sciencedaily.com/releases/2019/06/190612141411.htm", "urlToImage": null, "publishedAt": "2019-06-12T18:14:11Z", "content": "Ants adjust their social interactions to accommodate changes in population density, according to researchers at Penn State and Georgetown University. The findings suggest that ant colonies are capable of maintaining their sophisticated social organization des… [+3731 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Alanna Vagianos", "title": "Planned Parenthood Declares A State Of Emergency Amid Abortion Bans", "description": "\"This is a man-made disaster that's years in the making and it's endangering women's lives,\" president Dr. Leana Wen told HuffPost.", "url": "https://www.huffpost.com/entry/planned-parenthood-declares-a-state-of-emergency-amid-abortion-bans_n_5cefe991e4b00cfa19676924", "urlToImage": "https://img.huffingtonpost.com/asset/5cefeb712500006000dbd5ed.jpeg?cache=3MfLRdSDxK&ops=1200_630", "publishedAt": "2019-05-30T19:00:53Z", "content": "Planned Parenthood declared a state of emergency on Thursday in response to the extreme abortion restrictions being implemented in states across the country.\r\n“If anyone had any doubts before, what we’ve seen in recent weeks has made it very clear that we are… [+3360 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Melanie Greaver Cordova", "title": "Framework predicts endangered species' pathogen risk", "description": "Four years ago, more than 200,000 endangered saiga antelope dropped dead on the remote steppe grassland of Central Asia in the species' worst recorded mass mortality event.", "url": "https://phys.org/news/2019-06-framework-endangered-species-pathogen.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/frameworkpre.jpg", "publishedAt": "2019-06-12T11:04:09Z", "content": "Four years ago, more than 200,000 endangered saiga antelope dropped dead on the remote steppe grassland of Central Asia in the species' worst recorded mass mortality event.\r\nDr. Wendy Beauvais, postdoctoral researcher in the College of Veterinary Medicine, wa… [+3700 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Anne Gulland", "title": "Urbanisation will make 'break-bone' fever one of the most common infectious diseases of the century, say experts", "description": "One of the world's most debilitating mosquito-borne diseases is set to spread to parts of Asia, Europe, North America and Australia that are currently free of the life-threatening condition, say researchers.", "url": "https://www.telegraph.co.uk/news/0/urbanisation-will-make-break-bone-fever-one-common-infectious/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/06/10/TELEMMGLPICT000199642919-xlarge_trans_NvBQzQNjv4BqYHaHRqZzVuMJAn8HN8r1s0RpU0s_QgZFe5g2d5Lgw7U.jpeg", "publishedAt": "2019-06-10T15:01:43Z", "content": "One of the world's most debilitating mosquito-borne diseases is set to spread to parts of Asia, Europe, North America and Australia that are currently free of the life-threatening condition, say researchers.\r\nDengue virus  also known as \"break-bone fever\" bec… [+724 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Shedding light on the burden of dengue in Bangladesh", "description": "Dengue, also known as dengue fever, is a viral disease transmitted to humans by mosquitoes of the genus Aedes. The incidence of dengue is currently increasing dramatically, and it is now one of the diseases said to be re-emerging. Researchers have conducted a…", "url": "https://www.sciencedaily.com/releases/2019/05/190524102759.htm", "urlToImage": null, "publishedAt": "2019-05-24T14:27:59Z", "content": "Dengue, also known as dengue fever, is a viral disease transmitted to humans by mosquitoes of the genus Aedes. The incidence of dengue is currently increasing dramatically, and it is now one of the diseases said to be re-emerging. In Bangladesh, sporadic case… [+3288 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "High-security Ebola burials spark dismay, anger in DR Congo - MENAFN.COM", "description": "High-security Ebola burials spark dismay, anger in DR Congo MENAFN.COM WHO chief calls for political solution to Ebola outbreak in Congo CBC.ca UN health agency struggles with travel abuses: AP exclusive CTV News Is Ebola spiralling out of control in the DRC?…", "url": "https://menafn.com/1098548375/Highsecurity-Ebola-burials-spark-dismay-anger-in-DR-Congo", "urlToImage": "https://menafn.com/updates/pr/2019-05/21/AFP_f0aa296c-0_636939987762061233_image.JPG", "publishedAt": "2019-05-21T05:26:16Z", "content": "(MENAFN - AFP) People in Ebola-hit eastern DR Congo are struggling to come to terms with high-security burials that are part of a hard-pressed strategy to roll back the disease. \r\n Anyone who dies of the highly infectious haemorrhagic fever has to be buried i… [+4180 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Joseph Trunzo Ph.D.", "title": "The Psychological Implications of Lyme Disease", "description": "An lesser known problem with Lyme disease are the psychological symptoms that can be caused by bacterial presence in the brain.", "url": "https://www.psychologytoday.com/ca/blog/new-approaches-health/201906/the-psychological-implications-lyme-disease", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-06/david-clode-576047-unsplash.jpg?itok=FFZt_FAT", "publishedAt": "2019-06-09T00:34:34Z", "content": "Every May is Lyme disease awareness month. Over the years, as an active clinician who regularly sees people who are suffering from Lyme disease, I read with interest the news items that find their way into popular and mainstream media outlets regarding Lyme d… [+4638 chars]"}, {"source": {"id": null, "name": "Psychologytoday.com"}, "author": "Joseph Trunzo Ph.D.", "title": "The Psychological Implications of Lyme Disease", "description": "An lesser known problem with Lyme disease are the psychological symptoms that can be caused by bacterial presence in the brain.", "url": "https://www.psychologytoday.com/us/blog/new-approaches-health/201906/the-psychological-implications-lyme-disease", "urlToImage": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-06/david-clode-576047-unsplash.jpg?itok=FFZt_FAT", "publishedAt": "2019-06-09T00:34:34Z", "content": "May is Lyme disease awareness month. Over the years, as an active clinician who regularly sees people who are suffering from Lyme disease, I read with interest the news items that find their way into popular and mainstream media outlets regarding the conditio… [+4574 chars]"}, {"source": {"id": null, "name": "Newatlas.com"}, "author": "Rich Haridy", "title": "Provocative study shows how the herpes virus can speed up the onset of Alzheimer’s disease", "description": "An intriguing new study from researchers at Stockholm University and Karolinska Institutet has described a mechanism by which virus particles can interact with proteins in biological fluids and become more infectious, while also accelerating the formation of …", "url": "https://newatlas.com/virus-herpes-alzheimers-mechanism-protein-amyloid/59872/", "urlToImage": "https://img.newatlas.com/herpes-alzheimers-2.jpg?auto=format%2Ccompress&ch=Width%2CDPR&fit=crop&h=347&q=60&rect=112%2C72%2C1732%2C974&w=616&s=dd6c80a557408bf11363e72a5db15b5e", "publishedAt": "2019-05-28T05:07:39Z", "content": "An intriguing new study from researchers at Stockholm University and Karolinska Institutet has described a mechanism by which virus particles can interact with proteins in biological fluids and become more infectious, while also accelerating the formation of … [+2859 chars]"}, {"source": {"id": null, "name": "Popsci.com"}, "author": "Alex Schwartz, Alex Schwartz", "title": "This island is many frogs' last hope for surviving the world's deadliest pathogen", "description": "Animals New Guinea is the last place the deadly chytrid fungus hasn't reached. The world’s amphibians are fighting a deadly pandemic: the ancient chytrid fungus. It’s already killed off 90 species of frogs and caused population declines in over 500…", "url": "https://www.popsci.com/new-guinea-frog-chytrid-fungus", "urlToImage": "https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/06/202440.jpg?itok=Uw0xCd38", "publishedAt": "2019-06-06T18:30:00Z", "content": "The worlds amphibians are fighting a deadly pandemic: the ancient chytrid fungus. Its already killed off 90 species of frogs and caused population declines in over 500 others, and its a principal reason why over 40 percent of amphibian species are threatened … [+4330 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Anne Gulland", "title": "Super chicks: scientists publish blueprint for flu-resistant chickens in bid to stop pandemics", "description": "Most infectious disease experts believe that the next big flu pandemic is not a matter of if but when.", "url": "https://www.telegraph.co.uk/news/0/super-chicks-scientists-publish-blueprint-flu-resistant-chickens/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/06/03/TELEMMGLPICT000002247941-xlarge_trans_NvBQzQNjv4BqNRLeOtRmQ8g_hknWyBRkgRfYYSaeV2P3OH7kqDh1pG0.jpeg", "publishedAt": "2019-06-04T04:05:00Z", "content": "Influenza causes disease by replicating inside the cells of its host and stealing protein, says Wendy Barclay, professor of virology at Imperial. Four years ago her team discovered the identity of one of the host proteins that flu viruses are dependent on.\r\nT… [+1032 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Michael Y. Park", "title": "Mystery Disease Kills Texas Couple Vacationing in Fiji", "description": "A healthy young American couple have died suddenly while on vacation in Fiji, according to the US State Department. David and Michelle Paul, of Fort Worth, Texas, were on a long-anticipated vacation on the tropical island when they came down with an illness o…", "url": "http://thepointsguy.com/news/mystery-disease-kills-texas-couple-vacationing-in-fiji/", "urlToImage": "https://i2.wp.com/thepointsguy.com/wp-content/uploads/2019/06/Jongcheol-Park-EyeEm_GettyImages-527592307.jpg?fit=1459%2C926px&ssl=1", "publishedAt": "2019-06-04T20:30:07Z", "content": "A healthy young American couple have died suddenly while on vacation in Fiji, according to the US State Department.\r\nDavid and Michelle Paul, of Fort Worth, Texas, were on a long-anticipated vacation on the tropical island when they came down with an illness … [+4002 chars]"}, {"source": {"id": null, "name": "Whotv.com"}, "author": "https://www.facebook.com/WHOHD", "title": "Multiple Canine Brucellosis Disease Cases Confirmed in Central Iowa - WHO TV Des Moines", "description": "Multiple Canine Brucellosis Disease Cases Confirmed in Central Iowa WHO TV Des Moines National Dog disease that can be passed to humans confirmed in Iowa Associated Press 10:32 KERO 23ABC News Dogs quarantined after officials detect a vicious disease. Humans …", "url": "https://whotv.com/2019/05/13/canine-brucellosis-disease-case-confirmed-in-central-iowa/", "urlToImage": "https://localtvwhotv.files.wordpress.com/2019/05/promo382064266.jpg?quality=85&strip=all&w=1200", "publishedAt": "2019-05-14T00:16:00Z", "content": "DE SOTO, Iowa -- State Veterinarian Jeff Kaisand confirmed multiple cases of canine brucellosis in central Iowa.\r\nThe diseased dogs were purchased at an auction held by commercial breeding facility Double G Kennels, also known as iowapuppies.com.\r\nThis diseas… [+2848 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Jordan Allen", "title": "US Officials Tell People With Measles Not to Fly or Be Banned From Air Travel", "description": "Eight people believed to have measles received warnings from federal health officials that they could be barred from flying while possibly infected with the ultra-contagious disease, The Washington Post reports. The Centers for Disease Control (CDC) was notif…", "url": "http://thepointsguy.com/news/us-officials-tell-people-with-measles-not-to-fly-or-be-banned-from-air-travel/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/05/GettyImages-1140395848.jpg?fit=1024%2C683px&ssl=1", "publishedAt": "2019-05-24T17:15:53Z", "content": "Eight people believed to have measles received warnings from federal health officials that they could be barred from flying while possibly infected with the ultra-contagious disease, The Washington Post reports.\r\nThe Centers for Disease Control (CDC) was noti… [+4379 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Genetics influence how protective childhood vaccines are for individual infants", "description": "A genome-wide search in thousands of children in the UK and Netherlands has revealed genetic variants associated with differing levels of protective antibodies produced after routine childhood immunizations. The findings may inform the development of new vacc…", "url": "https://www.sciencedaily.com/releases/2019/06/190611133932.htm", "urlToImage": null, "publishedAt": "2019-06-11T17:39:32Z", "content": "A genome-wide search in thousands of children in the UK and Netherlands has revealed genetic variants associated with differing levels of protective antibodies produced after routine childhood immunizations. The findings, appearing June 11 in the journal Cell… [+3943 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "'Cannibalism' is a double-whammy for cell health", "description": "Certain Inflammatory and infectious diseases, such as hardening arteries and tuberculosis, are caused by the build-up inside immune cells of harmful substances, such as cholesterol and bacteria. A study published today by University of Sydney researcher Hugh …", "url": "https://phys.org/news/2019-06-cannibalism-double-whammy-cell-health.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/cannibalismi.jpg", "publishedAt": "2019-06-04T23:00:03Z", "content": "Certain Inflammatory and infectious diseases, such as hardening arteries and tuberculosis, are caused by the build-up inside immune cells of harmful substances, such as cholesterol and bacteria. A study published today by University of Sydney researcher Hugh … [+3879 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Lori Dajose", "title": "Dangerous pathogens use this sophisticated machinery to infect hosts", "description": "Gastric cancer, Q fever, Legionnaires' disease, whooping cough—though the infectious bacteria that cause these dangerous diseases are each different, they all utilize the same molecular machinery to infect human cells. Bacteria use this machinery, called a Ty…", "url": "https://phys.org/news/2019-05-dangerous-pathogens-sophisticated-machinery-infect.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/1-dangerouspat.jpg", "publishedAt": "2019-05-17T19:06:50Z", "content": "Gastric cancer, Q fever, Legionnaires' disease, whooping coughthough the infectious bacteria that cause these dangerous diseases are each different, they all utilize the same molecular machinery to infect human cells. Bacteria use this machinery, called a Typ… [+3050 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Tara Haelle", "title": "Two-for-One: Chickenpox Vaccine Lowers Shingles Risk in Children", "description": "Immunization reduces the likelihood of a painful reemergence of the virus in kids -- Read more on ScientificAmerican.com", "url": "https://www.scientificamerican.com/article/two-for-one-chickenpox-vaccine-lowers-shingles-risk-in-children/", "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/152CE75B-4783-4EC2-BC853705C5C436EB.jpg", "publishedAt": "2019-06-11T12:00:00Z", "content": "Health organizations recommend children receive the varicella vaccine at one year old to protect them against chickenpox, but the vaccine appears to have another benefit: it cuts the risk of shingles, a painful and potentially debilitating rash caused by the … [+6711 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Talia Ogliore", "title": "A tale of two skeeters—biologists discover something positive about an invasive mosquito species", "description": "It's rare that scientists see the good in the presence of an invasive species. But Washington University in St. Louis researchers discovered that a native mosquito in Missouri has fewer parasites when it shares its waters with an interloper.", "url": "https://phys.org/news/2019-05-tale-skeetersbiologists-positive-invasive-mosquito.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/ataleoftwosk.jpg", "publishedAt": "2019-05-16T13:10:01Z", "content": "It's rare that scientists see the good in the presence of an invasive species. But Washington University in St. Louis researchers discovered that a native mosquito in Missouri has fewer parasites when it shares its waters with an interloper.\r\nScratching your … [+3852 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Seth Berkley", "title": "Vaccination lags behind in middle-income countries", "description": "Poor children in relatively rich nations are being let down by immunization programmes, says Seth Berkley.", "url": "https://www.nature.com/articles/d41586-019-01494-y?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01494-y/d41586-019-01494-y_16714822.jpg", "publishedAt": "2019-05-14T00:00:00Z", "content": "Indonesia, Iraq and South Africa now rank among the ten countries with the highest number of under-immunized children worldwide, even though these countries are richer than many of their neighbours. What is going on?\r\nNot so long ago, improving the health of … [+5142 chars]"}, {"source": {"id": null, "name": "Versobooks.com"}, "author": null, "title": "Fully Automated Luxury Communism", "description": "Verso Books is the largest independent, radical publishing house in the English-speaking world.", "url": "https://www.versobooks.com/books/2757-fully-automated-luxury-communism", "urlToImage": null, "publishedAt": "2019-06-12T10:51:12Z", "content": "A different kind of politics for a new kind of society—beyond work, scarcity and capitalismIn the twenty-first century, new technologies should liberate us from work. Automation, rather than undermining an economy built on full employment, is instead the path… [+3898 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Seth Berkley", "title": "Vaccination lags behind in middle-income countries", "description": "Poor children in relatively rich nations are being let down by immunization programmes, says Seth Berkley.", "url": "https://www.nature.com/articles/d41586-019-01494-y", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01494-y/d41586-019-01494-y_16714822.jpg", "publishedAt": "2019-05-14T00:00:00Z", "content": "Indonesia, Iraq and South Africa now rank among the ten countries with the highest number of under-immunized children worldwide, even though these countries are richer than many of their neighbours. What is going on?\r\nNot so long ago, improving the health of … [+5142 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Tamara Bhandari-Washington University", "title": "‘Trained’ master cells could improve TB vaccine", "description": "Training certain cells \"might be one way we can make a more effective vaccine for TB.\"", "url": "https://www.futurity.org/master-cells-tb-vaccine-2078842/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2019/06/TB_cultures_1600.jpg", "publishedAt": "2019-06-07T12:16:43Z", "content": "Bolstering the activity of a master cell responsible for coordinating the body’s immune defenses after a tuberculosis infection could help reduce millions of new infections every year.\r\n“The immune response to the TB bacteria hinges on the early response of t… [+5800 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Tara Haelle, Contributor, Tara Haelle, Contributor https://www.forbes.com/sites/tarahaelle/", "title": "Measles Elimination In Jeopardy: Could The Disease Go From Visitor To Resident?", "description": "Despite having eliminated measles in the year 2000, the US is dangerously close to seeing full-fledged re-emergence of the disease if current outbreaks aren't contained.", "url": "https://www.forbes.com/sites/tarahaelle/2019/05/31/measles-elimination-in-jeopardy-could-the-disease-go-from-visitor-to-resident/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ftarahaelle%2Ffiles%2F2019%2F05%2FmeaslesCDC-1200x795.jpg", "publishedAt": "2019-05-31T23:29:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nMeasles is so infectious that 90% of non-immune people exposed to it will contract the disease, like this baby in Manila, Philipines.\r\nJim Goodson, CDC\r\nIt hasnt quite been two decades since the United S… [+9838 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Ben Yakas", "title": "Video: Lost Bat Rides The F Train Like A Bat Out Of Hell (Hell, In This Case, Is The Subway)", "description": "Pole dancing rats are so May 2019. Indecisive pigeons make me yawn. Domesticated ducks are a dime a dozen. If you've become somewhat numb to the wonders of adorable animals getting lost on the subway, then maybe you just need a slightly more hardcore animal a…", "url": "http://gothamist.com/2019/06/04/video_lost_bat_subway.php", "urlToImage": "http://gothamist.com/assets_c/2019/06/060419batsub1-thumb-640xauto-1029813.jpg", "publishedAt": "2019-06-04T20:11:13Z", "content": "Pole dancing rats are so May 2019. Indecisive pigeons make me yawn. Domesticated ducks are a dime a dozen. If you've become somewhat numb to the wonders of adorable animals getting lost on the subway, then maybe you just need a slightly more hardcore animal a… [+868 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Anne Gulland", "title": "UK urged to show leadership in fight against three big infectious killers", "description": "Health secretary Matt Hancock is being urged to ensure the fight against the world's three biggest infectious disease killers remains a global focus in a meeting with international counterparts this week.", "url": "https://www.telegraph.co.uk/news/0/uk-urged-show-leadership-fight-against-three-big-infectious/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/15/TELEMMGLPICT000195617717-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfy2dmClwgbjjulYfPTELibA.jpeg", "publishedAt": "2019-05-15T16:16:44Z", "content": "Health secretary Matt Hancock is being urged to ensure the fight against the world's three biggest infectious disease killers remains a global focus in a meeting with international counterparts this week.\r\nMr Hancock is attending this week's G7 meeting of hea… [+867 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Monkey-infecting virus may provide part of future HIV vaccine", "description": "A protein from Simian Immunodeficiency Virus (SIV), which can infect monkeys and apes, has shown promise as a potential component of a vaccine against Human Immunodeficiency Virus (HIV).", "url": "https://www.sciencedaily.com/releases/2019/05/190522101948.htm", "urlToImage": null, "publishedAt": "2019-05-22T14:19:48Z", "content": "A protein from Simian Immunodeficiency Virus (SIV), which can infect monkeys and apes, has shown promise as a potential component of a vaccine against Human Immunodeficiency Virus (HIV), in a new study from scientists at Scripps Research in La Jolla, Californ… [+5137 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Sara Reardon, Nature magazine", "title": "Trump Administration Halts Fetal-Tissue Research by Government Scientists", "description": "Policy also requires ethics review for any grant applications to the National Institutes of Health that involve fetal tissue -- Read more on ScientificAmerican.com", "url": "https://www.scientificamerican.com/article/trump-administration-halts-fetal-tissue-research-by-government-scientists/?redirect=1", "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/CCF68285-8276-4112-B1A42A7A062D111E.jpg", "publishedAt": "2019-06-06T14:00:00Z", "content": "U.S. President Donald Trump’s administration is ending fetal-tissue research by government scientists and placing restrictions on academic researchers seeking grants from the National Institutes of Health (NIH) for studies involving fetal tissue.\r\nThe adminis… [+3805 chars]"}, {"source": {"id": null, "name": "Geek.com"}, "author": "Stephanie Valera", "title": "Watch: Tasmanian Devils Enjoy Winter Wonderland in Australia", "description": "Christmas came early: As snow blankets parts of Australia, where June marks the first month of winter, some of the country’s cutest residents are reveling in the wintry conditions. Aussie Ark, home to […] The post Watch: Tasmanian Devils Enjoy Winter Wonderla…", "url": "https://www.geek.com/news/watch-tasmanian-devils-enjoy-winter-wonderland-in-australia-1791275/", "urlToImage": "https://www.geek.com/wp-content/uploads/2019/06/tassiedevil.jpg", "publishedAt": "2019-06-10T20:49:57Z", "content": "Christmas came early: As snow blankets parts of Australia, where June marks the first month of winter, some of the country’s cutest residents are reveling in the wintry conditions.\r\nAussie Ark, home to more than 250 endangered animals, recently released video… [+1149 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "New genetic engineering strategy makes human-made DNA invisible", "description": "Scientists have developed a new technique to genetically engineer bacteria by making human-made DNA invisible to a bacterium's defenses. In theory, the method can be applied to almost any type of bacteria.", "url": "https://www.sciencedaily.com/releases/2019/05/190528140106.htm", "urlToImage": null, "publishedAt": "2019-05-28T18:01:06Z", "content": "Bacteria are everywhere. They live in the soil and water, on our skin and in our bodies. Some are pathogenic, meaning they cause disease or infection. To design effective treatments against pathogens, researchers need to know which specific genes are to blame… [+3832 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "When macrophages are deprived of oxygen", "description": "Infected tissue has a low concentration of oxygen. The body's standard immune mechanisms, which rely on oxygen, can then only function to a limited extent. How does the immune system nevertheless manage to control bacteria under such conditions? Researchers h…", "url": "https://www.sciencedaily.com/releases/2019/05/190524081644.htm", "urlToImage": null, "publishedAt": "2019-05-24T12:16:44Z", "content": "Infected tissue has a low concentration of oxygen. The body's standard immune mechanisms, which rely on oxygen, can then only function to a limited extent. How does the immune system nevertheless manage to control bacteria under such conditions? The working g… [+2164 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Sara Reardon", "title": "Whole-body PET scanner produces 3D images in seconds", "description": "The modified scanner also requires less radioactive exposure, vastly broadening its applications.", "url": "https://www.nature.com/articles/d41586-019-01833-z?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01833-z/d41586-019-01833-z_16790244.jpg", "publishedAt": "2019-06-12T00:00:00Z", "content": "Images created using a modified medical device that can scan the entire body in seconds.Credit: UC Davis; Zhongshan Hospital; United Imaging Healthcare\r\nA medical imaging device that can create 3D renderings of the entire human body in as little as 20 seconds… [+3218 chars]"}, {"source": {"id": null, "name": "Popsci.com"}, "author": "Amelia Urry, Amelia Urry", "title": "Scientists are putting antibiotics into the ocean—on purpose. And it's our only hope.", "description": "Environment A mysterious new coral epidemic is ravaging reefs across the Florida Keys. A mysterious new coral epidemic is ravaging reefs across the Florida Keys. Antibiotics are just one part of a massive rescue operation with little time to spare.", "url": "https://www.popsci.com/coral-antibiotics-science", "urlToImage": "https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/05/psc-diver-coral-reef.jpg?itok=gYkFdr7u", "publishedAt": "2019-06-12T12:00:00Z", "content": "Struggling crops. Salty aquifers. Invading wildlife. Piles of dead fish. The Sunshine State feels the squeeze of environmental change on its beaches, farms, wetlands, and cities. But what afflicts the peninsula predicts the perils that will strike north and w… [+13334 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Sara Reardon", "title": "Whole-body PET scanner produces 3D images in seconds", "description": "The modified scanner also requires less radioactive exposure, vastly broadening its applications.", "url": "https://www.nature.com/articles/d41586-019-01833-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01833-z/d41586-019-01833-z_16790244.jpg", "publishedAt": "2019-06-12T00:00:00Z", "content": "Images created using a modified medical device that can scan the entire body in seconds.Credit: UC Davis; Zhongshan Hospital; United Imaging Healthcare\r\nA medical imaging device that can create 3D renderings of the entire human body in as little as 20 seconds… [+3218 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Rachel Ross", "title": "Measles: Symptoms, Treatment and Vaccination", "description": "Measles is making a comeback. Here's what you should know about one of the most contagious infectious diseases in the world.", "url": "https://www.livescience.com/49688-measles-symptoms-treatment.html", "urlToImage": "https://img.purch.com/h/1000/aHR0cDovL3d3dy5saXZlc2NpZW5jZS5jb20vaW1hZ2VzL2kvMDAwLzEwNS84MDMvb3JpZ2luYWwvbWVhc2xlcy1raWQtZG9jdG9yLmpwZw==", "publishedAt": "2019-05-24T16:10:00Z", "content": "Measles, also called rubeola, is a viral infection that's one of the most contagious infectious diseases in the world. The disease is marked by symptoms that are similar to a common cold, as well as a characteristic red rash. Between 2000 and 2010, the global… [+8436 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "Claire Lampen", "title": "Ex-CDC Chief Tom Frieden Pleads Guilty, Gets No Jail Time Following Groping Allegation", "description": "The former director of the Centers for Disease Control and Prevention, Tom Frieden, pleaded guilty to disorderly conduct on Tuesday, settling a case that revolved around his alleged groping of a family friend. [ more › ]", "url": "http://gothamist.com/2019/06/04/ex-cdc_chief_tom_frieden_to_plead_g.php", "urlToImage": "http://gothamist.com/assets_c/2018/08/082418frieden-thumb-640xauto-1023431.jpg", "publishedAt": "2019-06-04T17:20:21Z", "content": "The former director of the Centers for Disease Control and Prevention, Tom Frieden, pleaded guilty to disorderly conduct on Tuesday, settling a case that revolved around his alleged groping of a family friend. \r\n\"Is there anything you would like to say before… [+1981 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Progress against child mortality lags in many Indian states", "description": "India in 2015 had more deaths among children under five than any other country and had large disparities in the under-five mortality rate between richer and poorer states, according to a new study.", "url": "https://www.sciencedaily.com/releases/2019/05/190514115835.htm", "urlToImage": null, "publishedAt": "2019-05-14T15:58:35Z", "content": "India in 2015 had more deaths among children under five than any other country and had large disparities in the under-five mortality rate between richer and poorer states, according to a study led by researchers at the Johns Hopkins Bloomberg School of Public… [+5152 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aimee Picchi", "title": "On National Doughnut Day, some Dunkin' Donuts customers warned of hepatitis A infection", "description": "Health officials say an infectious worker at a Dunkin' Donuts may have exposed customers to the disease", "url": "https://www.cbsnews.com/news/national-doughnut-day-some-dunkin-donuts-customers-warned-of-hepatitis-a-infection/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2018/09/25/d1d1c0f8-be42-4fc0-88a2-4ea0e9eeeb3f/thumbnail/1200x630/be59b56dbfcabfebb2c72b13dd6b6d74/donut2gettyimages-458335982.jpg", "publishedAt": "2019-06-07T22:42:54Z", "content": "It's National Doughnut Day, but some customers of Dunkin' Donuts may not be feeling like celebrating. That's because health officials in New Jersey are warning patrons of a Turnersville, New Jersey, location that an employee with hepatitis A worked there whil… [+1696 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Bianca Nogrady", "title": "Rapid progress transforms ideals of health", "description": "Ethical and equity challenges become more urgent.", "url": "https://www.nature.com/articles/d41586-019-01438-6?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01438-6/d41586-019-01438-6_16691324.jpg", "publishedAt": "2019-05-15T00:00:00Z", "content": "A human nerve cell (neuron) derived from an induced pluripotent stem cell. Credit: Thomas Deerinck/NCMIR/SPL\r\nThis is the century in which biomedical science could transform the ideal of healthy human life. \r\nConsider the progress of the past few years. Break… [+8412 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Bianca Nogrady", "title": "Rapid progress transforms ideals of health", "description": "Ethical and equity challenges become more urgent.", "url": "https://www.nature.com/articles/d41586-019-01438-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01438-6/d41586-019-01438-6_16691324.jpg", "publishedAt": "2019-05-15T00:00:00Z", "content": "A human nerve cell (neuron) derived from an induced pluripotent stem cell. Credit: Thomas Deerinck/NCMIR/SPL\r\nThis is the century in which biomedical science could transform the ideal of healthy human life. \r\nConsider the progress of the past few years. Break… [+8412 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Madhukar Pai, Contributor, Madhukar Pai, Contributor https://www.forbes.com/sites/madhukarpai/", "title": "A Resource for Global Health Innovators", "description": "Innovations are critical to tackle some of the biggest challenges in global health. The World Health Organization has just launched the Health Product Profile Directory, a free-to-use online, searchable database of target product profiles for various health p…", "url": "https://www-staging.forbes.com/sites/madhukarpai/2019/05/15/a-resource-for-global-health-innovators/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1147277132%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-15T21:12:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nInnovations are critical to solve global health issues, and innovators could benefit from target product profiles\r\nGetty\r\nInnovations are critical to address some of the biggest needs in global health. T… [+13633 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "A.S Jayanth", "title": "Cholera cases put migrant labourers back in focus", "description": "Comprehensive scheme mooted following outbreak in Wayanad", "url": "https://www.thehindu.com/news/national/kerala/cholera-cases-put-migrant-labourers-back-in-focus/article27187794.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2019-05-20T14:11:28Z", "content": "An expert team of doctors from Government Medical College Hospital, Kozhikode, has suggested a comprehensive scheme to track the health parameters of migrant labourers in the State in the wake of the recent cholera outbreak among the population in Wayanad dis… [+2359 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "C. Maya", "title": "State witnesses surge in measles cases", "description": "Majority of cases are reported from the Capital", "url": "https://www.thehindu.com/news/national/kerala/state-witnesses-surge-in-measles-cases/article27182594.ece", "urlToImage": "https://www.thehindu.com/news/national/kerala/7h52ku/article27182590.ece/ALTERNATES/LANDSCAPE_615/20tv-Measlescol", "publishedAt": "2019-05-20T03:17:05Z", "content": "The current global resurgence in measles is having its resonance in Kerala too, which has been witnessing a serious surge in the disease since January. \r\nAcross the globe, huge local outbreaks have been caused by travel as well as the increase in unvaccinated… [+3561 chars]"}, {"source": {"id": null, "name": "Consumerreports.org"}, "author": null, "title": "The Great American Tick Invasion - ConsumerReports.org", "description": "The Great American Tick Invasion ConsumerReports.org The CDC wants to know: Can you spot the difference between a tick and a poppy seed? New York Daily News Tick Bite Pictures - What Does A Tick Bite Look Like? Women's Health Lyme disease a bioweapon gone awr…", "url": "https://www.consumerreports.org/outdoor-safety/the-great-american-tick-invasion/", "urlToImage": "https://article.images.consumerreports.org/prod/content/dam/CRO%20Images%202019/Magazine/07July/CR-Magazine-July-2019-Ticks-0521.jpg", "publishedAt": "2019-05-30T10:07:00Z", "content": "Lone Star ticks have traditionally lived in the Southeast, but as the climate warms theyve been spreading. They can now be found as far north as Maine. In addition to the meat allergy, Lone Stars carry Bourbon virus, Heartland virus, Southern tick-associated … [+2947 chars]"}, {"source": {"id": null, "name": "Kingcounty.gov"}, "author": null, "title": "New measles exposures in Pierce and King Counties - King County", "description": "New measles exposures in Pierce and King Counties King County Man with measles potentially exposes public in King, Pierce counties KING5.com Director Of Infectious Diseases, Epidemiology Discusses Measles Outbreak WCCO - CBS Minnesota UAE travellers should co…", "url": "https://www.kingcounty.gov/depts/health/news/2019/May/12-measles.aspx", "urlToImage": null, "publishedAt": "2019-05-13T02:07:31Z", "content": "Story\r\nTacomaPierce County Health Department and Public Health Seattle &amp; King County are investigating a measles case with possible exposures in both counties. \r\nThe Pierce County resident, a man in his 40s, spent time at sites in Pierce and King counties… [+6607 chars]"}, {"source": {"id": null, "name": "Sciencebasedmedicine.org"}, "author": "David Gorski", "title": "Chronic Lyme disease: Fake diagnosis, not fake disease", "description": "Today, I'd like to so something a bit different than what I usually do, and that's to take a step back and discuss how an experience in the weeds on Twitter last week led me to start to think about a", "url": "https://sciencebasedmedicine.org/fake-diagnoses-not-fake-diseases/", "urlToImage": "https://sciencebasedmedicine.org/wp-content/uploads/2019/05/TickLyme.jpg", "publishedAt": "2019-05-20T07:40:26Z", "content": "Today, I’d like to so something a bit different than what I usually do, and that’s to take a step back and discuss how an experience in the weeds on Twitter last week led me to start to think about a term that we frequently use or, more specifically, rethink … [+22651 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Sara Reardon", "title": "Trump administration bars fetal-tissue research by government scientists", "description": "Policy also requires ethics review for any grant applications to the National Institutes of Health that involve fetal tissue.", "url": "https://www.nature.com/articles/d41586-019-01783-6?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01783-6/d41586-019-01783-6_16774494.jpg", "publishedAt": "2019-06-05T00:00:00Z", "content": "Fetal tissue, such as the red-blood cells shown here, is the centre of a US political battle.Credit: Steve Gschmeissner/Science Photo Library\r\nUS President Donald Trumps administration is ending fetal-tissue research by government scientists. \r\nThe administra… [+2849 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Gaia Vince", "title": "How to survive in the world’s largest refugee camp", "description": "In the chaos of a refugee camp of one million people, the fight to stop the spread of disease is overwhelming.", "url": "https://qz.com/1636922/how-to-survive-in-the-worlds-largest-refugee-camp/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/06/243_Rohingya_Mosaic_Eva_Bee_Hero1.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-06-08T09:00:53Z", "content": "Local villagers helped Shamsark off the boat, all but carrying her and her three small children as they stumbled up the slippery bank to safety. She took one look back across the river, through the grey mist to the orange fires of burning Rohingya villages, t… [+25083 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "HealthDay", "title": "Expert Panel Backs PrEP for People at High HIV Risk", "description": "Best known as the two-drug combo pill Truvada, PrEP prevents HIV from establishing a permanent infection in people exposed through sex or injection drug use, the CDC says.", "url": "https://www.webmd.com/hiv-aids/news/20190611/expert-panel-backs-prep-for-people-at-high-hiv-risk", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/prep_hiv_prevention_other/650x350_prep_hiv_prevention_other.jpg", "publishedAt": "2019-06-11T20:07:08Z", "content": "\"Besides near-perfect protection against HIV, PrEP is a good gateway for young adults to access preventive and primary care services,\" Urbina added.\r\nWith the task force's \"bold\" recommendation, \"the elusive goal of ending the HIV epidemic in the U.S. now see… [+2153 chars]"}, {"source": {"id": null, "name": "Fiercebiotech.com"}, "author": "Nick Paul", "title": "Gilead, AbCellera ink infectious disease antibody discovery pact", "description": "Gilead Sciences has entered into an infectious disease antibody discovery pact with AbCellera. The deal sees Gilead task AbCellera with using technologies to find rare antibodies with certain characteristics.", "url": "https://www.fiercebiotech.com/biotech/gilead-abcellera-ink-infectious-disease-antibody-discovery-pact?utm_source=internal&utm_medium=rss", "urlToImage": "https://qtxasset.com/fiercebiotech/1560414997/gild4.png/gild4.png?Ty.VLPUEjyaVtepFRcEPPddYeYh0p3YV", "publishedAt": "2019-06-13T08:37:55Z", "content": "Gilead Sciences has entered into an infectious disease antibody discovery pact with AbCellera. The deal sees Gilead task AbCellera with using technologies that have landed a string of deals with big biopharma companies to find rare antibodies with certain cha… [+3159 chars]"}, {"source": {"id": null, "name": "Newswars.com"}, "author": "Dan Lyman", "title": "Doctor Predicts “Major Infectious Disease Epidemic” to Hit Los Angeles This Summer", "description": "Says Calif. spiraling out of control", "url": "https://www.newswars.com/doctor-predicts-major-infectious-disease-epidemic-to-hit-los-angeles-this-summer/", "urlToImage": "https://www.newswars.com/wp-content/uploads/2019/05/Skid-Row.jpg", "publishedAt": "2019-05-24T21:45:34Z", "content": "Says Calif. spiraling out of control \r\nBy\r\nDan Lyman \r\nFriday, May 24, 2019 \r\nLos Angeles is on the verge of a significant disease outbreak in the coming months, according to prominent physician and media personality Dr. Drew Pinsky.\r\nPinsky issued the ominou… [+2210 chars]"}, {"source": {"id": null, "name": "Nybooks.com"}, "author": "Meredith Wadman, Leonard Hayflick, Gavin Francis", "title": "The Value of a Cell", "description": "To the Editors : I am not sure how your reviewer Gavin Francis took away from my book, The Vaccine Race: Science, Politics and the Human Costs of Defeating Disease, the idea that the mini-vaccine factories known as WI-38 cells were “donated,” as he writes, fo…", "url": "https://www.nybooks.com/articles/2019/06/27/value-of-cell/", "urlToImage": null, "publishedAt": "2019-06-06T11:30:17Z", "content": "In response to:\r\nResistance to Immunity from the May 23, 2019 issue\r\nTo the Editors:\r\nI am not sure how your reviewer Gavin Francis took away from my book, The Vaccine Race: Science, Politics and the Human Costs of Defeating Disease, the idea that the mini-va… [+4396 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Statistical model could predict future disease outbreaks", "description": "Researchers have created a statistical method that may allow public health and infectious disease forecasters to better predict disease reemergence, especially for preventable childhood infections such as measles and pertussis.", "url": "https://www.sciencedaily.com/releases/2019/05/190521124653.htm", "urlToImage": null, "publishedAt": "2019-05-21T16:46:53Z", "content": "Several University of Georgia researchers teamed up to create a statistical method that may allow public health and infectious disease forecasters to better predict disease reemergence, especially for preventable childhood infections such as measles and pertu… [+4315 chars]"}, {"source": {"id": null, "name": "Naturalnews.com"}, "author": "Mike Adams", "title": "Ohio hospital spreading deadly infectious disease through its water systems", "description": "(Natural News) In April of this year, Natural News reported how U.S. hospitals were releasing deadly superbugs into the open air, infecting both patients and individuals in the local community with a deadly fungal strain known as candida auris. As I wrote the…", "url": "https://www.naturalnews.com/2019-06-02-ohio-hospital-spreading-deadly-infectious-disease-through-its-water-systems.html", "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2019/06/Bacteria-Petri-Dish-Science-Lab.jpg", "publishedAt": "2019-06-02T13:11:22Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": "Sara Reardon", "title": "Gene edits to ‘CRISPR babies’ might have shortened their life expectancy", "description": "Study of almost half a million people links mutation that protects against HIV infection to an earlier death.", "url": "https://www.nature.com/articles/d41586-019-01739-w?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01739-w/d41586-019-01739-w_16763086.jpg", "publishedAt": "2019-06-03T00:00:00Z", "content": "Biophysicist He Jiankui helped to create the world's first gene-edited babies. Credit: Mark Schiefelbein/AP/Shutterstock\r\nThe scientist who edited the genomes of twin girls in an attempt to make them resistant to HIV might have inadvertently shortened their l… [+4990 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Do you have diabetes? These are a few skin conditions you should know about", "description": "Eruptive xanthomatosis is a skin condition that can occur when the body's blood sugar level is not well-controlled and when triglycerides rises to extremely high levels.", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-skin-conditions-blood-sugar-level-5741821/", "urlToImage": "https://images.indianexpress.com/2019/05/diabetes-thinkstockphotos759.jpg?w=759", "publishedAt": "2019-05-22T07:14:32Z", "content": "Diabetic people have too much glucose (sugar) in their blood, which can cause some serious skin complications. (Photo by Thinkstock Images)\r\nDiabetes is one of the most common disease in India, in which the body’s ability to process the blood glucose or blood… [+3110 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Debbie Ponchner", "title": "New Finding Advances the Search for a Universal Flu Vaccine", "description": "Antibodies to a portion of the influenza virus that varies relatively little from strain to strain may provide flu protection in humans -- Read more on ScientificAmerican.com", "url": "https://www.scientificamerican.com/article/new-finding-advances-the-search-for-a-universal-flu-vaccine/", "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/51EFC1BB-786F-4FBD-9F8F59A58CCC982F.jpg", "publishedAt": "2019-06-03T18:45:00Z", "content": "The quest for a universal flu vaccine, one that provides long-lasting protection from multiple types of influenza, even those that might cause a pandemic, has moved a step closer.\r\nFor the first time, scientists have shown that targeting a specific portion of… [+5643 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Sara Reardon", "title": "Gene edits to ‘CRISPR babies’ might have shortened their life expectancy", "description": "Study of almost half a million people links mutation that protects against HIV infection to an earlier death.", "url": "https://www.nature.com/articles/d41586-019-01739-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01739-w/d41586-019-01739-w_16763086.jpg", "publishedAt": "2019-06-03T00:00:00Z", "content": "Biophysicist He Jiankui helped to create the world's first gene-edited babies. Credit: Mark Schiefelbein/AP/Shutterstock\r\nThe scientist who edited the genomes of twin girls in an attempt to make them resistant to HIV might have inadvertently shortened their l… [+4990 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Scientists reveal details of how flu and bacteria work together to promote infection", "description": "St. Jude Children's Research Hospital scientists have evidence the influenza virus functions like Velcro to help common respiratory bacteria gain a foothold in the airways. The research appears today as an advance online publication in the journal Nature Micr…", "url": "https://phys.org/news/2019-05-here-another-reason-to-cover.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2013/influenza.jpg", "publishedAt": "2019-05-22T13:26:25Z", "content": "St. Jude Children's Research Hospital scientists have evidence the influenza virus functions like Velcro to help common respiratory bacteria gain a foothold in the airways. The research appears today as an advance online publication in the journal Nature Micr… [+2717 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Brittany A. Roston", "title": "Health officials and CDC discussed no-fly list for measles patients", "description": "Officials at both the local and state levels consulted with the Centers for Disease Control and Prevention (CDC) about putting some people who were potentially infected with measles on the Do Not Board list, it has been revealed. The discussions aimed to redu…", "url": "https://www.slashgear.com/health-officials-and-cdc-discussed-no-fly-list-for-measles-patients-24577921/", "urlToImage": "https://edge.slashgear.com/wp-content/uploads/2019/05/airport_cc0_unsplash.jpg", "publishedAt": "2019-05-24T19:44:46Z", "content": "Officials at both the local and state levels consulted with the Centers for Disease Control and Prevention (CDC) about putting some people who were potentially infected with measles on the Do Not Board list, it has been revealed. The discussions aimed to redu… [+2037 chars]"}, {"source": {"id": null, "name": "Outsideonline.com"}, "author": "Jonathan Olivier", "title": "'Bitten' Explores a Lyme Disease Conspiracy", "description": "Kris Newby dives deep to unearth a secret history of government cover-ups in the spread of Lyme disease, but her research rests on shaky ground", "url": "https://www.outsideonline.com/2395909/bitten-kris-newby-book-review", "urlToImage": "https://www.outsideonline.com/sites/default/files/styles/full-page/public/2019/05/14/tick-on-grass_h.jpg?itok=GuTehi4i", "publishedAt": "2019-05-29T16:29:31Z", "content": "Kris Newby’s new nonfiction book Bitten: The Secret History of Lyme Disease and Biological Weapons($29, Harper Wave) reads like a thriller. There are hidden bank accounts, Russian agents, and government deception. Yes, it’s about ticks.\r\nIt all starts with Sw… [+7078 chars]"}, {"source": {"id": null, "name": "Nbc11news.com"}, "author": "Joshua Vorse", "title": "Measles now a concern when traveling in the US - KKCO-TV", "description": "Measles now a concern when traveling in the US KKCO-TV Health officials considered no-fly list to prevent measles transmission CNN Measles and mumps outbreak prompts vaccination calls Sky News The measles virus has broken out in half the American states Down …", "url": "https://www.nbc11news.com/content/news/Measles-now-a-concern-when-traveling-in-the-US-510341281.html", "urlToImage": "https://media.graytvinc.com/images/vlc2019-05-23-14h31m11s886.png", "publishedAt": "2019-05-23T20:35:25Z", "content": "GRAND JUNCTION, Colo. (KKCO/KJCT)-- Measles is now a concern for vacationers in the United States, not just people traveling internationally.\r\nThere have been no cases so far this year in Mesa County, and only one confirmed in Colorado, but the health departm… [+1137 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Unhealthy gut promotes breast cancer spread, says study", "description": "According to the researchers from the University of Virginia in the US, following a healthy diet and lifestyle can help reduce severity of breast cancer.", "url": "https://indianexpress.com/article/lifestyle/health/unhealthy-gut-promotes-breast-cancer-spread-study-5775064/", "urlToImage": "https://images.indianexpress.com/2019/06/breastcancer_759_thinkstock.jpg?w=759", "publishedAt": "2019-06-11T09:18:15Z", "content": "Most breast cancers are hormone receptor positive, which means that their growth is fuelled by a hormone, either estrogen or progesterone. (Photo: Thinkstock Images)\r\nAn unhealthy, inflamed gut can drive breast cancer to become much more invasive and promote … [+2384 chars]"}]}