{"status": "ok", "totalResults": 2563, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Alexander C. Kaufman", "title": "Trump’s Latest Attack on Federal Climate Science May Backfire", "description": "The Trump administration's bid to weaken federal climate science comes at a time when voters increasingly agree that a climate crisis is imminent.", "url": "https://www.wired.com/story/trumps-latest-attack-on-federal-climate-science-may-backfire/", "urlToImage": "https://media.wired.com/photos/5cf05f80b7de8d0cb8181630/191:100/pass/science_trump_1146943132.jpg", "publishedAt": "2019-05-31T12:00:00Z", "content": "This story originally appeared on HuffPost and is part of the Climate Desk collaboration.\r\nAs planet-warming gases reach levels not previously seen in human history, the Trump administrations bid to restrict how federal scientists conduct the next National Cl… [+9403 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "JOSE A. DEL REAL", "title": "‘Flint Is Everywhere’: California Farmworkers Confront a Tainted Water Crisis", "description": "Bottled water at a home in East Orosi, Calif. The failing water systems in the state are most heavily concentrated in the small towns of the Central and Salinas Valleys, the key centers of agriculture.", "url": "https://www.nytimes.com/2019/05/21/us/california-central-valley-tainted-water.html", "urlToImage": "https://static01.nyt.com/images/2019/05/13/us/00toxicfarmwater-02alt/00toxicfarmwater-02alt-facebookJumbo.jpg", "publishedAt": "2019-05-21T09:30:07Z", "content": "But the debate in Sacramento feels far away in East Orosi, a farmworker community of about 500 nestled along the foot of the Sierra Nevada that is surrounded by fields of oranges. There, residents complain of conditions that resemble the developing world, not… [+2312 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Yessenia Funes on Earther, shared by Maddie Stone to Gizmodo", "title": "Presidential Candidate Julian Castro Releases Plan to Eliminate Lead Poisoning in America", "description": "Many presidential candidates have released climate change plans, but what about plans to address environmental health hazards like lead? Democratic candidate Julián Castro released a formal lead elimination plan Monday—making him the first White House hopeful…", "url": "https://earther.gizmodo.com/presidential-candidate-julian-castro-releases-plan-to-e-1835409591", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--14tmlQG0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/labxaq36lnklrgviey0s.jpg", "publishedAt": "2019-06-11T16:00:00Z", "content": "Manypresidentialcandidates have released climate change plans, but what about plans to address environmental health hazards like lead? Democratic candidate Julián Castro released a formal lead elimination plan Mondaymaking him the first White House hopeful to… [+3253 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "Authorities Seize Phones and Computers of Michigan Officials in Flint Water Crisis Investigation", "description": "Michigan authorities have seized the state-owned phone of former Governor Rick Snyder that was, until recently, in government storage, according to the Associated Press. The phones of 65 current and former officials were also seized as the state investigates …", "url": "https://gizmodo.com/authorities-seize-phones-and-computers-of-michigan-offi-1835230196", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--9Inj_Tk1--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dkihxkarobqlbwqqmmjw.jpg", "publishedAt": "2019-06-04T12:00:00Z", "content": "Michigan authorities have seized the state-owned phone of former Governor Rick Snyder that was, until recently, in government storage, according to the Associated Press. The phones of 65 current and former officials were also seized as the state investigates … [+2119 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Caroline Hickman", "title": "Our environmental problem is also a mental problem", "description": "If we block out our emotions, then we are unable to connect with the urgency of the crisis. Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing…", "url": "https://www.fastcompany.com/90358827/our-environmental-problem-is-also-a-mental-problem?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/p-1-our-environmental-problem-is-also-a-mental-problem.jpg", "publishedAt": "2019-06-08T10:04:49Z", "content": "Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing is, in these extreme circumstances, a bit of depression about the environment could be prec… [+5648 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Former Michigan Gov. Rick Snyder's phone seized in Flint water investigation", "description": "Authorities seized the cellphone and hard drive of former Michigan Gov. Rick Snyder as part of their probe into the Flint water crisis, according to search warrants obtained by CNN.", "url": "https://www.cnn.com/2019/06/03/politics/former-michigan-governor-phone-seized-flint-water-crisis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160306212158-rick-snyder-0127-super-tease.jpg", "publishedAt": "2019-06-03T22:27:35Z", "content": "Washington (CNN)Authorities seized the cellphone and hard drive of former Michigan Gov. Rick Snyder as part of their probe into the Flint water crisis, according to search warrants obtained by CNN. \r\nSnyder and more than 65 other current or former officials h… [+1932 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Trudeau is to blame for national unity crisis over pipelines - The Globe and Mail", "description": "Trudeau is to blame for national unity crisis over pipelines The Globe and Mail Ottawa rejects nearly all Tory amendments to contentious resource development bill The Globe and Mail Bill C-69: Liberals Turn Down Most Tory Changes To Proposed Legislation HuffP…", "url": "https://www.theglobeandmail.com/politics/article-trudeau-is-to-blame-for-national-unity-crisis-over-pipelines/", "urlToImage": "https://www.theglobeandmail.com/resizer/kI58wX__0BtvjVqey16VTZ-Di1o=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/TQ76XLQLVJCYJOEEAD24KHQGAI.JPG", "publishedAt": "2019-06-13T00:27:48Z", "content": "Justin Trudeau blaming premiers for a national unity crisis that he created is pretty rich.\r\nThis Prime Ministers approach to federalism which can be summarized as do as I say, or else has premiers from the Bay of Fundy to the Rocky Mountains to the Arctic Oc… [+4456 chars]"}, {"source": {"id": null, "name": "Dailystar.com.lb"}, "author": null, "title": "Merkel's coalition in crisis talks after EU vote debacle - The Daily Star", "description": "Merkel's coalition in crisis talks after EU vote debacle The Daily Star European elections 2019: Germany results - BBC News Editors Choice How were the EU elections for Italy, France and Germany? Our panel responds The Guardian Greens surge as German governin…", "url": "http://www.dailystar.com.lb//News/World/2019/May-27/484083-merkels-coalition-in-crisis-talks-after-eu-vote-debacle.ashx", "urlToImage": "http://www.dailystar.com.lb//dailystar/Pictures/2019/05/27/778010_img650x420_img650x420_crop.jpg", "publishedAt": "2019-05-27T07:16:00Z", "content": "German Chancellor Angela Merkel's embattled coalition will hold crisis talks Monday after a thumping at European polls that has reignited questions over its survival.\r\nThe Greens also snatched second spot from the Social Democratic Party, coming in just behin… [+515 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Xeni Jardin", "title": "FLINT: Investigators seize technology devices of former GOP governor Rick Snyder and 65 others", "description": "Authorities investigating Flint water crisis seize mobile devices from former Gov. Rick Snyder and 65 other officials.", "url": "https://boingboing.net/2019/06/03/flint-investigators-seize-tec.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/06/snyd.png", "publishedAt": "2019-06-04T00:14:11Z", "content": "Authorities investigating Flint water crisis seize mobile devices from former Gov. Rick Snyder and 65 other officials.\r\nInvestigators looking into the ongoing water crisis in Flint, Michigan are using search warrants to seize mobile phones and other devices u… [+1884 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Maddie Stone on Earther, shared by Maddie Stone to Gizmodo", "title": "Finally, a Climate Change Documentary That Will Get You Excited to Fix It", "description": "Whether the audience is policy wonks, nature lovers, or environmental activists, documentaries on climate change still feel like a niche thing in 2019. Which is what makes Ice on Fire, the climate documentary co-produced and narrated by Leonardo DiCaprio that…", "url": "https://earther.gizmodo.com/finally-a-climate-change-documentary-that-will-get-you-1835448238", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--uSzU6_UJ--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zdoxbwkxodcoxltg1vsr.jpg", "publishedAt": "2019-06-12T18:30:00Z", "content": "Whether the audience is policy wonks, nature lovers, or environmental activists, documentaries on climate change still feel like a niche thing in 2019. Which is what makes Ice on Fire, the climate documentary co-produced and narrated by Leonardo DiCaprio that… [+5317 chars]"}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Judy  George", "title": "Can CBD Curb Heroin Addiction? | Medpage Today - MedPage Today", "description": "Can CBD Curb Heroin Addiction? | Medpage Today MedPage Today Study finds CBD effective in treating heroin addiction CNN CBD oil may help limit cravings and anxiety in heroin users, study finds NBC News CBD Effective in Treating Heroin Addiction, Study Finds W…", "url": "https://www.medpagetoday.com/publichealthpolicy/opioids/79944", "urlToImage": "https://clf1.medpagetoday.com/media/images/79xxx/79944.jpg", "publishedAt": "2019-05-21T04:05:54Z", "content": "Cannabidiol (CBD; Epidiolex) reduced opioid cravings and anxiety among heroin users, suggesting it may have a role in curbing addiction, an exploratory trial found.\r\nCompared with placebo, once daily CBD 400 or 800 mg diminished cue-related cravings and anxie… [+3395 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Elizabeth Piper", "title": "Britain's May offers \"new deal\" to try to break Brexit deadlock", "description": "Prime Minister Theresa May will set out on Tuesday a \"new deal\" for Britain's departure from the European Union, her fourth attempt to break an impasse in parliament over Brexit that has plunged her government into crisis.", "url": "https://www.reuters.com/article/us-britain-eu-idUSKCN1SR1JG", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190521&t=2&i=1389457812&w=1200&r=LYNXNPEF4K184", "publishedAt": "2019-05-21T13:49:02Z", "content": "LONDON (Reuters) - Prime Minister Theresa May will set out on Tuesday a “new deal” for Britain’s departure from the European Union, her fourth attempt to break an impasse in parliament over Brexit that has plunged her government into crisis. \r\nThree years sin… [+3697 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ari Natter / Bloomberg", "title": "Greenpeace Gives Joe Biden a D- on Climate Change Report Card", "description": "Joe Biden got a D-minus on a climate change report card ranking Democratic presidential candidates released by the liberal environmental group Greenpeace.", "url": "http://time.com/5598313/jo-biden-climate-change-report-card/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/joe-biden.jpg?quality=85", "publishedAt": "2019-05-30T16:22:16Z", "content": "Joe Biden got a D-minus on a climate change report card ranking Democratic presidential candidates released Thursday by the liberal environmental group Greenpeace.\r\nBiden, the Democratic front runner, has yet to release a detailed plan on how he will combat c… [+1861 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Suyin Haynes", "title": "Students From 1,600 Cities Just Walked Out of School to Protest Climate Change. It Could Be Greta Thunberg’s Biggest Strike Yet", "description": "Hundreds of thousands of students around the world walked out of their schools and colleges Friday in the latest in a series of strikes urging action to address the climate crisis. According to event organizers Fridays for Future, over 1664 cities across 125 …", "url": "http://time.com/5595365/global-climate-strikes-greta-thunberg/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/05/gettyimages-1145820097.jpg?quality=85", "publishedAt": "2019-05-24T17:13:45Z", "content": "Hundreds of thousands of students around the world walked out of their schools and colleges Friday in the latest in a series of strikes urging action to address the climate crisis. According to event organizers Fridays for Future, over 1664 cities across 125 … [+9650 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Brian Kahn on Earther, shared by Maddie Stone to Gizmodo", "title": "Radiohead Is Selling Its 'Hacked' Archives In the Name of Climate Change", "description": "If you hate climate change but love Radiohead, man do I have a two-for-one deal for you. The band has released 18 hours of OK Computer-era recordings it says were being held for ransom after band member Thom Yorke’s minidisc archive was stolen. The band is do…", "url": "https://earther.gizmodo.com/radiohead-is-selling-its-hacked-archives-in-the-name-of-1835417589", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Tz3PI-g0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/g9elbtl00bmve9tcmgb6.jpg", "publishedAt": "2019-06-11T18:40:00Z", "content": "If you hate climate change but love Radiohead, man do I have a two-for-one deal for you. The band has released 18 hours of OK Computer-era recordings it says were being held for ransom after band member Thom Yorkes minidisc archive was stolen. The band is don… [+3103 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Daniel Kolitz on Earther, shared by Marina Galperina to Gizmodo", "title": "Is the World Really Overpopulated?", "description": "The notion that we’re headed towards some kind of populational apocalypse—that there exists a line which, once crossed, will lead inexorably to mass starvation, and a whole planet like Penn Station at rush hour—has been used to stoke fear and sell books for m…", "url": "https://earther.gizmodo.com/is-the-world-really-overpopulated-1834854464", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--WG7upEb1--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ekpa7s4umzxv2yu6sfz1.png", "publishedAt": "2019-05-20T13:39:00Z", "content": "The notion that were headed towards some kind of populational apocalypsethat there exists a line which, once crossed, will lead inexorably to mass starvation, and a whole planet like Penn Station at rush hourhas been used to stoke fear and sell books for more… [+18050 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Opinion: Horgan will appeal court's ruling because he has backers to appease, but he will lose again - The Globe and Mail", "description": "Opinion: Horgan will appeal court's ruling because he has backers to appease, but he will lose again The Globe and Mail In win for Trans Mountain, court rules B.C. can’t restrict oil shipments Calgary Herald Appeal court says B.C. can't restrict oil shipments…", "url": "https://www.theglobeandmail.com/opinion/article-horgan-will-appeal-courts-ruling-because-he-has-backers-to-appease/", "urlToImage": "https://www.theglobeandmail.com/resizer/SoLcxugEmihEPOSx9UWqoOKs-MI=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/J7BHB4NL4NCBHJ32N5HPXZ6FPY.jpg", "publishedAt": "2019-05-24T22:39:47Z", "content": "B.C. Premier John Horgan has encountered a problem in his bid to use every tool in his tool box to stop the proposed Trans Mountain pipeline expansion: hes quickly running out of implements.\r\nThe provinces highest court on Friday rejected the contention by Mr… [+4676 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "CO2 just hit an all-time record. But that’s not the worst of it.", "description": "The rapid rise continues, relentlessly. The Scripps Institution of Oceanography and the National Oceanic and Atmospheric Administration (NOAA) announced Tuesday that the official peak of carbon dioxide concentrations in 2019 hit 414.8 parts per million, or pp…", "url": "https://mashable.com/article/climate-change-co2-record/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F04%252F07%252Fb7c23e8562eb4717ab6fb8d647db70da.fdeb9.png%252F1200x630.png?signature=ba7WFLrYh4iKAwbq5uPTf4xBEMk=", "publishedAt": "2019-06-04T14:35:15Z", "content": "The rapid rise continues, relentlessly.\r\nThe Scripps Institution of Oceanography and the National Oceanic and Atmospheric Administration (NOAA) announced Tuesday that the official peak of carbon dioxide concentrations in 2019 hit 414.8 parts per million, or p… [+4997 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Environmental justice issues", "description": "New research examined the impact that bottom-up, community-level initiatives have in addressing environmental justice issues. They found that the best way to address a community's environmental injustices is to meet them where they are, integrating into the c…", "url": "https://www.sciencedaily.com/releases/2019/05/190529113059.htm", "urlToImage": null, "publishedAt": "2019-05-29T15:30:59Z", "content": "For the past 40 years, research has proven that people of color, low-income communities and ethnic minorities suffer the effects of environmental contamination more than other communities. The Flint, Mich., water crisis and the Dakota Pipeline protests serve … [+4255 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Laignee Barron / Hong Kong", "title": "How the Tiananmen Square Massacre Changed China Forever", "description": "The Chinese government survived a crisis of legitimacy the only way it knew how: by accelerating the economy at the expense of freedoms", "url": "https://time.com/5600363/china-tiananmen-30-years-later/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/tiananmen-liberty-sign.jpg?quality=85", "publishedAt": "2019-06-04T12:07:49Z", "content": "The Goddess of Democracy smiled on China for exactly five days. The papier-mâché likeness of the Statue of Liberty appeared in Tiananmen Square as protests convulsed Beijing and other cities seeking to unshackle the world’s most populous country from endemic … [+10837 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Jesse Ferreras", "title": "Climate change plays ‘major role’ in wildfires, study shows. But Alberta’s premier says it’s ‘complex’ - Global News", "description": "Climate change plays ‘major role’ in wildfires, study shows. But Alberta’s premier says it’s ‘complex’ Global News Breathe easy, haze not caused by Alberta wildfires: NEWS 1130 meteorologists CityNews Vancouver Across Alberta, B.C. and northern Ontario, thous…", "url": "https://globalnews.ca/news/5340587/climate-change-alberta-wildfires-study/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2019/05/21122841-1.jpg?quality=70&strip=all&crop=0px%2C134px%2C982px%2C518px&resize=720%2C379", "publishedAt": "2019-06-01T02:09:57Z", "content": "With 10,000 people displaced and 16 homes destroyed by Alberta’s wildfires so far this year, Premier Jason Kenney found himself answering questions Friday about his government’s decision to kill the carbon tax the day prior.\r\nWith the tax gone, his government… [+6086 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "Thomas Frank, E&E News", "title": "Levees Won't Save Louisiana from a Climate \"Existential Crisis\"", "description": "A stark new report lays out the ways the state will need to adapt, beyond traditional engineering approaches -- Read more on ScientificAmerican.com", "url": "https://www.scientificamerican.com/article/levees-wont-save-louisiana-from-a-climate-existential-crisis/", "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/C1082757-C88D-40EE-B12E2C177C165FF5.jpg", "publishedAt": "2019-05-17T16:30:00Z", "content": "It’s not surprising that a new report says Louisiana may have to cede flood-prone communities to nature, shift the state economy away from fishing and oil refining, and adapt to the inevitability of climate change.\r\nBut the recommendations in a 1,500-page rep… [+5140 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Opinion contributors, Michael E. Mann and Jonathan Brockopp, Opinion contributors", "title": "You can't save the climate by going vegan. Corporate polluters must be held accountable.", "description": "Many individual actions to slow climate change are worth taking. But they distract from the systemic changes that are needed to avert this crisis.", "url": "https://www.usatoday.com/story/opinion/2019/06/03/climate-change-requires-collective-action-more-than-single-acts-column/1275965001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/05/29/USAT/0019a88a-a9e6-4d52-9408-1da650e9e493-Climate_change.jpg?crop=4499,2520,x0,y359&width=3200&height=1680&fit=bounds", "publishedAt": "2019-06-03T09:00:04Z", "content": "People start pollution. People can stop it. That was the tag line of the famous Crying Indian ad campaign that first aired on Earth Day in 1971. It was, as it turns out, a charade. Not only was Iron Eyes Cody actually an Italian-American actor, the campaign i… [+4787 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Sanjana Karanth", "title": "Julián Castro Is First 2020 Presidential Candidate To Visit Flint", "description": "The Democrat visited the Michigan city \"to let them know that we haven’t forgotten about them.\"", "url": "https://www.huffpost.com/entry/julian-castro-flint-michigan-2020_n_5cfd7f84e4b02ee34778f0aa", "urlToImage": "https://img.huffingtonpost.com/asset/5cfd82e8240000280f85a4d5.jpeg?cache=wips28wjeh&ops=1910_1000", "publishedAt": "2019-06-09T23:10:26Z", "content": "Julián Castro became the first 2020 presidential candidate this weekend to visit Flint, Michigan  a city that continues to struggle with access to clean water five years after the areas water crisis began.\r\nThe Democrat, who is the former secretary of housing… [+4018 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Edoardo Liotta, Gavin Butler", "title": "This Photographer Shows Us the Pollution We Can’t See for Ourselves", "description": "Flying hundreds of feet above land, J. Henry Fair uncovers everyday environmental catastrophes you probably didn’t know existed.", "url": "https://www.vice.com/en_us/article/kzm75z/photographer-shows-pollution-we-cant-see-ourselves-environment-disaster-toxic-waste", "urlToImage": "https://video-images.vice.com/articles/5cdcd6bce0ada000076f89bd/lede/1557981982870-pjimage-7.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2019-05-20T20:45:00Z", "content": "Photogrpahy by J Henry Fair.This article originally appeared on VICE Asia.\r\nTrash-covered beaches, turtles asphyxiated by fluorescent pink drinking straws, and thick gray smogthese are the kinds of images we typically associate with pollution around the world… [+7181 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Nancy Pelosi Is Right: Trump’s Criminal Contempt of Congress Is a Constitutional Crisis", "description": "Photo Illustration by Elizabeth Brockway/The Daily Beast“The House of Representatives…shall have the sole Power of Impeachment.” —U.S. Constitution (1789) “…no person can be punished for contumacy as a witness before either house, unless his testimony is requ…", "url": "https://news.yahoo.com/nancy-pelosi-trump-criminal-contempt-085046366.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jP5Twym59FI7aBHkgTeXVQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/09cdbec4773e4354eb5cde99cd2c6850", "publishedAt": "2019-05-16T08:50:46Z", "content": "The House of Representativesshall have the sole Power of Impeachment. U.S. Constitution (1789)\r\nno person can be punished for contumacy as a witness before either house, unless his testimony is required in a matter into which that house has jurisdiction to in… [+9773 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Adele Peters", "title": "This startup is going to put one of the world’s largest sustainable greenhouses in coal country", "description": "AppHarvest is building a 60-acre greenhouse in Kentucky to provide a new source of sustainable agriculture that doesn’t need to be shipped so far into East Coast cities. On land that was once part of a cattle ranch outside Morehead, Kentucky–a small town wher…", "url": "https://www.fastcompany.com/90360546/this-startup-is-going-to-put-one-of-the-worlds-largest-sustainable-greenhouses-in-coal-country?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/5-in-coal-country-this-startup-is-building-one.jpg", "publishedAt": "2019-06-10T12:15:08Z", "content": "On land that was once part of a cattle ranch outside Morehead, Kentucky–a small town where roughly one in three people live below the poverty line–a massive new 60-acre high-tech greenhouse is designed to bring back local jobs while shrinking the environmenta… [+3938 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Sarah Krichel, Natasha Grzincic", "title": "Siberia Could Become More Habitable Due to the Climate Crisis, Scientists Find", "description": "The climate will become milder across Asian Russia by the 2080s, making it way easier to live there.", "url": "https://www.vice.com/en_us/article/wjv4mb/siberia-could-become-more-habitable-due-to-the-climate-crisis-scientists-find", "urlToImage": "https://video-images.vice.com/articles/5cf999b695a96f000847cd2d/lede/1559861967080-GettyImages-954833372.jpeg?crop=1xw:0.843xh;0xw,0.0347xh&resize=1200:*", "publishedAt": "2019-06-06T23:14:31Z", "content": "The climate crisis could mean more people living in Siberia. Photo: Simon Dubreuil/Getty Images A large swath of Siberia could become habitable by 2080 because of the climate crisis, new research has found.\r\n In a study published Thursday in Environmental Res… [+1968 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "CTVNews.ca's Josh Dehaas", "title": "Liberals plan to ban single-use plastics as early as 2021: source - CTV News", "description": "Liberals plan to ban single-use plastics as early as 2021: source CTV News The Liberal government will announce on Monday that it intends to ban single-use plastics as early as 2021, a source tells CTV News.", "url": "https://www.ctvnews.ca/politics/liberals-plan-to-ban-single-use-plastics-as-early-as-2021-source-1.4458730", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4458733.1560113789!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2019-06-09T21:01:00Z", "content": "The Liberal government will announce on Monday that it intends to ban single-use plastics as early as 2021, a source tells CTV News.\r\nThe exact products that will be banned in Canada will be determined after public consultations, according to the source.\r\nThe… [+2332 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Geoff Dembicki, Harry Cheadle", "title": "Inside the Courtroom Where Teens Are Suing the Government Over the Climate Crisis", "description": "Three judges will determine whether the landmark lawsuit will fizzle out or lead to a history-making trial.", "url": "https://www.vice.com/en_us/article/xwn5vq/juliana-v-united-states-arguments-heard-in-oregon", "urlToImage": "https://video-images.vice.com/articles/5cf7314dd915310007b10622/lede/1559704418371-AP_19156045488479.jpeg?crop=1xw:0.7713xh;0xw,0.0468xh&resize=1200:*", "publishedAt": "2019-06-05T03:50:35Z", "content": "Protesters outside the Portland, Oregon, courtroom where judges heard arguments in the climate lawsuit. Photo by AP Photo/Steve Dipaola The fate of a lawsuit alleging that the US government is putting an entire generation of young people in danger by enabling… [+6668 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Shayla Love, Ankita Rao", "title": "Actually Humans Probably Will Survive the Climate Crisis", "description": "Reports that say we’re all doomed in the face of climate change ignore a history of survival—and the opportunity to make the future better.", "url": "https://www.vice.com/en_us/article/nea93d/actually-humans-probably-will-survive-the-climate-crisis", "urlToImage": "https://video-images.vice.com/articles/5cfed41e9ab4ce00085c6788/social_lede/1560204382652-GettyImages-709125541-1.jpeg?crop=1xw:0.8877936241610739xh;center,center&resize=1200:*", "publishedAt": "2019-06-11T15:01:20Z", "content": "In March, paleoecologist Jacquelyn Gill wrote a tweet containing possibly the most radical emotion a scientist can have about the climate crisis right now: optimism. \r\nGills research at the University of Maine looks to the past to understand how species will … [+12343 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "DNC swiftly kills the idea of a climate change debate", "description": "There will be as many as 12 Democratic presidential debates over the next year. But none of them devoted to climate change — for now, anyway. Presidential candidate Jay Inslee — who is running as a climate change candidate with a deeply developed plan to tran…", "url": "https://mashable.com/article/climate-debate-cancelled-jay-inslee/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F06%252Fd8%252Fb4e8e6afa2074a4eb202803d73f52f76.c9fec.png%252F1200x630.png?signature=bwbWQl4ICHrLl_K9mN-uFKRz41c=", "publishedAt": "2019-06-06T15:37:19Z", "content": "There will be as many as 12 Democratic presidential debates over the next year. But none of them will be devoted to climate change for now, anyway.\r\nPresidential candidate Jay Inslee who is running as a climate change candidate with a deeply developed plan to… [+4538 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Opinion columnist, Paul Brandus, Opinion columnist", "title": "Would we have survived the Cuban missile crisis if Donald Trump had been president in 1962?", "description": "Trump's disregard for U.S. intelligence is increasingly risky as threats mount, from Iran and North Korea to climate change and Russian intervention.", "url": "https://www.usatoday.com/story/opinion/2019/05/16/donald-trump-intelligence-community-disdain-national-crisis-decision-dictators-column/3678884002/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/authoring/2019/05/15/USAT/86cc44e1-39e4-4a28-913a-8169a842d5e7-AFP_AFP_18N8MZ.JPG?crop=5166,2906,x0,y547&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-16T07:15:06Z", "content": "Millions of Americans could have been killed in a matter of minutes. Thats how terrifying it was during the Cuban missile crisis easily the most frightening moment of the Cold War. The only reason we are here today is because President John F. Kennedy and Sov… [+6180 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": "Cory Doctorow", "title": "To reduce plastic packaging, ship products in solid form", "description": "There's no one way to solve the plastic waste problem, but in the packaged goods sector, an enormous amount of plastic is used in order to surround and protect simple solutions of some agent dissolved in water, from toothpaste to window cleaner to shampoo. Tr…", "url": "https://boingboing.net/2019/05/31/just-say-haitch-two-no.html", "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/05/2691558545_9f7ed9c322_o.jpg", "publishedAt": "2019-05-31T14:09:43Z", "content": "There's no one way to solve the plastic waste problem, but in the packaged goods sector, an enormous amount of plastic is used in order to surround and protect simple solutions of some agent dissolved in water, from toothpaste to window cleaner to shampoo.\r\nT… [+3372 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": null, "title": "Why It’s Time to Finally Worry about ESG", "description": "Robert Eccles, a visiting professor of management practice at Saïd Business School at the University of Oxford, says that the global investment community’s interest in environmental, social, and governance (ESG) issues has finally reached a tipping point. Lar…", "url": "https://hbr.org/ideacast/2019/05/why-its-time-to-finally-worry-about-esg", "urlToImage": "https://hbr.org/resources/images/article_assets/2018/01/wide-ideacast.jpg", "publishedAt": "2019-05-21T13:30:03Z", "content": "Robert Eccles, a visiting professor of management practice at Saïd Business School at the University of Oxford, says that the global investment communitys interest in environmental, social, and governance (ESG) issues has finally reached a tipping point. Larg… [+24002 chars]"}, {"source": {"id": null, "name": "Itsnicethat.com"}, "author": "Josh Baines", "title": "Nowness examines the ongoing climate crisis with new series, Survival Season", "description": "The video-heavy platform has entered the climate crisis foray with a quartet of new films focused on environmental issues from across the globe.", "url": "https://www.itsnicethat.com/news/nowness-survival-season-climate-change-season-film-040619", "urlToImage": "https://www.itsnicethat.com/system/files/062019/5cf62b017fa44c88560000f0/index_default/Nowness-survival-season-climate-change-season-film-itsnicethat-01.jpg?1559637395", "publishedAt": "2019-06-04T08:30:00Z", "content": "Launched in 2010, Nowness has been at the vanguard of video content for the best part of almost a decade now, and the platforms latest project sees it tackling the present days hottest topic: climate change.\r\n#SurvivalSeason, a quartet of new short films whic… [+1165 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "New study details outcomes from long-term environmental justice partnership in East End", "description": "For the past 40 years, research has proven that people of color, low-income communities and ethnic minorities suffer the effects of environmental contamination more than other communities. The Flint, Mich., water crisis and the Dakota Pipeline protests serve …", "url": "https://phys.org/news/2019-05-outcomes-long-term-environmental-justice-partnership.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/letsclearthe.jpg", "publishedAt": "2019-05-29T15:53:05Z", "content": "For the past 40 years, research has proven that people of color, low-income communities and ethnic minorities suffer the effects of environmental contamination more than other communities. The Flint, Mich., water crisis and the Dakota Pipeline protests serve … [+5006 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jessica Taylor", "title": "Alexandria Ocasio-Cortez Decries Biden 'Middle-Of-The-Road Approach' on Climate Change", "description": "\"I will be damned if the same politicians who refused to act then are going to try to come back today and say we need to find a middle-of-the-road approach to save our lives,\" the N.Y. Democrat said.", "url": "https://www.npr.org/2019/05/14/723298209/alexandria-ocasio-cortez-decries-biden-middle-of-the-road-approach-on-climate-ch", "urlToImage": "https://media.npr.org/assets/img/2019/05/14/gettyimages-1148960203_wide-3a6d6269fd8beeca0bc2daa9cb48e758c1ea1ddf.jpg?s=1400", "publishedAt": "2019-05-14T20:28:16Z", "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., speaks during a rally at Howard University on Monday. The Sunrise Movement held an event for the final stop of the \"Road to a Green New Deal\" tour to \"explore what the pain of the climate crisis looks like in D.C. and fo… [+4305 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "The Globe and Mail", "title": "Malaysia to send plastic waste back to foreign countries including Canada - The Globe and Mail", "description": "Malaysia to send plastic waste back to foreign countries including Canada The Globe and Mail Malaysia to ship back tonnes of plastic waste to Canada and other nations Global News 'We are going to send this back': Malaysia returning unwanted Canadian plastic C…", "url": "https://www.theglobeandmail.com/world/article-malaysia-to-send-back-plastic-waste-to-foreign-nations-2/", "urlToImage": "https://www.theglobeandmail.com/resizer/nQfYy27Pc3ex39ZcBvlEegb9PCM=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/XHDS3IF2EZAW5EK6PZTURJTPYU.jpg", "publishedAt": "2019-05-28T11:13:12Z", "content": "A Malaysian official inspects a container filled with plastic waste shipment prior to sending it to the Westport in Port Klang, Malaysia, on May 28, 2019. \r\nVincent Thian/The Associated Press\r\nMalaysia will send back some 3,000 metric tons (3,300 tons) of non… [+5976 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.ca"}, "author": "Zi-Ann Lum", "title": "Scheer Dodges Question About Extreme Weather And Climate Change - HuffPost Canada", "description": "Scheer Dodges Question About Extreme Weather And Climate Change HuffPost Canada Third parties take advantage of massive Raptors audience — and free-range pre-election spending CBC News Extreme weather may finally make climate change a ballot-box issue Maclean…", "url": "https://www.huffingtonpost.ca/entry/andrew-scheer-climate-change_ca_5cffd9ffe4b02c23d2d275f9", "urlToImage": "https://img.huffingtonpost.com/asset/5cffdd14250000590ddc238b.jpeg?cache=UFSysB7gCw&ops=1200_630", "publishedAt": "2019-06-11T17:14:56Z", "content": "OTTAWA — Conservative Leader Andrew Scheer won’t say whether he thinks extreme weather events have anything to do with climate change and human activity. \r\nOver the weekend, deputy leader Lisa Raitt tweeted a link to an article published in the Financial Post… [+6018 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Oliver Williams, Contributor, Oliver Williams, Contributor https://www.forbes.com/sites/oliverwilliams1/", "title": "Rich Need To Tackle Climate Change As Research Shows It Will Eventually Make Them Poorer", "description": "Some of the leading scientists in the U.K. have written an open letter to the country's 100 wealthiest families, asking for an \"extraordinary increase\" in their funding for environmental causes, a week after research shows that climate change will make them p…", "url": "https://www.forbes.com/sites/oliverwilliams1/2019/05/23/rich-need-to-tackle-climate-change-as-research-shows-it-will-eventually-make-them-poorer/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1145325787%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-05-23T11:30:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n(Arun Sankar/AFP/Getty Images)\r\nGetty\r\nSome of the leading scientists in the U.K. have written an open letter to the country's&amp;nbsp;100 largest charitable foundations and the 100&amp;nbsp;wealthiest … [+8327 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Sasha Pezenik", "title": "2020 candidates move to the left as climate change emerges as campaign issue", "description": "Climate change is emerging as one of the 2020 election cycle’s most pressing issues.", "url": "https://abcnews.go.com/Politics/2020-democratic-candidates-move-left-progressive-climate-change/story?id=63489543", "urlToImage": "https://s.abcnews.com/images/Politics/inslee-gty-jt-190605_hpMain_16x9_992.jpg", "publishedAt": "2019-06-07T08:45:50Z", "content": "Washington Gov. Jay Inslee, in unveiling phase three of his Democratic presidential candidacy's climate agenda, has an eye cast towards the global stage - and is looking to reimagine American foreign policy through the lens of combating climate change.\r\nInter… [+7742 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Andy Kroll", "title": "Why Won’t the Democrats Hold a Climate Change Debate?", "description": "Democratic National Committee faces backlash after it rejects calls to highlight climate crisis", "url": "https://www.rollingstone.com/politics/politics-news/climate-change-debate-democrats-2020-primary-846376/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2019/06/10186036t.jpg", "publishedAt": "2019-06-10T19:37:19Z", "content": "WASHINGTON — The Democratic National Committee is facing a growing backlash in the wake of its refusal to host a 2020 presidential debate focused solely on solving the climate crisis.\r\nLast week, the DNC not only dismissed the idea of hosting a debate on the … [+6662 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "BILL BARROW / AP", "title": "Joe Biden’s $5 Trillion Climate Proposal: Net Zero Carbon Emissions by 2050", "description": "Joe Biden is pitching a $5 trillion-plus climate proposal that he says would lead the U.S. to net zero emission of carbon pollution by 2050.", "url": "https://time.com/5600493/joe-biden-climate-proposal/", "urlToImage": "https://timedotcom.files.wordpress.com/2019/06/joe-biden-climate-plan.jpg?quality=85", "publishedAt": "2019-06-04T14:00:36Z", "content": "Democratic presidential candidate Joe Biden is pitching a $5 trillion-plus climate proposal that he says would lead the U.S. to net zero emission of carbon pollution by 2050.\r\nBiden’s plan calls for $1.7 trillion in federal spending over 10 years, with the re… [+5381 chars]"}, {"source": {"id": null, "name": "Creativeapplications.net"}, "author": "TehranPlatform", "title": "Wellograph – Drawing machine that raises awareness on water crisis", "description": "Created by TehranPlatform team, Wellograph is a temporary installation exhibited in 8th Tehran Annual Digital Art Exhibition, part as an installation and part as a performance. It uses a mobile drawing machine to turn layers of data into 120*120 cm drawings t…", "url": "https://www.creativeapplications.net/member-submissions/wellograph-drawing-machine-that-raises-awareness-on-water-crisis/", "urlToImage": null, "publishedAt": "2019-05-16T12:05:07Z", "content": "Created by TehranPlatform team, Wellograph is a temporary installation exhibited in 8th Tehran Annual Digital Art Exhibition, part as an installation and part as a performance. It uses a mobile drawing machine to turn layers of data into 120*120 cm drawings t… [+3209 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "Josh Israel", "title": "Arkansas governor says Trump’s environmental deregulation is great, laments his state’s flooding", "description": "Arkansas, like much of the country, is currently experiencing massive damaging floods. Its governor, Republican Asa Hutchinson, joined Fox News on Tuesday to lament the huge damage the deluge has caused — moments after praising the Trump administration’s envi…", "url": "https://thinkprogress.org/arkansas-governor-says-trumps-environmental-deregulation-is-great-laments-his-states-flooding-98be49de26dd/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/05/GettyImages-577712550.jpg?w=1024&h=682&crop=1", "publishedAt": "2019-05-28T15:14:18Z", "content": "Arkansas, like much of the country, is currently experiencing massive damaging floods. Its governor, Republican Asa Hutchinson, joined Fox News on Tuesday to lament the huge damage the deluge has caused — moments after praising the Trump administration’s envi… [+2228 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Greg Norman on Earther, shared by Maddie Stone to Gizmodo", "title": "Radical Climate Change Experiment in the Amazon Hits Political Turbulence", "description": "When speaking to David Lapola it is hard not to feel both his excitement and frustration. On the one hand, the biologist from the University of Campinas in Brazil is about to oversee the launch of a pioneering trial deep in the Amazon to see how its trees cou…", "url": "https://earther.gizmodo.com/radical-climate-change-experiment-in-the-amazon-hits-po-1835406802", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--kLzF8LzS--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/gxqpdwmom4onyh4zpnag.jpg", "publishedAt": "2019-06-11T14:50:00Z", "content": "When speaking to David Lapola it is hard not to feel both his excitement and frustration. On the one hand, the biologist from the University of Campinas in Brazil is about to oversee the launch of a pioneering trial deep in the Amazon to see how its trees cou… [+8793 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Catharine Smith", "title": "Plastics Aren’t Just Polluting — They’re Making Climate Change Worse", "description": "But it's not too late to act, according to a new report.", "url": "https://www.huffpost.com/entry/plastic-climate-change_n_5cdd8f4be4b09648227ca194", "urlToImage": "https://img.huffingtonpost.com/asset/5cdd930c2100007505808da9.jpeg?ops=1200_630", "publishedAt": "2019-05-16T19:08:46Z", "content": "By now, the headlines about dead whales washing ashore with pounds of plastic in their belly are commonplace. Photos of bird carcasses bursting with bottle caps and other plastic detritus are seared into our memory. But plastic’s effects on nature doesn’t sto… [+2922 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Julian CH Lee", "title": "Godzilla is the perfect monster for our age of environmental destruction", "description": "Godzilla is the perfect monster to make us think about the consequences of our actions.", "url": "https://qz.com/quartzy/1631194/godzilla-is-the-perfect-monster-for-our-age-of-climate-change/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/05/film-godzilla-e1559207755570.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-06-01T09:00:37Z", "content": "The monsters that stalk us in popular culture embody fears about our contemporary human condition. As a new Godzilla movie opens in cinemas this week, we might gain insight into what currently haunts us most.\r\nThe endless waves of zombies in film, TV, and lit… [+5461 chars]"}, {"source": {"id": null, "name": "Stereogum.com"}, "author": "Stereogum", "title": "Trail Of Lies – “Fearless” & “Strong Willed”", "description": "The city of Syracuse is a frozen wasteland with a decrepit downtown, a giant mall, a college-football stadium that looks like a UFO landed in the middle of the city, and a whole lot of truly appalling poverty-related statistics. It is a perfect place for hard…", "url": "https://www.stereogum.com/2045680/trail-of-lies-fearless-strong-willed/music/", "urlToImage": "https://static.stereogum.com/uploads/2019/05/Trail-Of-Lies-Fearless-1559232320-608x608.jpg", "publishedAt": "2019-05-30T16:14:37Z", "content": "The city of Syracuse is a frozen wasteland with a decrepit downtown, a giant mall, a college-football stadium that looks like a UFO landed in the middle of the city, and a whole lot of truly appalling poverty-related statistics. It is a perfect place for hard… [+741 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "Kyla Mandel", "title": "EPA wants to triple level of rocket fuel chemical allowed in drinking water", "description": "The Trump Environmental Protection Agency (EPA) wants to raise the threshold for a chemical found in rocket fuel to triple the previous limit allowed in drinking water supplies. This is the first new drinking water rule introduced by the agency since the Geor…", "url": "https://thinkprogress.org/epa-rocket-fuel-chemical-drinking-water-e6ee56c9ee13/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/05/water-pollution-health-toxic-epa-perchlorate.jpg?w=1024&h=686&crop=1", "publishedAt": "2019-05-24T18:19:33Z", "content": "The Trump Environmental Protection Agency (EPA) wants to raise the threshold for a chemical found in rocket fuel to triple the previous limit allowed in drinking water supplies. This is the first new drinking water rule introduced by the agency since the Geor… [+3956 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Elizabeth Segran", "title": "Bad news: The fashion industry is actually slowing down on sustainability", "description": "Here’s what brands–and shoppers–need to do now to help save the planet. By 2030, at its current pace of growth, the fashion industry is expected to be worth $3.3 trillion. It will manufacture 102 million tons of clothes and shoes. For comparison, that is the …", "url": "https://www.fastcompany.com/90347710/bad-news-the-fashion-industry-is-actually-slowing-down-on-sustainability?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-90347710-fashion-brands-must-work-together-if-weand8217re-to-save-the-planet.jpg", "publishedAt": "2019-05-13T07:00:57Z", "content": "By 2030, at its current pace of growth, the fashion industry is expected to be worth $3.3 trillion. It will manufacture 102 million tons of clothes and shoes. For comparison, that is the weight equivalent to a half million blue whales. If nothing changes, the… [+7068 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Caroline Hickman", "title": "What psychotherapy can do for the climate and biodiversity crises", "description": "Apologies in advance, but I'm hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing is, in these extreme circumstances, a bit of depression about the environment could be prec…", "url": "https://phys.org/news/2019-06-psychotherapy-climate-biodiversity-crises.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/whatpsychoth.jpg", "publishedAt": "2019-06-10T14:20:01Z", "content": "Apologies in advance, but I'm hoping that reading this will help you feel depressedabout biodiversity loss and our lack of progress over the climate crisis. The thing is, in these extreme circumstances, a bit of depression about the environment could be preci… [+6012 chars]"}, {"source": {"id": null, "name": "Hbr.org"}, "author": "Brian Solis", "title": "Doing Creative Work When You Can’t Stop Looking at Your Phone", "description": "Schedule your breaks — it’s that simple.", "url": "https://hbr.org/2019/06/doing-creative-work-when-you-cant-stop-looking-at-your-phone", "urlToImage": "https://hbr.org/resources/images/article_assets/2019/06/Jun19_05_626830877-2.jpg", "publishedAt": "2019-06-05T13:00:00Z", "content": "The onslaught of digital distractions is taking a big toll on businesses. A new survey from Udemy finds that its a special  challenge for Millennials and Gen Z workers, 36% of whom report spending two hours or more each workday looking at their phones for per… [+4400 chars]"}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Zahra Hirji", "title": "Joe Biden Pledges To “Go Well Beyond” Obama With His New Climate Change Plan", "description": "Joe Biden is the latest presidential candidate to unveil a comprehensive climate policy, just the second policy rollout of his 2020 campaign. View Entire Post ›", "url": "https://www.buzzfeednews.com/article/zahrahirji/joe-biden-climate-change-plan-2020-election", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2019-06/3/21/asset/buzzfeed-prod-web-05/sub-buzz-11707-1559613281-1.jpg?crop=1600:838;0,71", "publishedAt": "2019-06-04T10:05:06Z", "content": "Democratic presidential frontrunner Joe Biden on Tuesday released his highly-anticipated plan for tackling the climate emergency, pledging to make the US a climate leader again and to push the rest of the world on tackling the crisis.\r\nThe former vice preside… [+5016 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Shoppers seek out green alternatives to single-use food packaging, but aren’t willing to pay a premium, study finds - The Globe and Mail", "description": "Shoppers seek out green alternatives to single-use food packaging, but aren’t willing to pay a premium, study finds The Globe and Mail Shoppers want green packaging, but don't want to pay for it, study suggests CTV News Shoppers want green packaging, but relu…", "url": "https://www.theglobeandmail.com/canada/article-shoppers-seek-out-green-alternatives-to-single-use-food-packaging-but/", "urlToImage": "https://www.theglobeandmail.com/resizer/O8NoQU6_09PwkGwWgyHYfav3RXM=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/UBBDQVREK5GJDLDRVGWTUX3HAQ.jpg", "publishedAt": "2019-06-06T04:01:00Z", "content": "The results of Dalhousie University survey pose a significant challenge for big grocers such as Loblaws, which are seeking to maintain food-safety standards while also changing to meet consumer demands around cost.\r\nNathan Denette/The Canadian Press\r\nConcerns… [+4349 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Donald Trump turns to Brexit and Huawei as protests planned in London", "description": "Donald Trump will plunge into Britain's Brexit crisis on Tuesday and is likely to demand that Prime Minister Theresa May's successor ban China's Huawei from 5G networks as thousands of protesters mock the U.S. president across London. Feted by Queen Elizabeth…", "url": "https://news.yahoo.com/trumps-uk-visit-turns-brexit-230334763.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/s2SKkYaBspbiVtZ_MsNu7Q--~B/aD0zMDM7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/1343aab8685743fccaf3f6f43377bc0d", "publishedAt": "2019-06-03T23:03:34Z", "content": "By Steve Holland and Guy Faulconbridge\r\nLONDON (Reuters) - Donald Trump will plunge into Britain's Brexit crisis on Tuesday and is likely to demand that Prime Minister Theresa May's successor ban China's Huawei from 5G networks as thousands of protesters mock… [+4997 chars]"}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Bill Desowitz", "title": "Scoring ‘Hostile Planet’ and ‘Our Planet’ With a Musical Sense of Environmental Urgency", "description": "The Nat Geo and Netflix docuseries don't shy away from climate change, which is reflected in the scores by Benjamin Wallfisch and Steven Price.", "url": "https://www.indiewire.com/2019/05/scoring-hostile-planet-and-our-planet-1202143364/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2018/11/Our-Planet-Netflix.png", "publishedAt": "2019-05-21T15:00:03Z", "content": "For Benjamin Wallfisch (“Shazam!”), scoring Nat Geo’s “Hostile Planet” was like working on a thriller, and for Oscar winner Steven Price (“Gravity”), scoring Netflix’s “Our Planet” demanded a similar musical sense of urgency. That’s because both nature docuse… [+4604 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Caroline Hickman", "title": "Our environmental problem is also a mental problem", "description": "If we block out our emotions, then we are unable to connect with the urgency of the crisis. Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing…", "url": "https://www.fastcompany.com/90358827/our-environmental-problem-is-also-a-mental-problem?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/p-1-our-environmental-problem-is-also-a-mental-problem.jpg", "publishedAt": "2019-06-08T10:04:49Z", "content": "Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing is, in these extreme circumstances, a bit of depression about the environment could be prec… [+5648 chars]"}, {"source": {"id": null, "name": "Ritholtz.com"}, "author": "Barry Ritholtz", "title": "10 Weekend Reads", "description": "Welcome to June and the weekend! Pour yourself a mug of Kicking Horse Coffee coffee, grab a seat by the pool, and get ready for our longer form weekend reads: • Uber’s Path of Destruction (American Affairs) • Private Equity Drove Two Canadians Crazy. At Black…", "url": "https://ritholtz.com/2019/06/10-weekend-reads-19/", "urlToImage": "https://ritholtz.com/wp-content/uploads/2019/05/cities.png", "publishedAt": "2019-06-01T11:30:45Z", "content": "Welcome to June and the weekend! Pour yourself a mug of Kicking Horse Coffee coffee, grab a seat by the pool, and get ready for our longer form weekend reads:\r\n Ubers Path of Destruction (American Affairs)Private Equity Drove Two Canadians Crazy. At BlackRock… [+1285 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Joe Biden unveils $5 trillion climate plan", "description": "Democratic presidential candidate Joe Biden is pitching a $5 trillion-plus climate action proposal that he says would lead to an economy with a net zero emission of carbon pollution by 2050.", "url": "https://abcnews.go.com/Politics/wireStory/joe-bidens-5t-climate-plan-net-emissions-2050-63470992", "urlToImage": "https://s.abcnews.com/images/Politics/WireAP_91cb7537d4ab4ef8b2a4c1fc52a16da0_16x9_992.jpg", "publishedAt": "2019-06-04T13:00:24Z", "content": "Democratic presidential candidate Joe Biden is pitching a $5 trillion-plus climate proposal that he says would lead the U.S. to net zero emission of carbon pollution by 2050.\r\nInterested in 2020 Elections?\r\nAdd 2020 Elections as an interest to stay up to date… [+5567 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Julian Ch Lee", "title": "Why Godzilla is the perfect monster for our age of environmental destruction", "description": "The monsters that stalk us in popular culture embody fears about our contemporary human condition. As a new Godzilla film opens in cinemas this week, we might gain insight into what currently haunts us most.", "url": "https://phys.org/news/2019-05-godzilla-monster-age-environmental-destruction.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/whygodzillai.jpg", "publishedAt": "2019-05-29T12:58:56Z", "content": "The monsters that stalk us in popular culture embody fears about our contemporary human condition. As a new Godzilla film opens in cinemas this week, we might gain insight into what currently haunts us most.\r\nThe endless waves of zombies in film, TV and liter… [+5799 chars]"}, {"source": {"id": null, "name": "Neatorama.com"}, "author": "Exuperist", "title": "Antibiotic Waste Crisis: Pharmaceutical Wastes Seeping Through The World's Rivers", "description": "Antibiotics have saved thousands of lives ever since Alexander Fleming discovered penicillin. However, due to human negligence and big pharmaceutical companies' mismanagement of their resources and waste, these drugs that save lives are coming back to bite us…", "url": "https://www.neatorama.com/2019/05/28/Antibiotic-Waste-Crisis-Pharmaceutical-Wastes-Seeping-Through-The-World-s-Rivers/", "urlToImage": "https://uploads.neatorama.com/images/posts/699/106/106699/Antibiotic-Waste-Crisis-Pharmaceutical-Wastes-Seeping-Through-The-World-s-Rivers_0-x.jpg?v=9927", "publishedAt": "2019-05-28T18:14:30Z", "content": "Antibiotics have saved thousands of lives ever since Alexander Fleming discovered penicillin. However, due to human negligence and big pharmaceutical companies' mismanagement of their resources and waste, these drugs that save lives are coming back to bite us… [+676 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Editors, USA TODAY", "title": "Pelosi's meeting with Dems, Trump team in court, suncreen safety: 5 things you need to know Wednesday", "description": "Pelosi to meet with Democrats as many call for Trump's impeachment, and is your sunscreen safe?  5 things you need to know Wednesday", "url": "https://www.usatoday.com/story/news/2019/05/22/pelosi-meet-dems-trump-team-court-5-things-know-wednesday/3751672002/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/04/30/USAT/800fd7b9-c30a-45e6-a5fd-13fdadf3345b-pelosi_trump.JPG?crop=2999,1698,x0,y0&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-22T08:52:08Z", "content": "Pelosi to meet with Democrats as clamor for Trump impeachment grows\r\nHouse Speaker Nancy Pelosi is set to hold a meeting Wednesday to discuss oversight and investigations, sources say. It comes as a growing number of Democrats say it's time to open an inquiry… [+5315 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Caroline Hickman", "title": "Our environmental problem is also a mental problem", "description": "If we block out our emotions, then we are unable to connect with the urgency of the crisis. Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing…", "url": "https://www.fastcompany.com/90358827/our-environmental-problem-is-also-a-mental-problem?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/06/p-1-our-environmental-problem-is-also-a-mental-problem.jpg", "publishedAt": "2019-06-08T10:04:49Z", "content": "Apologies in advance, but I’m hoping that reading this will help you feel depressed—about biodiversity loss and our lack of progress over the climate crisis. The thing is, in these extreme circumstances, a bit of depression about the environment could be prec… [+5648 chars]"}, {"source": {"id": null, "name": "Businessoffashion.com"}, "author": "Sarah Kent", "title": "How Fashion Schools Are Tackling the Sustainability Puzzle", "description": "The fashion industry is struggling to understand the scale of its environmental challenges and how to solve them. It starts with education.", "url": "https://www.businessoffashion.com/articles/education/how-fashion-schools-are-tackling-the-sustainability-puzzle", "urlToImage": "https://images.businessoffashion.com/site/uploads/2019/06/sustainability_article_image-1.png?auto=format%2Ccompress&crop=faces%2Centropy&fit=crop&max-h=512&w=1024", "publishedAt": "2019-06-05T04:37:09Z", "content": "LONDON, United Kingdom  Nancy Diniz has built a career turning microbes into material. Now, she wants to teach a new generation to unlock bacterias design potential.\r\nAn architect by training, Diniz will lead Central St Martins newest program: a masters in bi… [+10914 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Associated Press", "title": "Ex-Governor’s Phone Seized in Flint Water Probe", "description": "The water crisis in Flint was one of the worst man-made environmental disasters in U.S. history.", "url": "https://www.snopes.com/ap/2019/06/03/ex-governors-phone-seized-in-flint-water-probe/", "urlToImage": "https://www.snopes.com/tachyon/2019/06/rick-snyder-flint-ap.jpg?fit=1200,628", "publishedAt": "2019-06-04T00:40:43Z", "content": "LANSING, Mich. (AP) Authorities investigating Flints water crisis have used search warrants to seize from storage the state-owned mobile devices of former Gov. Rick Snyder and 65 other current or former officials, The Associated Press has learned.\r\nThe warran… [+4679 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "RISE OF THE GREENS", "description": "With double-digit scores across Europe's biggest countries including a stunning 20 percent in Germany, the Greens bagged record gains in European elections on Sunday with younger voters leading calls for action to halt global warming.  The environmental party…", "url": "https://news.yahoo.com/green-wave-eu-vote-amid-climate-crisis-194422602.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/tlh4eZnm4pIHFG1EUImQ6A--~B/aD02NjI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/f975c56ff3a1c53d210adae93d179cdf047f42e5.jpg", "publishedAt": "2019-05-26T21:55:36Z", "content": "Berlin (AFP) - With double-digit scores across Europe's biggest countries including a stunning 20 percent in Germany, the Greens bagged record gains in European elections on Sunday with younger voters leading calls for action to halt global warming.\r\nThe envi… [+3713 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "aadragna@politico.com (Anthony Adragna)", "title": "DNC opts against climate change debate, Inslee says", "description": "“The DNC is silencing the voices of Democratic activists,&quot; Inslee said.", "url": "https://www.politico.com/story/2019/06/05/dnc-opts-against-climate-change-debate-inslee-says-1355867", "urlToImage": "https://static.politico.com/49/ed/8ddb4ed848ccb50f88a965c712be/190605-jay-inslee-ap-773.jpg", "publishedAt": "2019-06-05T22:31:33Z", "content": "Mark Lennihan/AP Photo\r\nWashington Gov. Jay Inslee said Wednesday the Democratic National Committee informed him it will not dedicate one of its presidential primary debates to the issue of climate change.\r\nThe decision comes despite a furious push from progr… [+2280 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bhakti Mirchandani, Contributor, Bhakti Mirchandani, Contributor https://www.forbes.com/sites/bhaktimirchandani/", "title": "Crossing The Line: The Busy Reader's Guide To Nine Facets Of The US-Mexico Border Crisis", "description": "US-Mexico border crisis is a multidimensional confluence of drug trafficking, immigration, and commerce and trade. This article explores ten key facets, ranging from illegal drug demand to environmental costs and from asylum seeking across the Americas to law…", "url": "https://www.forbes.com/sites/bhaktimirchandani/2019/06/02/crossing-the-line-the-busy-readers-guide-to-nine-facets-of-the-us-mexico-border-crisis/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1149177148%2F960x0.jpg%3Ffit%3Dscale", "publishedAt": "2019-06-03T00:21:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nFollowing the presidents announcement late Thursday of 5% tariffs on Mexican imports, it is worth exploring the history and facets of the US-Mexico border crisis.\r\nAlthough the US-Mexico border was initi… [+13560 chars]"}, {"source": {"id": null, "name": "Niemanlab.org"}, "author": "Laura Hazard Owen", "title": "From “climate change” to “climate emergency, crisis or breakdown”: The Guardian is changing the environmental language it uses", "description": "Human-caused climate change is arguably the largest crisis facing the world’s population of more than 7 billion, but news organizations have struggled to cover it adequately. “Newsroom managers have failed to see the climate crisis as fundamental, all-encompa…", "url": "https://www.niemanlab.org/2019/05/from-climate-change-to-climate-emergency-crisis-or-breakdown-the-guardian-is-changing-the-environmental-language-it-uses/", "urlToImage": "", "publishedAt": "2019-05-17T14:42:35Z", "content": "Human-caused climate change is arguably the largest crisis facing the world’s population of more than 7 billion, but news organizations have struggled to cover it adequately. “Newsroom managers have failed to see the climate crisis as fundamental, all-encompa… [+2515 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "E.A. Crunden", "title": "DNC argues climate will still be debate topic after nixing dedicated debate. History says otherwise.", "description": "Despite pressure from environmental activists and Democratic presidential candidates, the Democratic National Committee (DNC) has said there will be no formal presidential debate dedicated to climate change — a leading election issue for the first time ever. …", "url": "https://thinkprogress.org/dnc-says-nope-to-climate-debate-inslee-warren-68966e2d3d96/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/06/GettyImages-1147203320.jpg?w=1920&h=1080&crop=1", "publishedAt": "2019-06-06T16:06:31Z", "content": "Despite pressure from environmental activists and Democratic presidential candidates, the Democratic National Committee (DNC) has said there will be no formal presidential debate dedicated to climate change — a leading election issue for the first time ever.\r… [+5228 chars]"}, {"source": {"id": null, "name": "Scientificamerican.com"}, "author": "April Crow", "title": "Science on the Hill: How to Make Recycling Profitable", "description": "We need to invest in companies with approaches that are scalable and replicable -- Read more on ScientificAmerican.com", "url": "https://blogs.scientificamerican.com/observations/science-on-the-hill-how-to-make-recycling-profitable/", "urlToImage": "https://static.scientificamerican.com/blogs/cache/file/88835330-1227-4FF9-A2FCA0CAD6CA3BA9.jpg", "publishedAt": "2019-05-29T18:00:00Z", "content": "On June 6, a panel of experts convened by Scientific American and Nature Research—part of Springer Nature—will talk about the issue of plastic pollution, including possible solutions, in Washington, D.C. The author is one of those experts.\r\nThe plastic waste … [+4669 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Jaime Nack", "title": "5 ways you can personally fight the climate crisis", "description": "As we watch the youth take to the streets over climate change, and read daily news reports on sea-level rise, glacier melt rates and the alarming amount of carbon in the atmosphere, many are left with a desire to act. Yet, the gravity of the climate crisis ca…", "url": "https://www.weforum.org/agenda/2019/05/5-ways-you-can-personally-fight-the-climate-crisis-change-global-warming/", "urlToImage": "https://bigthink-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19560706%2F980x.jpg/2000%2C2000/RG5Lk9fl1LifBZpO/img.jpg", "publishedAt": "2019-05-29T19:41:52Z", "content": "As we watch the youth take to the streets over climate change, and read daily news reports on sea-level rise, glacier melt rates and the alarming amount of carbon in the atmosphere, many are left with a desire to act. \r\nYet, the gravity of the climate crisis … [+5544 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Ian Thomsen", "title": "The U.S needs to change its approach to flooding after record-breaking floods in Midwest, Northeastern geoscientist says", "description": "The record-breaking floods in the Midwest over the past week are revealing an urgent need to account for climate change, says geoscientist Samuel Munoz, an assistant professor of marine and environmental sciences at Northeastern.", "url": "https://phys.org/news/2019-06-approach-record-breaking-midwest-northeastern-geoscientist.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/floodriver.jpg", "publishedAt": "2019-06-03T11:38:36Z", "content": "The record-breaking floods in the Midwest over the past week are revealing an urgent need to account for climate change, says geoscientist Samuel Munoz, an assistant professor of marine and environmental sciences at Northeastern.\r\nLevees were breaching Friday… [+5391 chars]"}, {"source": {"id": null, "name": "Springwise.com"}, "author": "emily", "title": "Top Takeaways From the 2019 World Retail Congress", "description": "James Bidwell, Chair of Springwise, Co-founder of the innovation consultancy Re_set and author of Disrupt! 100 Lessons in Business Innovation, shares his thoughts on this year’s World Retail Congress in Amsterdam. The 2019 World Retail Congress in Amsterdam d…", "url": "https://www.springwise.com/top-takeaways-from-the-2019-world-retail-congress/", "urlToImage": "https://www.springwise.com/wp-content/uploads/2019/05/World_Retail_Congress_2019.jpg", "publishedAt": "2019-05-29T05:15:55Z", "content": "James Bidwell, Chair of Springwise, Co-founder of the innovation consultancy Re_set and author of Disrupt! 100 Lessons in Business Innovation, shares his thoughts on this years World Retail Congress in Amsterdam. \r\nThe 2019\r\nWorld Retail Congress in Amsterdam… [+4080 chars]"}, {"source": {"id": null, "name": "Curbed.com"}, "author": "Patrick Sisson", "title": "Air pollution’s invisible toll on our cities", "description": "Journalist Beth Gardiner’s new book, Choked, offers frontline reporting from a global environmental crisis.", "url": "https://www.curbed.com/2019/5/31/18647801/air-pollution-cities-air-quality-smog-book", "urlToImage": "https://cdn.vox-cdn.com/thumbor/j77uCTaU0iNPaA62jO-dLUiF4k8=/0x530:7360x4383/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16312193/shutterstock_424737244.jpg", "publishedAt": "2019-05-31T22:18:23Z", "content": "Clear skies dont necessarily reflect clean air. Its a key distinction that muddies understanding of air pollution. While air quality in U.S. cities has, through environmental laws and regulations such as the landmark Clean Air Act, become significantly better… [+6314 chars]"}, {"source": {"id": null, "name": "Juancole.com"}, "author": "Aeon", "title": "No, Nuclear Power can’t Solve our Environmental Crisis", "description": "By Heidi Hutner and Erica Cirino | - Aeon | - In November 2018, the Woolsey Fire scorched nearly 100,000 acres of Los Angeles and Ventura counties, destroying forests, fields and more than 1,500 structures, and forcing the evacuation of nearly 300,000 people …", "url": "https://www.juancole.com/2019/05/nuclear-environmental-crisis.html", "urlToImage": "https://www.juancole.com/images/2019/05/3MileIsland.jpg", "publishedAt": "2019-05-30T06:29:51Z", "content": "By Heidi Hutner and Erica Cirino | –\r\n Aeon | – In November 2018, the Woolsey Fire scorched nearly 100,000 acres of Los Angeles and Ventura counties, destroying forests, fields and more than 1,500 structures, and forcing the evacuation of nearly 300,000 peopl… [+9000 chars]"}, {"source": {"id": null, "name": "Goodmenproject.com"}, "author": "Enrique Dans", "title": "The Importance of the Environmental Action Plan", "description": "We are facing a climate crisis, and whoever says otherwise is ignorant and irresponsible. The post The Importance of the Environmental Action Plan appeared first on The Good Men Project.", "url": "https://goodmenproject.com/featured-content/the-importance-of-the-environmental-action-plan/", "urlToImage": "https://goodmenproject.com/wp-content/uploads/2019/05/shutterstock_1115480429-1.jpg", "publishedAt": "2019-05-21T08:00:26Z", "content": "—A long list of Amazon employees – 5,237 and rising – publicly sign an open letter addressed to Jeff Bezos and his board of directors, calling for the development of a corporate environmental action plan that incorporates the fight against climate change. The… [+4539 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Niki J.p. Alsford", "title": "How Japan's renewables-powered Olympics could kick off a global race for clean energy", "description": "Japan is aiming to host the first Olympic Games powered solely by renewable sources. If successful, this could help the country carve a new niche in the global order as a champion of climate action and environmental protection – and set off a clean energy rac…", "url": "https://phys.org/news/2019-05-japan-renewables-powered-olympics-global-energy.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/1-howjapansren.jpg", "publishedAt": "2019-05-17T13:00:02Z", "content": "Japan is aiming to host the first Olympic Games powered solely by renewable sources. If successful, this could help the country carve a new niche in the global order as a champion of climate action and environmental protection and set off a clean energy race … [+5052 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Elizabeth Segran", "title": "Bad news: The fashion industry is actually slowing down on sustainability", "description": "Here’s what brands–and shoppers–need to do now to help save the planet. By 2030, at its current pace of growth, the fashion industry is expected to be worth $3.3 trillion. It will manufacture 102 million tons of clothes and shoes. For comparison, that is the …", "url": "https://www.fastcompany.com/90347710/bad-news-the-fashion-industry-is-actually-slowing-down-on-sustainability?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcodesign%2Ffeed+%28Co.Design%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-90347710-fashion-brands-must-work-together-if-weand8217re-to-save-the-planet.jpg", "publishedAt": "2019-05-13T07:00:57Z", "content": "By 2030, at its current pace of growth, the fashion industry is expected to be worth $3.3 trillion. It will manufacture 102 million tons of clothes and shoes. For comparison, that is the weight equivalent to a half million blue whales. If nothing changes, the… [+7068 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Pe­ter Rüegg", "title": "Mapping the global distribution of phytoplankton", "description": "Researchers at ETH have charted the distribution of phytoplankton in the world's oceans for the first time and investigated the environmental factors that explain this distribution. They concluded that plankton diversity is only partially congruent with previ…", "url": "https://phys.org/news/2019-05-global-phytoplankton.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/5cdd71f4e5604.gif", "publishedAt": "2019-05-16T14:23:01Z", "content": "Researchers at ETH have charted the distribution of phytoplankton in the world's oceans for the first time and investigated the environmental factors that explain this distribution. They concluded that plankton diversity is only partially congruent with previ… [+6170 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Padraic Halpin", "title": "Ireland's Greens eye return to government after local bounce", "description": "Ireland's Green Party will consider playing a role in the country's next government, pushing to overhaul environmental policy, if its surge in this week's local and European elections is repeated in the next parliamentary poll, its leader said.", "url": "https://www.reuters.com/article/us-ireland-politics-idUSKCN1SW0E2", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2019-05-26T12:44:54Z", "content": "DUBLIN (Reuters) - Ireland’s Green Party will consider playing a role in the country’s next government, pushing to overhaul environmental policy, if its surge in this week’s local and European elections is repeated in the next parliamentary poll, its leader s… [+2528 chars]"}, {"source": {"id": null, "name": "Grist.org"}, "author": "Justine Calma", "title": "CNN ran a ‘climate justice’ segment and this is progress", "description": "Opening the cable news door to climate justice means we might be seeing more interesting environmental stories.", "url": "http://grist.org/article/cnn-ran-a-climate-justice-segment-and-this-is-progress/", "urlToImage": "https://grist.files.wordpress.com/2019/05/cnn-climate-justice-e1559340524856.png?w=1200&h=675&crop=1", "publishedAt": "2019-05-31T23:16:13Z", "content": "Now that climate change is finally becoming a thing on cable news, networks also seem to be catching on to the existence of climate injustice. In the wake of another week of devastating storms, CNN host Don Lemon ran a seven-minute segment on Wednesday night … [+5391 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Telegraph Reporters", "title": "Falling asleep in front of the TV could increase the risk of obesity, study finds", "description": "Falling asleep in front of the TV could increase the risk of obesity, new research suggests.", "url": "https://www.telegraph.co.uk/news/2019/06/10/falling-asleep-front-tv-could-increase-risk-obesity-study-finds/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/06/10/TELEMMGLPICT000174389989-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg", "publishedAt": "2019-06-10T18:50:05Z", "content": "Falling asleep in front of the TV could increase the risk of obesity, new research suggests.\r\nWomen exposed to artificial light at night were more likely to gain weight and become obese or overweight over the next five years, according to a study of almost 44… [+655 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Harry Cheadle, Matt Taylor", "title": "Biden's Surprisingly Strong Climate Plan Is Giving People Hope", "description": "Not even Joe Biden can afford to be a moderate on climate change.", "url": "https://www.vice.com/en_us/article/597ky5/bidens-surprisingly-strong-climate-plan-is-giving-people-hope", "urlToImage": "https://video-images.vice.com/articles/5cf6d117dc36f50009ace954/lede/1559679398053-joe-biden-iceberg.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2019-06-04T20:48:55Z", "content": "Photo of Joe Biden by Drew Angerer/Getty; photo of an iceberg by Costfoto / Barcroft Images / Barcroft Media via GettyLess than a month after climate change activists called the prospect of a Joe Biden presidency a death sentence, some of those same agitators… [+5570 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "E.A. Crunden", "title": "With new plan, Biden establishes ambitious climate action as the 2020 standard", "description": "Former Vice President Joe Biden revealed his long-awaited climate plan on Tuesday, one that aims to strike a balance between demands from environmental activists and a more centrist approach to climate action. Unveiled June 4, Biden’s plan calls for net-zero …", "url": "https://thinkprogress.org/biden-2020-climate-plan-green-new-deal-2050-net-zero-3333e9911921/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/06/GettyImages-1146976858-1.jpg?w=1920&h=1080&crop=1", "publishedAt": "2019-06-04T14:19:01Z", "content": "Former Vice President Joe Biden revealed his long-awaited climate plan on Tuesday, one that aims to strike a balance between demands from environmental activists and a more centrist approach to climate action.\r\nUnveiled June 4, Biden’s plan calls for net-zero… [+5624 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "Kyla Mandel", "title": "Trump International Hotel will host a climate denial conference", "description": "In late July, climate science deniers will descend upon the Trump International Hotel in Washington, D.C. — located right across the street from the Environmental Protection Agency (EPA) — to attend the Heartland Institute’s annual climate conference. The the…", "url": "https://thinkprogress.org/trump-international-hotel-will-host-a-climate-denial-conference-5cf2c28b695d/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/06/trump-international-hotel-climate-science-deniers-conference-energy-fossil-fuels.jpg?w=1024&h=700&crop=1", "publishedAt": "2019-06-12T15:38:35Z", "content": "In late July, climate science deniers will descend upon the Trump International Hotel in Washington, D.C. — located right across the street from the Environmental Protection Agency (EPA) — to attend the Heartland Institute’s annual climate conference. The the… [+4903 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Letter makes plea to rich over climate", "description": "Scientists' letter urges wealthy to help fight “ecological catastrophe”.", "url": "https://www.bbc.co.uk/news/science-environment-48357351", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2582/production/_105920690_mediaitem105920689.jpg", "publishedAt": "2019-05-23T07:02:50Z", "content": "Image copyrightPA\r\nBritains wealthy elite are being asked to dip deep into their pockets to protect the environment and the climate.\r\nA group of scientists has written to the top 100 wealthiest charitable bodies and families to request funding.\r\nThey say effo… [+2853 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "George Clarke, CommunityVoice, George Clarke, CommunityVoice https://www.forbes.com/sites/forbeschicagocouncil/people/georgeclarke1/", "title": "Motivating Your Environmental Services Team To Improve The Bottom Line", "description": "C-suites are beginning to grasp the difference a highly trained ES staff member can make.", "url": "https://www.forbes.com/sites/forbeschicagocouncil/2019/05/22/motivating-your-environmental-services-team-to-improve-the-bottom-line/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fforbeschicagocouncil%2Ffiles%2F2019%2F05%2Fa-1-500x500.jpg", "publishedAt": "2019-05-22T12:00:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nResearchers estimate that antimicrobial resistance could cause&amp;nbsp;10 million deaths and cost $100 trillion by 2050. A 2017 report by the World Bank Group found&amp;nbsp;that drug-resistant infectio… [+13122 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Shawn Langlois", "title": "Key Words: Bill Nye in defense of the Green New Deal: ‘The planet’s on f—king fire!’", "description": "The “Science Guy’s” rant capped Sunday’s episode of HBO’s “Last Week Tonight,” in which John Oliver focused on countering criticisms of Rep. Alexandria Ocasio-Cortez‘s Green New Deal.", "url": "https://www.marketwatch.com/story/bill-nye-in-defense-of-the-green-new-deal-the-planets-on-fking-fire-2019-05-13", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HJ439_nye_ZG_20190513114236.jpg", "publishedAt": "2019-05-13T16:44:55Z", "content": "John Oliver thinks weve finally broken Bill Nye. \r\nWhat Im saying is the planets on fucking fire. There are a lot of things we could do to put it out are any of them free? No, of course not. Nothings free, you idiots. Grow the fuck up. Youre not children anym… [+3088 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Hazel Sheffield", "title": "A British Town Looks Local for Economic Answers", "description": "Britain’s notorious lack of investment beyond London is only getting worse. One town thinks it has the solution.", "url": "https://www.theatlantic.com/international/archive/2019/05/british-town-local-economy/588943/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/mt/2019/05/city/facebook.jpg?1557264261", "publishedAt": "2019-05-13T05:00:00Z", "content": "PRESTON, England—For years, almost all of Britain’s political energy has been consumed by the country’s withdrawal from the European Union. The issue has dominated evening news programs, front pages, and conversation in London. Yet beyond Brexit, and outside … [+9340 chars]"}, {"source": {"id": null, "name": "Thinkprogress.org"}, "author": "Adrienne Mahsa Varkiani", "title": "Julián Castro is the first presidential candidate to visit Flint", "description": "Former Housing and Urban Development Secretary Julián Castro is visiting Flint, Michigan, on Saturday — becoming the first 2020 presidential candidate to do so. Flint is still struggling with its water system, five years after then-Gov. Rick Snyder (R) decide…", "url": "https://thinkprogress.org/julian-castro-first-presidential-candidate-to-visit-flint-michigan-70038e51b86a/", "urlToImage": "https://thinkprogress.org/wp-content/uploads/2019/06/GettyImages-1133669237.jpg?w=1920&h=1080&crop=1", "publishedAt": "2019-06-08T19:56:48Z", "content": "Former Housing and Urban Development Secretary Julián Castro is visiting Flint, Michigan, on Saturday — becoming the first 2020 presidential candidate to do so.\r\nFlint is still struggling with its water system, five years after then-Gov. Rick Snyder (R) decid… [+3653 chars]"}, {"source": {"id": null, "name": "Itsnicethat.com"}, "author": "Josh Baines", "title": "Say a sustainable hello to the world’s first fully compostable trainer", "description": "Canadian sneaker-merchants Native Shoes has unveiled the first ever 100 per cent compostable, natural, plant-based, and unisex trainer.", "url": "https://www.itsnicethat.com/news/native-plant-shoe-fully-compostable-vegan-trainer-product-design-130619", "urlToImage": "https://www.itsnicethat.com/system/files/062019/5d0117a17fa44c85dd000fea/index_default/Native-plant-shoe-fully-compostable-vegan-trainer-product-design-itsnicethat-02.jpg?1560410806", "publishedAt": "2019-06-13T07:15:00Z", "content": "We love a world first here at Its Nice That and today were happy to bring you one that might actually do some real good for the planet.\r\nCanadian sneaker-merchants Native Shoes has unveiled the first ever 100 per cent compostable, natural, plant-based, and un… [+1278 chars]"}, {"source": {"id": null, "name": "Cleantechnica.com"}, "author": "Jonny Tiernan", "title": "Environmental Issues Top Upcoming European Election Agenda", "description": "In Germany, climate change issues are finally taking center stage in the political arena, and the results of the upcoming European elections could set the tone for the future. A poll by broadcaster ARD has shown that 48% of Germans listed climate change as th…", "url": "https://cleantechnica.com/2019/05/21/environmental-issues-top-upcoming-european-election-agenda/", "urlToImage": "https://cleantechnica.com/files/2019/05/image2-6.jpeg", "publishedAt": "2019-05-21T17:05:29Z", "content": "CarsPublished on May 21st, 2019 |\r\n by Jonny Tiernan\r\n0\r\nMay 21st, 2019 by Jonny Tiernan \r\nIn Germany, climate change issues are finally taking center stage in the political arena, and the results of the upcoming European elections could set the tone for the … [+5687 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Flora Graham", "title": "Daily briefing: Trump moves to limit climate-change predictions", "description": "Influential US government report will not look beyond 2040, Google revives controversial cold-fusion experiments and a more human approach to presenting data.", "url": "https://www.nature.com/articles/d41586-019-01699-1?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01699-1/d41586-019-01699-1_16755284.png", "publishedAt": "2019-05-28T00:00:00Z", "content": "Hello Nature readers, would you like to get this Briefing in your inbox free every day? Sign up here.\r\nChemist Martin Fleischmann (pictured with US politician Marilyn Lloyd) was part of a team that claimed to have produced cold fusion in 1989.Credit: Margot I… [+4228 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "New study shows legacy of DDT to lake ecosystems", "description": "New findings of a multi-university research team show the pesticide DDT persists in remote lakes at concerning levels half a century after it was banned, affecting key aquatic species and potentially entire lake food webs.", "url": "https://phys.org/news/2019-06-legacy-ddt-lake-ecosystems.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/13-newstudyshow.jpg", "publishedAt": "2019-06-12T12:00:02Z", "content": "New findings of a multi-university research team show the pesticide DDT persists in remote lakes at concerning levels half a century after it was banned, affecting key aquatic species and potentially entire lake food webs.\r\n\"What was considered yesterday's en… [+3275 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Darien Alexander Williams", "title": "Why we can’t leave climate change to philanthropists", "description": "Corporate largesse won’t save cities from global warming–especially when it comes from the industry that helped cause the predicament. In the spring of 2013, the Rockefeller Foundation—the 100-year-old charitable organization started by Standard Oil tycoon Jo…", "url": "https://www.fastcompany.com/90355484/why-we-cant-leave-climate-change-to-philanthropists?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/i-1-90355484-the-folly-of-climate-change-philanthropy.jpg", "publishedAt": "2019-05-27T06:00:51Z", "content": "In the spring of 2013, the Rockefeller Foundation—the 100-year-old charitable organization started by Standard Oil tycoon John D. Rockefeller–launched an ambitious program to help cities around the world adapt to the physical, social, and economic challenges … [+6676 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": "Flora Graham", "title": "Daily briefing: Trump moves to limit climate-change predictions", "description": "Influential US government report will not look beyond 2040, Google revives controversial cold-fusion experiments and a more human approach to presenting data.", "url": "https://www.nature.com/articles/d41586-019-01699-1", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-019-01699-1/d41586-019-01699-1_16755284.png", "publishedAt": "2019-05-28T00:00:00Z", "content": "Hello Nature readers, would you like to get this Briefing in your inbox free every day? Sign up here.\r\nChemist Martin Fleischmann (pictured with US politician Marilyn Lloyd) was part of a team that claimed to have produced cold fusion in 1989.Credit: Margot I… [+4228 chars]"}, {"source": {"id": null, "name": "Inhabitat.com"}, "author": "Lucienne Cross", "title": "Stay home from work to save the planet, study says", "description": "Need an excuse to stay home from work? How about new research findings that a shorter work week is essential to combating climate change? European think tank Autonomy recommends that employees in the U.K. work far fewer hours in order to avoid a climate crisi…", "url": "https://inhabitat.com/stay-home-from-work-to-save-the-planet-study-says/", "urlToImage": "https://inhabitat.com/wp-content/blogs.dir/1/files/2019/05/work-climate-lead-706x369.jpg", "publishedAt": "2019-05-23T17:30:39Z", "content": "Need an excuse to stay home from work? How about new research findings that a shorter work week is essential to combating climate change? European think tank Autonomy recommends that employees in the U.K. work far fewer hours in order to avoid a climate crisi… [+2467 chars]"}]}