{"status": "ok", "totalResults": 937, "articles": [{"source": {"id": "mashable", "name": "Mashable"}, "author": "Alex Perry", "title": "Amazon Restaurants food delivery service is shutting down", "description": "Sorry to those who loved ordering food deliveries from Amazon, but those days are over. More specifically, the days of Amazon Restaurants are over GeekWire reported on Tuesday that Amazon had shut down the in-house food delivery service about four years after…", "url": "https://mashable.com/article/amazon-restaurants-shut-down-2019/", "urlToImage": "https://mondrian.mashable.com/2019%252F06%252F11%252Fe2%252F1d2faf53a657460489b1b847dfe4df1c.35686.jpg%252F1200x630.jpg?signature=BHAan2ml-NIOchwODwfa2nol3uw=", "publishedAt": "2019-06-11T15:42:16Z", "content": "Sorry to those who loved ordering food deliveries from Amazon, but those days are over.\r\nMore specifically, the days of Amazon Restaurants are over. GeekWire reported on Tuesday that Amazon had shut down the in-house food delivery service about four years aft… [+1707 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Rita Liao", "title": "TikTok owner ByteDance’s long-awaited chat app is here", "description": "In WeChat -dominated China, there’s no shortage of challengers out there claiming to create an alternative social experience. The latest creation comes from ByteDance, the world’s most valuable startup and the operator behind TikTok, the video app that has co…", "url": "http://techcrunch.com/2019/05/19/bytedance-flipchat/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/12/GettyImages-853294790-e1545230447536.jpg?w=751", "publishedAt": "2019-05-20T02:49:55Z", "content": "In WeChat -dominated China, there’s no shortage of challengers out there claiming to create an alternative social experience. The latest creation comes from ByteDance, the world’s most valuable startup and the operator behind TikTok, the video app that has co… [+3361 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Leah Stodart", "title": "Farberware's air fryer is on sale for just $38 at Walmart", "description": "It feels like we blinked and suddenly everyone has an air fryer. Seriously, just peek at the counter if someone posts a picture in their kitchen. It's there. If you still haven't hopped on the train, it's probably because A. you don't have room for it or B. y…", "url": "https://mashable.com/shopping/deal-may-17-farberware-air-fryer/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F17%252F3e%252F7c7b8dd4295e4bd9a62c5a8f1ab18123.8721e.png%252F1200x630.png?signature=QO0wlGhZn7C7b5vRRSBUat5VrA8=", "publishedAt": "2019-05-17T14:45:49Z", "content": "It feels like we blinked and suddenly everyone has an air fryer. Seriously, just peek at the counter if someone posts a picture in their kitchen. It's there.\r\nIf you still haven't hopped on the train, it's probably because A. you don't have room for it or B. … [+1575 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Help Reduce School Lunch Debt", "description": "Earlier this month, one Rhode Island school district made headlines after giving some of its students—those with unpaid balances for school meals—cold sun butter and jelly sandwiches (along with milk and veggies) instead of hot meal items, available to all ot…", "url": "https://lifehacker.com/how-to-help-reduce-school-lunch-debt-1835449227", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gKtCwyiK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/c6ocrnevdid6akpfvcnj.jpg", "publishedAt": "2019-06-12T18:15:00Z", "content": "Earlier this month, one Rhode Island school district made headlines after giving some of its studentsthose with unpaid balances for school mealscold sun butter and jelly sandwiches (along with milk and veggies) instead of hot meal items, available to all othe… [+4079 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Kristof", "title": "The World’s Malnourished Kids Don’t Need a $295 Burger", "description": "A quarter of the world’s children are stunted from inadequate diets.", "url": "https://www.nytimes.com/2019/06/12/opinion/guatemala-malnourished-children.html", "urlToImage": "https://static01.nyt.com/images/2019/06/12/opinion/12kristofWeb/12kristofWeb-facebookJumbo.jpg", "publishedAt": "2019-06-12T23:32:30Z", "content": "For the diner who has everything, restaurants offer gold in food. A Dubai restaurant, for example, has sold a cupcake enveloped in gold leaf. The gold is tasteless (and nontoxic), so its only purpose is extravagant novelty and a glittering price in this case,… [+1579 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "India reels as summer temperatures touch 50C", "description": "Parts of India are among the hottest in the world and people are struggling to keep cool.", "url": "https://www.bbc.co.uk/news/world-asia-india-48495492", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10734/production/_107208376_gettyimages-1147512502.jpg", "publishedAt": "2019-06-03T09:53:10Z", "content": "Image copyrightGetty Images\r\nIndia is reeling from an intense heat wave with temperatures crossing 45C in many parts of the country. \r\nChuru, in the northern state of Rajasthan, is India's hottest city - temperatures there soared to 50.8C on Sunday, the meteo… [+1902 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Anthony Kuhn", "title": "Why Aid Won't Fix North Korea's Recurring Food Shortages", "description": "Facing the worst drought in nearly four decades, the country is grappling with food shortages that affect 40% of its population. Researchers say food donations aren't likely to address the problem.", "url": "https://www.npr.org/sections/goatsandsoda/2019/06/09/730441007/why-aid-wont-fix-north-koreas-recurring-food-shortages", "urlToImage": "https://media.npr.org/assets/img/2019/06/06/ap_19080863793898_wide-d63ea12aac9863032ddbea53f151ed26d1176d88.jpg?s=1400", "publishedAt": "2019-06-09T12:13:00Z", "content": "Employees peek through the door of a showroom at a food factory in Pyongyang, North Korea.\r\nDita Alangkara/AP\r\nFacing the worst drought in nearly four decades, the country is grappling with food shortages that affect 40% of its population. The donation has hu… [+7063 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Daniel Boan", "title": "You can now buy a taco blanket that lets you curl up like your favorite snack", "description": "Amazon is selling a taco -shaped blanket that could take nap time to the next level. The blanket currently retails for $34.95 and has mostly positive reviews, though some pointed out that it's smaller than expected. You can also buy a taco-shaped pillow to co…", "url": "https://www.insider.com/amazon-taco-blanket-sleeping-bag-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf6c724f2f47942b601b703-1136-568.jpg", "publishedAt": "2019-06-04T19:30:00Z", "content": "Whether you're lounging on the couch in a tortilla blanket or at the pool in an avocado float, larger-than-life food-shaped items are becoming a big trend in 2019. \r\n The latest discovery that's taking over the internet, as spotted on Delish, is a taco blanke… [+1205 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": null, "title": "‘This terrible disease’: Ovarian cancer is deadly, but new tests, treatments start to emerge - Washington Post", "description": "‘This terrible disease’: Ovarian cancer is deadly, but new tests, treatments start to emerge Washington Post Compared with other cancer success stories, the disease historically has had a shortage of good news. Until recently, it hasn't benefited from new tre…", "url": "https://www.washingtonpost.com/national/health-science/this-terrible-disease-ovarian-cancer-is-deadly-but-new-tests-treatments-start-to-emerge/2019/05/17/c4111816-5629-11e9-8ef3-fbd41a2ce4d5_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/VC1byHXHGdSDG_MIraisSFZ8x7w=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BAKD2DTYEEI6TJ57ZCSDXBHOGE.jpg", "publishedAt": "2019-05-18T14:03:45Z", "content": "For the past few years, as part of the University of Chicago Pritzker medical school obstetrics-gynecology rotation, med students at an optional lunchtime seminar hear from ovarian cancer survivors who share stories about the shock of diagnosis, painful treat… [+10207 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephanie Nebehay", "title": "North Korea says \"biggest issue\" in U.S. ties is impounded ship", "description": "The U.S. seizure of a North Korean cargo ship is the biggest stumbling block to improving bilateral relations, a senior North Korean official said on Wednesday, warning Washington against using the \"logic of strength\" against Pyongyang.", "url": "https://www.reuters.com/article/us-northkorea-usa-un-idUSKCN1SS1YC", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190522&t=2&i=1389835644&w=1200&r=LYNXNPEF4L1FG", "publishedAt": "2019-05-22T15:21:57Z", "content": "GENEVA (Reuters) - The U.S. seizure of a North Korean cargo ship is the biggest stumbling block to improving bilateral relations, a senior North Korean official said on Wednesday, warning Washington against using the “logic of strength” against Pyongyang. \r\nT… [+3410 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Tiana Attride", "title": "The 15 best things to eat in France", "description": "France is home to many Michelin-starred restaurants: but sometimes its most simple dishes are the best. Anticipated and feared alike by tourists, escargot is one of the most iconic French dishes. A pain au chocolat may just be an amped up croissant, but the m…", "url": "https://www.insider.com/best-food-france-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cf933874cf2705efa0e4a8a-2732-1366.jpg", "publishedAt": "2019-06-06T15:36:29Z", "content": "France has some of the most Michelin-starred restaurants on Earth, so it's no surprise that it's a haven for foodies. \r\n From cheese and chocolate to pastries and wine, there is no shortage of delicious dishes for any traveler to try. These 15 specialties are… [+122 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Josh Smith", "title": "Hundreds of foreign companies attend North Korea trade fair despite sanctions", "description": "An international trade fair in North Korea this week may be the largest such event on record, analysts said on Tuesday, with hundreds of Chinese and other foreign vendors taking part despite sanctions pressure.", "url": "https://www.reuters.com/article/us-northkorea-trade-fair-idUSKCN1SR0GJ", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190521&t=2&i=1389364607&w=1200&r=LYNXNPEF4K0KR", "publishedAt": "2019-05-21T08:22:11Z", "content": "SEOUL (Reuters) - An international trade fair in North Korea this week may be the largest such event on record, analysts said on Tuesday, with hundreds of Chinese and other foreign vendors taking part despite sanctions pressure. \r\nThe 22nd Pyongyang Spring In… [+3432 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Savanna Swain-Wilson", "title": "10 of the best cruises to take if you're retired", "description": "Cruises can be a great vacation option for retirees because they are a great way to explore the world in a convenient and luxurious way. Some cruises specifically cater to adults and p eople who are retired can enjoy the benefits of long cruises that sail aro…", "url": "https://www.insider.com/best-cruises-for-retirees-to-go-on-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce3f58ff2f4790606573418-2732-1366.jpg", "publishedAt": "2019-05-21T12:55:40Z", "content": "The Celebrity Cruise fleet currently has 10 cruise ships that hold thousands of passengers. With destinations in Alaska, the Caribbean, the Mediterranean, Scandinavia, the Iberian Peninsula, and Iceland, this cruise is a great choice for folks who like a mix … [+1040 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Tendai Marima", "title": "Ramadan becomes a struggle in cyclone-hit northern Mozambique", "description": "Muslims in the region spend their Ramadan trying to rebuild their lives amid shortage of food and damaged mosques.", "url": "https://www.aljazeera.com/news/2019/05/ramadan-struggle-cyclone-hit-northern-mozambique-190519144622721.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/5/19/30aef41320584a6eb4c412fc54c16a70_18.jpg", "publishedAt": "2019-05-19T20:57:00Z", "content": "Guludo/Ibo, Mozambique Piles of debris lie wherethatched mud huts once stood in the village of Guludo in northern Mozambique. Broken pieces of furniture and muddied books litter the landscape and many like Asma Mushillah, 53, spend their days trying to salvag… [+5964 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Myra P. Saefong", "title": "Commodities Corner: Corn prices poised to hit 5-year high as flooding leaves U.S. plantings way behind", "description": "U.S. farmers are millions of acres behind their usual pace of corn planting this spring because of flooding, which may lead to a supply shortage that lifts prices by year end to their highest in five years.", "url": "https://www.marketwatch.com/story/corn-prices-poised-to-hit-5-year-high-as-flooding-leaves-us-plantings-way-behind-2019-06-13", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HL384_corn_f_ZG_20190613140901.jpg", "publishedAt": "2019-06-13T18:17:42Z", "content": "U.S. farmers are millions of acres behind their usual pace of corn planting this spring because of flooding, which may lead to a supply shortage that lifts prices by year end to their highest in five years.\r\nCorn planted in the 18 states that account for the … [+3569 chars]"}, {"source": {"id": null, "name": "Theinventory.com"}, "author": "Tercius on Kinja Deals, shared by Ana Suarez to Kotaku", "title": "Wednesday's Best Deals: Instant Pot, Sonos, Purina Pet Food, and More", "description": "An Everlane sale, Crocs, Anker Qi charger, and a vitamin Gold Box lead off Wednesday’s best deals. Read more...", "url": "https://kinjadeals.theinventory.com/wednesdays-best-deals-instant-pot-sonos-purina-pet-f-1834946241", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--bwvDqVdg--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/y68qr4iwvj4ylqasfvcc.jpg", "publishedAt": "2019-05-22T15:00:00Z", "content": "An Everlane sale, Crocs, Anker Qi charger, and a vitamin Gold Box lead off Wednesdays best deals.\r\nWhile youre out there gearing up for the arrival of Memorial Day Weekend, well be here, updating\r\nRead more Read\r\nBookmark Kinja Deals and follow us on Twitter … [+47620 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Joan Oleck", "title": "New Yorkers Can Now Buy Upscale CBD Products at Storefronts -- As Naturally As They'd Buy Diamonds and Champagne", "description": "It's not just dispensaries anymore selling CBDs. Spas are offering trendy (and pricey) CBD tinctures, patches and oils.", "url": "https://www.entrepreneur.com/article/334137", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190522151307-VRFKcp4w.jpeg", "publishedAt": "2019-05-23T14:30:00Z", "content": "New York City has no shortage of spas -- centers of calm featuring masses of tea lights, waterfall soundtracks and soft-voiced assistants clad in white and ready to offer a massage, facial or guided meditation -- usually at a steep price.\r\nSo, the addition of… [+3613 chars]"}, {"source": {"id": null, "name": "Fastcompany.com"}, "author": "Eillie Anzilotti", "title": "4 popular, innovative ideas to help fix America’s housing crisis", "description": "A new report polled Americans about what interventions they’d support to make sure more people could afford their housing. Here’s what they came up with. For so many Americans, the high cost of housing in a painful reality. In the last decade, rents have rise…", "url": "https://www.fastcompany.com/90353942/4-simple-popular-ideas-to-help-fix-americas-housing-crisis?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29", "urlToImage": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/05/p-1-90353942-this-is-exactly-how-to-fix-housing-inequality-in-america.jpg", "publishedAt": "2019-05-24T11:30:28Z", "content": "For so many Americans, the high cost of housing in a painful reality. In the last decade, rents have risen 31%, well outpacing nearly stagnant salary growth rates. Many people living on lower incomes spend half of what they take home on shelter. Around 21 mil… [+6332 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "North Korea says it is suffering worst drought in decades", "description": "North Korean officials have blamed the food shortage on bad weather and international economic sanctions", "url": "https://www.thehindu.com/news/international/north-korea-says-it-is-suffering-worst-drought-in-decades/article27145496.ece", "urlToImage": "https://www.thehindu.com/news/international/esc5sc/article27145494.ece/ALTERNATES/LANDSCAPE_615/NORTHKOREADROUGHTTHNAK", "publishedAt": "2019-05-16T04:59:42Z", "content": "North Korea said on Wednesday it is suffering its worst drought in nearly four decades amid reports of severe food shortages. \r\nThe official Korean Central News Agency said an average of 54.4 millimeters of rain fell throughout the country in the first five m… [+1363 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Noam Scheiber", "title": "Air Travel Workers Seek to Capitalize on Newfound Clout", "description": "A shortage of controllers hastened the end of the government shutdown this year. Now catering employees hope a similar dynamic will help them win better pay.", "url": "https://www.nytimes.com/2019/06/04/business/economy/airport-workers-union.html", "urlToImage": "https://static01.nyt.com/images/2019/06/03/business/03airport2/03airport2-facebookJumbo.jpg", "publishedAt": "2019-06-04T15:18:24Z", "content": "In principle, the airlines could scale back in-flight food and beverage service. But they would risk a backlash from passengers, one that might be amplified by other airport workers.\r\nWe will also take part in helping to inform the public more generally about… [+1254 chars]"}, {"source": {"id": null, "name": "Food52.com"}, "author": "Erin Alexander", "title": "Our Best 10-Minute Recipes for Breezy Summer Hangouts", "description": "One of the best things about summer is, undeniably, spending time outside, whether it's alone on a solo beach day or at a backyard BBQ with a full guest list of your favorite people. But with unpredictable weather (flash thunderstorms! 100-degree heatwaves!),…", "url": "https://food52.com/blog/24170-backyard-party-ideas?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+food52-TheAandMBlog+%28The+A%2BM+Blog%29", "urlToImage": "https://images.food52.com/6-Y9dx-zhhMVP4SnH0OeO3biKFU=/fit-in/1200x1200/596b3468-189f-47bf-9c82-52266370bd14--2017-0725_tomato-nectarine-mozzarella-salad_emily-dryden_331.jpg", "publishedAt": "2019-05-22T14:00:00Z", "content": "One of the best things about summer is, undeniably, spending time outside, whether it's alone on a solo beach day or at a backyard BBQ with a full guest list of your favorite people. But with unpredictable weather (flash thunderstorms! 100-degree heatwaves!),… [+4158 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY, Ken Alltucker, USA TODAY", "title": "Blood pressure drug recall: Teva pulls losartan tablets tainted with possible carcinogen", "description": "Teva Pharmaceuticals has expanded its recall of losartan potassium tablets that contained a possible carcinogen", "url": "https://www.usatoday.com/story/news/health/2019/06/13/losartan-recalled-teva-removes-41-lots-blood-pressure-drug/1446724001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/06/10/USATODAY/usatsports/gettyimages-646346068.jpg?width=3200&height=1680&fit=crop", "publishedAt": "2019-06-13T22:06:15Z", "content": "Teva Pharmaceuticals this week expanded its recall of losartan potassium tablets after detecting a possible human carcinogen in the blood pressure medication.\r\nThe Israel-based drugmaker recalled six more lots of losartan potassium that contained unacceptable… [+2292 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": "Brendan Caldwell", "title": "The children of Pathologic 2 teach you about dread on a derelict train track", "description": "I gave up on the plague-doctoring of Pathologic 2 after suffering from its punitive survival meters and tedious food-getting. The place has so little grub I spent my brief visit wrestling with a frustrating hunger. Yet for those hardy souls willing to overloo…", "url": "https://www.rockpapershotgun.com/2019/05/24/pathologic-2-train-summoning/", "urlToImage": "https://assets.rockpapershotgun.com/images/2019/05/pathologic-2-train-summoning-2.jpg", "publishedAt": "2019-05-24T16:00:30Z", "content": "I gave up on the plague-doctoring of Pathologic 2 after suffering from its punitive survival meters and tedious food-getting. The place has so little grub I spent my brief visit wrestling with a frustrating hunger. Yet for those hardy souls willing to overloo… [+4401 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Skinny cod and grey seal reveals troubling changes to food web in the Baltic Sea", "description": "The prime predators of the Baltic Sea at the top of the food web are losing weight, according to a new study that links the deteriorating health of gray seals and cod with changes in bottom-living crustaceans, isopods and amphipods.", "url": "https://www.sciencedaily.com/releases/2019/06/190611081857.htm", "urlToImage": null, "publishedAt": "2019-06-11T12:18:57Z", "content": "\"It is important that you understand how the food web works when managing a fishery. It is not enough to manage how the fish and fisheries are changing. The availability and quality of food is at least as important,\" says Lena Bergström, researcher at the Dep… [+2545 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jonathan Mingle", "title": "Atmospheric Methane Levels Are Going Up—And No One Knows Why", "description": "Levels of heat-trapping methane are rising faster than climate experts anticipated, triggering intense debate about why it's happening.", "url": "https://www.wired.com/story/atmospheric-methane-levels-are-going-up-and-no-one-knows-why/", "urlToImage": "https://media.wired.com/photos/5cdca4c5af643e2f373ebc3d/191:100/pass/science_refinery-fire_462840162.jpg", "publishedAt": "2019-05-16T12:00:00Z", "content": "This story originally appeared on Undark and is part of the Climate Desk collaboration.\r\nEvery week dozens of metal flasks arrive at NOAAs Earth System Research Laboratory in Boulder, Colorado, each one loaded with air from a distant corner of the world. Rese… [+24577 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Becky Ferreira, Natasha Grzincic", "title": "The Climate Crisis Likely Caused Mass Die-Off of Puffins", "description": "As many as 8,800 birds died over the course of a few months in 2016 due to a severe food shortage.", "url": "https://www.vice.com/en_us/article/mb8p3y/the-climate-crisis-likely-caused-mass-die-off-of-puffins", "urlToImage": "https://video-images.vice.com/articles/5ceeb7ecee5eb20007b7ddfd/lede/1559148591686-201711_web.jpeg?crop=1xw:0.75xh;center,center&resize=1200:*", "publishedAt": "2019-05-29T18:00:00Z", "content": "Carcasses of tufted puffins, October 2016. Image: Aleut Community of St Paul Island Ecosystem Conservation Office As many as 8,800 birds in the Bering Sea starved to death in late 2016, in part due to the climate crisis, says a new study. \r\n The die-off was c… [+2502 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Jim Zarroli", "title": "With Workers Hard To Find, Immigration Crackdown Leaves Iowa Town In A Bind", "description": "Business leaders worry that tough laws against undocumented workers will discourage legal immigrants from coming to the state to work. Iowa's low jobless rate has left businesses struggling to hire.", "url": "https://www.npr.org/2019/05/21/725096578/with-workers-hard-to-find-immigration-crackdown-leaves-iowa-town-in-a-bind", "urlToImage": "https://media.npr.org/assets/img/2019/05/21/mountpleasant1-edit_wide-d6a540a83bb88772eb239689859f9e997637aa8c.jpg?s=1400", "publishedAt": "2019-05-21T20:23:38Z", "content": "A lot of Iowa business owners in towns like Mount Pleasant are facing chronic labor shortages. One solution is to encourage more outsiders to come to the state, including immigrants.\r\nJim Zarroli/NPR\r\nOne morning a year ago, federal immigration agents swept i… [+6738 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "California Man Becomes the First ‘Death With Dignity’ Patient to Undergo Cryonic Preservation", "description": "A terminally ill patient who opted for assisted death has undergone cryonic preservation at the Alcor Life Extension Foundation. This preservation—the first of its kind—signifies an important milestone for cryonics advocates, who argue that the right to death…", "url": "https://gizmodo.com/california-man-becomes-the-first-death-with-dignity-p-1831652934", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--fWIKD2CK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oxubt937dqwslishxtph.jpg", "publishedAt": "2019-05-31T19:15:00Z", "content": "A terminally ill patient who opted for assisted death has undergone cryonic preservation at the Alcor Life Extension Foundation. This preservationthe first of its kindsignifies an important milestone for cryonics advocates, who argue that the right to death, … [+10445 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Sam Gutierrez", "title": "I lived in Austin for 12 years. Here's what everyone should do when they visit.", "description": "There's nothing like getting travel advice from a local. I've lived in Austin, Texas, for 12 years and there are lots of fun shops, music stores, bars, and more. From hanging out in Zilker Park to strolling down South Congress Avenue, here's what you should d…", "url": "https://www.insider.com/what-to-do-see-in-austin-local-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5cfebaaf4cf2700f8c6e214e-1920-960.jpg", "publishedAt": "2019-06-10T20:13:50Z", "content": "South Congress is the heart of Austin's downtown scene and a walk down the bustling street is a must on a trip to the capital. \r\n On SoCo, as it's known locally, you'll find plenty of boutiques and iconic Austin stores like Allen's Boots (a cowboy boot empori… [+606 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Lorne Matalon", "title": "In Rural West Texas, Illegal Border Crossings Are Routine For U.S. Citizens", "description": "In some remote border towns in Texas along the Rio Grande, U.S. citizens cross back and forth for medical care in Mexico. It's a technically illegal reality that local Border Patrol acknowledges.", "url": "https://www.npr.org/2019/05/25/726128023/in-rural-west-texas-illegal-border-crossings-are-routine-for-u-s-citizens", "urlToImage": "https://media.npr.org/assets/img/2019/05/23/us_citizens_cross_candelaria_texas_wide-d613580ea38dfec34371af7c0be399869f5a9514.jpg?s=1400", "publishedAt": "2019-05-25T12:20:13Z", "content": "U.S. citizens use ropes to cross the Rio Grande from San Antonio del Bravo, Mexico, into Candelaria, Texas. U.S. citizens depend on the free health clinic in San Antonio del Bravo.\r\nLorne Matalon for NPR\r\nAlong one rugged stretch of the Rio Grande, U.S. citiz… [+4364 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Helena Horton", "title": "Potato farmers forced to trial 'expensive' new watering system to ward off drought threat to summer crop", "description": "Potato farmers are being forced to trial an 'expensive' new irrigation system because water levels are so low that a severe shortage of the vegetable has been predicted.", "url": "https://www.telegraph.co.uk/news/2019/05/26/potato-farmers-forced-trial-expensive-new-watering-system-ward/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/05/24/TELEMMGLPICT000198180675-xlarge_trans_NvBQzQNjv4BqqGw_8_YqFn6oOhW46YSWn8Pb7IFTOXDdg53tLFsgRZE.jpeg", "publishedAt": "2019-05-26T06:00:00Z", "content": "Potato farmers are being forced to trial an 'expensive' new irrigation system because water levels are so low that a severe shortage of the vegetable has been predicted.\r\nA lack of rainfall last year and so far this year means that irrigation prospects across… [+2292 chars]"}, {"source": {"id": "the-telegraph", "name": "The Telegraph"}, "author": "Gabriella Swerling", "title": "Shopping for make-up and food makes us unhappy, ONS data reveals in first study of its kind", "description": "Shopping for makeup and food makes us unhappy, new data reveals in the first study of its kind.", "url": "https://www.telegraph.co.uk/news/2019/05/15/shopping-make-up-food-makes-us-unhappy-ons-data-reveals-first/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/predictions/getty-make-up-brush-xlarge_trans_NvBQzQNjv4Bq7bWQfKLf2dhrSxHZc33L6pjU3FTkC-rJ_3WDcG3_Hko.jpg", "publishedAt": "2019-05-15T17:38:44Z", "content": "In contrast, spending on communication devices and products had a -38.4 per cent impact on peoples wellbeing. Food shopping also had a negative effect with a -18.2 per cent on positive life satisfaction and miscellaneous items such as hair and makeup products… [+1080 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "A big red reason not to dig a mine in Alaska's fat bear country", "description": "Like the sun promises to rise each morning, hordes of crimson salmon — numbering in the tens of millions — faithfully return to Alaska's Bristol Bay each summer. This land of untrammeled rivers, streams, and lakes is home to the richest run of sockeye salmon …", "url": "https://mashable.com/article/fat-bears-salmon-mine/", "urlToImage": "https://mondrian.mashable.com/2019%252F05%252F23%252F1c%252F56232cf1269e4103a1ad012e935061a0.f47a4.jpg%252F1200x630.jpg?signature=tVThvLbDF9KIkAik_Bu70ECgMNI=", "publishedAt": "2019-05-24T13:00:00Z", "content": "Like the sun promises to rise each morning, hordes of crimson salmon numbering in the tens of millions faithfully return to Alaska's Bristol Bay each summer.\r\nThis land of untrammeled rivers, streams, and lakes is home to the richest run of sockeye salmon on … [+9489 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Carmen Reinicke", "title": "Beyond Meat jumps on report that Impossible Burger shortages have hit restaurants (BYND)", "description": "Beyond Meat shares jumped Friday after a report of an Impossible Burger shortage. Impossible Foods, which makes the Impossible Burger, is a major competitor in the plant-based meat space. Beyond Meat addressed the demand problem during its first earnings rele…", "url": "https://www.businessinsider.com/beyond-meat-stock-price-higher-after-impossible-burger-shortage-report-2019-6", "urlToImage": null, "publishedAt": "2019-06-14T14:39:36Z", "content": null}, {"source": {"id": null, "name": "Vox.com"}, "author": "Kaitlyn Tiffany", "title": "Inside a bunker filled with no food but Cheez-Its", "description": "The Kellogg Company’s latest brand activation.", "url": "https://www.vox.com/the-goods/2019/5/17/18627833/cheez-it-snapd-bunker-brand-activation-new-york", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AozjzRV2VWSOOJXZQ_gP0XK5tV8=/0x446:3936x2507/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16281314/Cheez_It_Snapd_Bunker_1.jpg", "publishedAt": "2019-05-17T13:30:00Z", "content": "Obviously for a brand activation. The invitation to the Cheez-It bunker was not sent, precisely, to me. It was sent to Vox culture editor Jen Trolio and then forwarded through several other editors at this website and then turned up in my inbox with a questio… [+10999 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Associated Press", "title": "Jury orders Monsanto to pay $2 billion in Roundup weed killer cancer case; appeal expected", "description": "On Monday, a jury ordered Monsanto Co. to pay a combined $2 billion to a California couple", "url": "https://www.usatoday.com/story/money/2019/05/13/weed-killer-cancer-case-jury-orders-monsanto-pay-2-billion/1194572001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "urlToImage": "https://www.gannett-cdn.com/presto/2019/03/19/PNJM/34fbc530-f734-497c-a944-6334f67fe227-AP19078787195521.jpg?crop=2999,1687,x1,y135&width=3200&height=1680&fit=bounds", "publishedAt": "2019-05-13T23:08:52Z", "content": "According to a new study, exposure to a chemical found in weedkiller can up your risk of getting cancer. Buzz60's Mercer Morrison has the story.\r\n Buzz60\r\nOAKLAND, Calif. (AP) A jury on Monday ordered agribusiness giant Monsanto Co. to pay a combined $2.05 bi… [+2881 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Brian Ashcraft", "title": "Tourists Are Causing Headaches In Japan", "description": "Until recently, Japan didn’t have much of an influx of foreign tourists. Now, it does, and with that comes problems. Read more...", "url": "https://kotaku.com/tourists-are-causing-headaches-for-japan-1835043188", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--dGx6FnI_--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mimumrl7levqrwgyi0ku.jpg", "publishedAt": "2019-05-27T10:00:00Z", "content": "Until recently, Japan didnt have much of an influx of foreign tourists. Now, it does, and with that comes problems.\r\nOf course, Japan should have a thriving tourism industry! This is a beautiful country with a rich culture, a long history and delicious food. … [+9339 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "James Rogers", "title": "Exiled doughnut-loving bear 'staying out of trouble' after traveling thousands of miles to return home: officials", "description": "A doughnut-loving bear is “staying out of trouble” after it traveled thousands of miles to return home, say wildlife officials.", "url": "https://www.foxnews.com/science/doughnut-loving-bear-staying-out-of-trouble", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/MinkBear.jpg", "publishedAt": "2019-05-23T15:45:53Z", "content": "A doughnut-loving bear is “staying out of trouble” after it traveled thousands of miles to return home, say wildlife officials.\r\nDubbed “Mink,” the animal was recently spotted on her home turf of Hanover, near Dartmouth College after she made an epic journey … [+3920 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "James Rogers", "title": "Exiled doughnut-loving bear travels thousands of miles to return home", "description": "A doughnut-loving bear whose life was spared by New Hampshire governor Chris Sununu two years ago has made an incredible journey home after being relocated last June.", "url": "https://www.foxnews.com/science/doughnut-loving-bear-returns-home", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/MinkBear.jpg", "publishedAt": "2019-05-22T15:38:19Z", "content": "A doughnut-loving bear whose life was spared by New Hampshire governor Chris Sununu two years ago has made an incredible journey home after being relocated last June.\r\nDubbed Mink the Bear, the animal was recently spotted on her home turf of Hanover, near Dar… [+3906 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Beatrice Christofaro", "title": "Water from sewer pipes, cooking with tiny candles, and a Happy Meal that costs a month's pay: Photos by ordinary Venezuelans show life under an economic meltdown", "description": "Blackouts, hyperinflation, and chronic shortages have become everyday life for millions of Venezuelans. Five people sent INSIDER pictures that show what it's like to live through the humanitarian crisis. From meat rotting in a warm fridge to a happy meal that…", "url": "https://www.insider.com/photos-what-its-like-to-live-in-venezuela-crisis-2019-4", "urlToImage": "https://amp.businessinsider.com/images/5cda6bd7f06717336014a42a-1920-960.jpg", "publishedAt": "2019-05-14T07:18:02Z", "content": "This photo is from Stephanie Vita Marcelot, an administrator in Caracas. \r\n She captured people crowding around a leaking sewage drain to collect water to drink and bathe during a blackout which stopped running water getting to their homes. \r\n Water pumps hav… [+833 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Dia Adams", "title": "4 Top Destinations in Mexico (That Aren’t Beaches)", "description": "Throughout the month of May, we’re exploring Mexico at The Points Guy, so check back regularly for flight and hotel reviews, features and deals from our neighbor to the south. If someone mentions a Mexican vacation, you probably picture sandy beaches and froz…", "url": "http://thepointsguy.com/guides/4-top-destinations-in-mexico-that-arent-beaches/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/04/Glow-Images_Oaxaca_GettyImages-82957908.jpg?fit=1600%2C1067px&ssl=1", "publishedAt": "2019-05-31T16:30:30Z", "content": "Throughout the month of May, we’re exploring Mexico at The Points Guy, so check back regularly for flight and hotel reviews, features and deals from our neighbor to the south.\r\nIf someone mentions a Mexican vacation, you probably picture sandy beaches and fro… [+9281 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Anju Agnihotri Chaba", "title": "Gunny bag shortage amid bumper wheat harvest triggers blame game in Punjab", "description": "Punjab has nearly 18.5 lakh households of farmers, including 10.25 lakh small and marginal farmers who own less than 5 acres of land.", "url": "https://indianexpress.com/article/india/gunny-bag-shortage-amid-bumper-wheat-harvest-triggers-blame-game-in-punjab-5735506/", "urlToImage": "https://images.indianexpress.com/2019/05/gunny-bags.jpg?w=759", "publishedAt": "2019-05-18T23:40:00Z", "content": "Punjab is the highest contributor of wheat to the central pool. (Express photo)\r\nHaving harvested a record wheat crop, and set to procure the highest wheat crop for the central pool around 132 lakh tonnes (LT), 5 per cent more than the state governments initi… [+2602 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Modi's party promises to boost India's economy; Congress calls exit polls fake", "description": "The exit polls have predicted an outright majority for Prime Minister Narendra Modi's alliance in the seven-phase election that ended on Sunday. The coalition, the National Democratic Alliance (NDA), which is led by Modi's Hindu nationalist Bharatiya Janata P…", "url": "https://news.yahoo.com/confident-poll-win-modis-alliance-promises-boost-indias-054254612.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/me.dk4PNUlhfN4Mb3j1zFg--~B/aD0yOTI7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-05-22T115739Z_1_LYNXNPEF4L0WB_RTROPTP_2_INDIA-ELECTION.JPG", "publishedAt": "2019-05-22T13:55:16Z", "content": "By Krishna N. Das\r\nNEW DELHI (Reuters) - India's ruling coalition has promised to rev up growth, double farmers' income and boost infrastructure spending in the next five years, after exit polls showed it would retain power when general election votes are cou… [+3536 chars]"}, {"source": {"id": null, "name": "Geekologie.com"}, "author": null, "title": "Data Visualization Engineer Imagines A Better Grocery Store Receipt", "description": "These are a few photos from Netflix senior data visualization engineer Susie Lu of an improved grocery store receipt she's developing that visualizes the percentage of total cost spent on each different type of food, as well as a food's relative cost to the m…", "url": "https://geekologie.com/2019/05/data-visualization-engineer-imagines-a-b.php", "urlToImage": "https://geekologie.com/2019/05/14/new-grocery-store-receipt-1.jpg", "publishedAt": "2019-05-14T20:41:33Z", "content": "These are a few photos from Netflix senior data visualization engineer Susie Lu of an improved grocery store receipt she's developing that visualizes the percentage of total cost spent on each different type of food, as well as a food's relative cost to the m… [+978 chars]"}, {"source": {"id": null, "name": "Saveur.com"}, "author": "Danielle Bauter, Danielle Bauter", "title": "Apple Pancakes So Good, They Made It Into Ruth Reichl’s Memoir", "description": "Food The famed former Gourmet editor-in-chief and New York Times food critic shares her recipe for this sweet, boozy German brunch or dessert The German apple pancakes food writer Ruth Reichl ate growing up are a delicious highlight of her new memoir.", "url": "https://www.saveur.com/ruth-reichl-memoir-apple-pancakes", "urlToImage": "https://www.saveur.com/sites/saveur.com/files/styles/opengraph_1_91x1/public/images/2019/06/sav-german-apple-pancakes-1500x1125.jpg?itok=wJw3Lp3c", "publishedAt": "2019-06-07T21:45:00Z", "content": "In culinary and literary legend Ruth Reichls new memoir, Save Me the Plums, the writer and former critic chronicles what might have been her most memorablebut, to her, unexpectedcareer years: the decade she spent at the helm of Gourmet magazine until it shutt… [+3856 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Op-ed: When did GMO become a dirty word?", "description": "Do you know someone with diabetes? While most people may associate GMOs with food products, their use actually began in the medical field with insulin, an important part of diabetes treatment.", "url": "https://phys.org/news/2019-06-op-ed-gmo-dirty-word.html", "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/gmo.jpg", "publishedAt": "2019-06-10T12:21:59Z", "content": "Do you know someone with diabetes? While most people may associate GMOs with food products, their use actually began in the medical field with insulin, an important part of diabetes treatment.\r\nThe Food and Drug Administration (FDA) approved GMO insulin for u… [+5049 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Harish Damodaran, Parthasarathi Biswas", "title": "RBI monetary policy committee meets June 6: Food inflation shadow over RBI rate meeting", "description": "Between December 2018 and April 2019, annual wholesale food price inflation rose from –0.42% to 7.37%", "url": "https://indianexpress.com/article/business/economy/rbi-monetary-policy-committee-meets-june-6-food-inflation-shadow-over-rbi-rate-meeting-5761684/", "urlToImage": "https://images.indianexpress.com/2018/12/farmer-1.jpg?w=759", "publishedAt": "2019-06-02T23:30:47Z", "content": "The last two-three months have seen prices of a host of farm commodities go up, mainly on the back of drought in large tracts of western and southern India\r\nMOST EXPECT the RBIs monetary policy committee to slash interest rates in its review meeting Thursday.… [+4502 chars]"}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "John Rampton", "title": "12 Easy and Efficient Ways Entrepreneurs Can Help Others", "description": "Everybody is busy, so find another excuse for not giving back.", "url": "https://www.entrepreneur.com/article/334027", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20190522184631-GettyImages-1028771818.jpeg", "publishedAt": "2019-05-24T11:00:00Z", "content": "Opinions expressed by Entrepreneur contributors are their own.\r\nAs a member of the startup community, giving back and helping others is a part of the job. Unfortunately, many entrepreneurs claim they don’t have the time or resources to lend a helping hand. Wh… [+8306 chars]"}, {"source": {"id": null, "name": "Thestar.com.my"}, "author": "By MAZWIN NIK ANIS", "title": "Fixed prices and no shortage of festive foods", "description": "PUTRAJAYA : There is enough stock of essential food items for the coming festive season with ceiling prices fixed for a month for 27 food items.", "url": "http://www.thestar.com.my/news/nation/2019/05/16/fixed-prices-and-no-shortage-of-festive-foods/", "urlToImage": "https://www.thestar.com.my/~/media/online/2019/05/15/18/03/112212.ashx/?w=620&h=413&crop=1&hash=BB4F8F754F91BEFBA556DB6A3033A2944CF230D8", "publishedAt": "2019-05-15T16:00:00Z", "content": "PUTRAJAYA : There is enough stock of essential food items for the coming festive season with ceiling prices fixed for a month for 27 food items.\r\nThe price scheme will begin from May 21 until June 19 to also coincide with the Kaamatan and Gawai festivals cele… [+1768 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Another sawmill closure - BC News - Castanet.net", "description": "Another sawmill closure - BC News Castanet.net Norbord’s 100 Mile location announces indefinite curtailment 100 Mile House Free Press View full coverage on Google News", "url": "https://www.castanet.net/news/BC/258511/Another-sawmill-closure", "urlToImage": "https://www.castanet.net/content/2019/6/cpt60601500_p3389801_p3391488.jpg", "publishedAt": "2019-06-11T22:07:00Z", "content": "BC  \r\nA total of 203 suspected hate crimes – the majority targeting Jewish, gay and lesbian communities – were reported to Vancouver police between 2014 and 2017.\r\nData released by the VPD under the Freedom of Information and Protection of Privacy Act showed … [+13949 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/tim-pearce", "title": "Bill Maher: 'What if Trump killed Mike Pompeo and John Bolton?' - Washington Examiner", "description": "Bill Maher: 'What if Trump killed Mike Pompeo and John Bolton?' Washington Examiner North Korea Grapples With Another Food Shortage. Will Aid Help? : Goats and Soda NPR 'Executed' North Korean pop star back from the dead -- and by Kim Jong-un's side New York …", "url": "https://www.washingtonexaminer.com/news/bill-maher-asks-panel-what-would-happen-if-trump-killed-mike-pompeo-and-john-bolton", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/b5f99f9/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F61%2Fd6%2Fd301c62345e19791b010b6e5d45d%2F060819-maher.jpg", "publishedAt": "2019-06-08T17:32:00Z", "content": "Bill Maher asked the panel on his HBO television show to hypothesize what would happen if President Trump killed his team of advisers negotiating with North Korea.\r\nOn Friday's episode of \"Real Time with Bill Maher,\" the comedian was joined by New York Times … [+1188 chars]"}, {"source": {"id": null, "name": "Neatorama.com"}, "author": "John Farrier", "title": "Taco Bell Plans to Open a Themed Resort", "description": "When most people are looking for fun and relaxation, they think, \"Hey, let's go to the Taco Bell.\" The problem is that after the restaurant closes, the police get called when you refuse to leave and it becomes in awkward situation for everyone. But what if yo…", "url": "https://www.neatorama.com/2019/05/17/Taco-Bell-Plans-to-Open-a-Themed-Resort/", "urlToImage": "https://uploads.neatorama.com/images/posts/461/106/106461/Taco-Bell-Plans-to-Open-a-Themed-Resort_0-x.jpg?v=9797", "publishedAt": "2019-05-17T19:46:28Z", "content": "When most people are looking for fun and relaxation, they think, \"Hey, let's go to the Taco Bell.\" The problem is that after the restaurant closes, the police get called when you refuse to leave and it becomes in awkward situation for everyone.\r\nBut what if y… [+1278 chars]"}, {"source": {"id": null, "name": "Kevinmd.com"}, "author": "Anne Naulty, RN", "title": "How PTSD is hurting nursing", "description": "Every time I hear that there is a nursing shortage in America, I feel myself cringe. There is not a shortage of nurses in America. There is a shortage of nurses who choose to work at the bedside. There is a reason, and it is called post-traumatic stress disor…", "url": "https://www.kevinmd.com/blog/2019/05/how-ptsd-is-hurting-nursing.html", "urlToImage": "https://www.kevinmd.com/blog/wp-content/uploads/shutterstock_1179632623.jpg", "publishedAt": "2019-05-22T23:00:36Z", "content": "Every time I hear that there is a nursing shortage in America, I feel myself cringe. There is not a shortage of nurses in America. There is a shortage of nurses who choose to work at the bedside. There is a reason, and it is called post-traumatic stress disor… [+6991 chars]"}, {"source": {"id": "daily-mail", "name": "Daily Mail"}, "author": "https://www.facebook.com/DailyMail", "title": "The great halloumi crisis of 2019", "description": "Halloumi is a favourite with vegetarians and lovers of Mediterranean food - but growing demand from countries such as China has led to a shortage in UK shops.", "url": "https://www.dailymail.co.uk/news/article-7066321/The-great-halloumi-crisis-2019.html", "urlToImage": "https://i.dailymail.co.uk/1s/2019/05/24/10/13902874-0-image-a-17_1558691434657.jpg", "publishedAt": "2019-05-24T09:54:27Z", "content": "The Cypriot cheese is a favourite with vegetarians and lovers of Mediterranean food (stock image: Grilled halloumi on rocket salad)\r\nA shortage of halloumi has sent prices soaring by up to 12 per cent - with Aldi now forced to limit sales of halloumi fries to… [+2655 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Daniel Hank", "title": "Family Fun, Even for the Dog: A Review of the Hyatt Regency Chesapeake Bay Resort", "description": "To The Point: This property is a hidden gem in the Northeast for a true resort experience without the plane ride. Pros: It has almost everything you could want in a resort -- great food, very family friendly and even pet friendly. Cons: Small beach, occasiona…", "url": "http://thepointsguy.com/reviews/hyatt-regency-chesapeake-bay-resort/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/05/20190508_Hyatt-Regency-Chesepeake-Bay_DHank-30.jpg?fit=1600%2C1200px&ssl=1", "publishedAt": "2019-05-16T23:00:01Z", "content": "The resort experience is what many people in the Northeast look for in a vacation. Fly someplace warm like Florida or the Caribbean, stay in a nice hotel with a beautiful view, and have lots of stuff to do in addition to lounging by a blue-water pool and cons… [+10333 chars]"}, {"source": {"id": null, "name": "Thepointsguy.com"}, "author": "Justine Harrington", "title": "Planning a Family Trip to Austin", "description": "You’ve heard about the tasty breakfast tacos, the live music on every corner and the barbecue — but have you heard that Austin is a magical place for families to visit? Explore the city’s world-class museums, spring-fed swimming holes, abundant food trucks an…", "url": "http://thepointsguy.com/guides/planning-a-family-trip-to-austin/", "urlToImage": "https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/05/Greetings-from-Austin-Mural.jpg?fit=2960%2C1784px&ssl=1", "publishedAt": "2019-06-11T10:30:18Z", "content": "Youve heard about the tasty breakfast tacos, the live music on every corner and the barbecue but have you heard that Austin is a magical place for families to visit? Explore the citys world-class museums, spring-fed swimming holes, abundant food trucks and pi… [+11814 chars]"}, {"source": {"id": null, "name": "Highsnobiety.com"}, "author": "Marta Sundac", "title": "The 10 Best Documentaries About the Future", "description": "We’re living in a time of uncertainty across many aspects of life. From climate change and the future of technology to food and fashion, as new breakthroughs or catastrophes occur nothing seems to be for certain. Parallel to this state of flux are a broad gro…", "url": "https://www.highsnobiety.com/p/documentaries-about-the-future/", "urlToImage": "https://static.highsnobiety.com/thumbor/JNCCKPZtQrjAhE-gUvDsL2JU5Fc=/fit-in/1200x720/smart/static.highsnobiety.com/wp-content/uploads/2019/05/23121731/documentaries-about-the-future-feat-2.jpg", "publishedAt": "2019-05-28T09:51:34Z", "content": "Were living in a time of uncertainty across many aspects of life. From climate change and the future of technology to food and fashion, as new breakthroughs or catastrophes occur nothing seems to be for certain. Parallel to this state of flux are a broad grou… [+10058 chars]"}, {"source": {"id": null, "name": "Nextavenue.org"}, "author": "Stephenie Overman", "title": "Next Avenue: You may need a measles or shingles vaccination, especially if you’re older", "description": "College students, health care personnel and international travelers are also at increased risk for measles.", "url": "https://www.nextavenue.org/measles-shingles-vaccines/", "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HK141_na_Mea_ZG_20190522162457.jpg", "publishedAt": "2019-05-29T08:59:00Z", "content": "This article is reprinted by permission from NextAvenue.org.\r\nYou probably know theres a measles outbreak. And you may have heard that theres a shortage of the most effective vaccine to prevent shingles, a cousin of the childhood disease chickenpox.\r\nDid you … [+5708 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bridget Arsenault, Contributor, Bridget Arsenault, Contributor https://www.forbes.com/sites/bridgetarsenault/", "title": "What To Book And See In London This Summer", "description": "A perk of living in or visiting one of the busiest cities in the world, is that there's never a shortage of things to see, do or try. Divided into 32  boroughs, each with its own culture and character. We run through some of the most engaging things to experi…", "url": "https://www.forbes.com/sites/bridgetarsenault/2019/06/05/what-to-book-and-see-in-london-this-summer/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fbridgetarsenault%2Ffiles%2F2019%2F06%2FSheekeyJoanneFroggatt-1200x1050.jpg", "publishedAt": "2019-06-05T06:41:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nJoanne Froggatt portrait at J Sheekey\r\nJ Sheekey\r\nA&amp;nbsp;perk of living in or visiting one of the busiest cities in the world, is that there's never a shortage of things to see, do or try. Divided in… [+10840 chars]"}, {"source": {"id": null, "name": "Everything-everywhere.com"}, "author": "Staff Writer", "title": "7 Fascinating Reasons to Visit Croatia", "description": "This post is sponsored by Goolets, a company specializing in luxury gulet cruises. There are no shortage of beautiful holiday destinations around the world, however, Croatia is a hotspot that only increases in popularity every year. With its rugged mountains,…", "url": "https://everything-everywhere.com/reasons-to-visit-croatia/", "urlToImage": "", "publishedAt": "2019-06-04T12:00:07Z", "content": "Last Updated on June 4, 2019\r\nThis post is sponsored by Goolets, a company specializing in luxury gulet cruises.\r\nThere are no shortage of beautiful holiday destinations around the world, however, Croatia is a hotspot that only increases in popularity every y… [+11575 chars]"}, {"source": {"id": null, "name": "Food52.com"}, "author": "Emma Laperruque", "title": "41 Summer Desserts Because I Scream, You Scream, We All—You Know", "description": "If you’re looking for an excuse to make dessert, here’s one that will last you for months: summer. This laidback, sun-drenched season is full of juicy strawberries and plump plums and plumper peaches—and it sure would be a shame to ignore such bounty, right? …", "url": "https://food52.com/blog/24252-summer-dessert-recipes?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+food52-TheAandMBlog+%28The+A%2BM+Blog%29", "urlToImage": "https://images.food52.com/y0SvJc5xOv9K90tjTSazzVYV4aw=/fit-in/1200x1200/08c4fb25-d939-41b7-8997-faff8903488a--2017-0718_double-raspberry-shortcakes_julia-gartland_107.jpg", "publishedAt": "2019-06-13T17:00:00Z", "content": "If youre looking for an excuse to make dessert, heres one that will last you for months: summer. This laidback, sun-drenched season is full of juicy strawberries and plump plums and plumper peachesand it sure would be a shame to ignore such bounty, right?\r\nHe… [+9091 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sarah Marsh", "title": "Shortages plague Cuba as U.S. sanctions sharpen economic woes", "description": "Israel Hidalgo and his wife left home around 7:30 a.m. to reach a supermarket across Havana because they heard it might be selling chicken, a staple of the Cuban diet increasingly scarce on the shortage-plagued island.", "url": "https://www.reuters.com/article/us-cuba-economy-idUSKCN1SX1P1", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190527&t=2&i=1391513848&w=1200&r=LYNXNPEF4Q16T", "publishedAt": "2019-05-27T17:34:23Z", "content": "HAVANA (Reuters) - Israel Hidalgo and his wife left home around 7:30 a.m. to reach a supermarket across Havana because they heard it might be selling chicken, a staple of the Cuban diet increasingly scarce on the shortage-plagued island. \r\nAfter Cuba started … [+7789 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Elva Ramirez, Contributor, Elva Ramirez, Contributor https://www.forbes.com/sites/elvaramirez/", "title": "Visit Mexico City: Where To Eat And Drink Now", "description": "Mexico's lush beaches and seaside resorts may get the bulk of tourist attention, but if you're a diehard food and drinks fan, put Mexico City on your destination list.", "url": "https://www.forbes.com/sites/elvaramirez/2019/05/31/visit-mexico-city-where-to-eat-and-drink-now/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Felvaramirez%2Ffiles%2F2019%2F05%2FCity1-1200x760.jpg", "publishedAt": "2019-05-31T19:17:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nRoma, Mexico City.\r\nElva Ramirez\r\nMexico's lush beaches and seaside resorts may get the bulk of tourist attention, but if you're a diehard food and drinks fan, put Mexico City on your destination list.\r\n… [+8618 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Talia Milgrom-Elcott, Contributor, Talia Milgrom-Elcott, Contributor https://www.forbes.com/sites/taliamilgromelcott/", "title": "There's A Nationwide STEM Teacher Shortage. Will It Cost Us The Next Einstein?", "description": "We’re losing Einsteins every day because too many of our students don’t experience excellent STEM learning. To create the next generation of innovators that can drive solutions to our biggest challenges, we must foster everyone’s unique creativity and brillia…", "url": "https://www.forbes.com/sites/taliamilgromelcott/2019/05/30/theres-a-nationwide-stem-teacher-shortage-will-it-cost-us-the-next-einstein/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ftaliamilgromelcott%2Ffiles%2F2019%2F05%2Fpxnsye3z377a44hfq1tk-e1558626710892.png", "publishedAt": "2019-05-30T13:48:00Z", "content": "Its striking to think about what our world would be missing if it werent for Albert Einstein: lasers, GPS, barcodes, to say nothing of our understanding of black holes, time/space, and the relationship between energy and matter.But what if a little boy named … [+8927 chars]"}, {"source": {"id": null, "name": "Wrcbtv.com"}, "author": null, "title": "What the Tech? App of the Day: Tasty - WRCB-TV", "description": "What the Tech? App of the Day: Tasty WRCB-TV There's no shortage of recipe or cooking apps in the app stores. Some really great ones with tens of thousands of dishes but that isn't what you always need or...", "url": "https://www.wrcbtv.com/story/40539515/what-the-tech-app-of-the-day-tasty", "urlToImage": "https://WRCB.images.worldnow.com/images/18428242_G.jpeg?lastEditedDate=1558973177000", "publishedAt": "2019-05-27T20:07:00Z", "content": "There’s no shortage of recipe or cooking apps in the app stores. Some really great ones with tens of thousands of dishes but that isn't what you always need or want. If you want simple and fun, there’s Tasty.\r\nThis free app for Android and iOS devices has a s… [+1335 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Raptors founder proud - Canada News - Castanet.net", "description": "Raptors founder proud - Canada News Castanet.net Bulls & Bears: Raptors on rim of making hoop history, NHL drags out Cup final series Vancouver Sun TNT Promotes AEW's Double Or Nothing During NBA Playoff Game TheSportster Canada’s team? Winning Raptors may fu…", "url": "https://www.castanet.net/news/Canada/257048/Raptors-founder-proud", "urlToImage": "https://www.castanet.net/content/2019/5/FNG24500171_p3388429.jpg", "publishedAt": "2019-05-24T20:32:00Z", "content": "Canada  \r\nSofina Foods Inc. is recalling Compliments brand Chicken Strips from the marketplace to avoid possible Salmonella illnesses.\r\nThe Public Health Agency of Canada says it's investigating an outbreak of human illness and has identified this product as … [+23494 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Cubans grapple with food shortage due to Venezuela crisis", "description": "In Cuba putting putting food on the table has become increasingly difficult, as Venezuela cuts back on oil shipments. Now that Cubans have access to the internet, they are raising their voices on social media.", "url": "https://www.dw.com/en/cubans-grapple-with-food-shortage-due-to-venezuela-crisis/a-48763590", "urlToImage": "https://www.dw.com/image/48732506_304.jpg", "publishedAt": "2019-05-19T15:42:00Z", "content": "A woman on a balcony spots the arrival of a refrigerated truck that is supposed to supply the corner store. She doesn't miss a beat, hollering: \"Maricusa, the chicken has arrived!\" Minutes later the neighborhood swells with people running, bags in hand, towar… [+6903 chars]"}, {"source": {"id": null, "name": "Eater.com"}, "author": "Caleb Pershan", "title": "SF Restaurants Run Out of Impossible Burgers Amid Company’s Rapid Growth", "description": "Impossible Foods’ shortage affects its own backyard", "url": "https://sf.eater.com/2019/5/21/18634640/impossible-burger-shortage-san-francisco-restaurants-distributors", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ww7c4cylYa3rDEb2jDQ0N0E4f84=/0x350:4883x2907/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13607250/01_Impossible_Oakland.jpg", "publishedAt": "2019-05-21T23:22:26Z", "content": "Impossible Foods’ shortage affects its own backyard As Redwood City-based Impossible Foods begins supplying chains like Burger King and Little Caesars, some SF restaurant owners who helped establish the brand’s popularity in the first place are feeling left b… [+3413 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "By Thor Benson", "title": "Robot Apple Pickers Could Change Farming as We Know It", "description": "Photo Illustration by Sarah Rogers/The Daily Beast/Photos Getty While the Trump administration works to reduce the number of immigrants entering the United States, the U.S. economy is dealing with the worst labor shortage it’s seen in decades. This labor shor…", "url": "https://www.thedailybeast.com/robot-apple-pickers-could-change-farming-as-we-know-it", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1558126095/190517-roboapple-picking-tease_ppjck5", "publishedAt": "2019-05-20T08:46:06Z", "content": "While the Trump administration works to reduce the number of immigrants entering the United States, the U.S. economy is dealing with the worst labor shortage its seen in decades. This labor shortage is hitting nearly every industry, but among the worst is the… [+3629 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "jgerstein@politico.com (Josh Gerstein)", "title": "FDA can’t control death penalty drugs, DOJ says", "description": "States have carried out about 25 executions a year since 2015, a significant drop-off from the previous two decades.", "url": "https://www.politico.com/story/2019/05/14/fda-death-penalty-drugs-1323248", "urlToImage": "https://static.politico.com/aa/a3/04896b6940f1872fa07ed2f9e523/19514-death-penalty-gty-773.jpg", "publishedAt": "2019-05-15T01:34:22Z", "content": "The Constitution and numerous federal statutes presuppose that capital punishment will remain available and that the federal government will defer to States over methods of execution, the opinion says. | California Department of Corrections and Rehabilitation… [+3919 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Micheline Maynard, Contributor, Micheline Maynard, Contributor https://www.forbes.com/sites/michelinemaynard/", "title": "As Deliveroo Gets Amazon Cash, Is Delivery A Solution To Restaurant Staffing Problems?", "description": "Deliveroo gets an injection of cash as restaurant owners look for solutions to short staffing.", "url": "https://www.forbes.com/sites/michelinemaynard/2019/06/13/as-deliveroo-gets-amazon-cash-is-delivery-a-solution-to-restaurant-staffing-problems/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5d02808434a5c40008484d36%2F960x0.jpg", "publishedAt": "2019-06-13T17:04:19Z", "content": "Motor scooters with boxes for Deliveroo wait for food orders in London. Photographer: Simon Dawson/Bloomberg\r\n© 2016 Bloomberg Finance LP\r\nDeliveroo doesn't have a presence yet in the United States, but if you live in London, you bump into the food delivery c… [+8783 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Neri Zilber", "title": "After the Netanyahu Fail, What Is Trump’s Israel-Palestine Solution? Let Others Pick Up the Pieces", "description": "Thomas Coex/AFP/GettyTEL AVIV — Israel is now headed to an unprecedented repeat election just weeks after the last poll, and this just as one rather significant foreign visitor, Jared Kushner, arrives in Jerusalem.While Kushner’s Israel sojourn was scheduled …", "url": "https://news.yahoo.com/netanyahu-fail-trump-israel-palestine-212959376.html", "urlToImage": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "publishedAt": "2019-05-29T21:29:59Z", "content": "Thomas Coex/AFP/Getty\r\nTEL AVIV Israel is now headed to an unprecedented repeat election just weeks after the last poll, and this just as one rather significant foreign visitor, Jared Kushner, arrives in Jerusalem.\r\nWhile Kushners Israel sojourn was scheduled… [+8256 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "So many people!", "description": "That is all people there are in Australia! Then if so much people shortage why they are sending them away even if they come to settle?", "url": "https://www.thehindu.com/opinion/columns/so-many-people/article27161083.ece", "urlToImage": "https://www.thehindu.com/opinion/columns/bqu9xl/article27161082.ece/ALTERNATES/LANDSCAPE_615/19SMmathruladyjpg", "publishedAt": "2019-05-17T10:44:19Z", "content": "Dear Madam,\r\nI got one WhatsApp call yesterday from son in the U.S. It seems he lost his father in the hypermarket. They were searching and searching for two full hours before they finally managed to find Mathrubootham in the deep-sea fishing department. Than… [+3311 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Why so many people to do same job in India, asks Mrs. Mathrubootham", "description": "That is all people there are in Australia! Then if so much people shortage why they are sending them away even if they come to settle?", "url": "https://www.thehindu.com/opinion/columns/so-many-people-ask-mrs-mathrubootham/article27161083.ece", "urlToImage": "https://www.thehindu.com/opinion/columns/osd4rb/article27161082.ece/ALTERNATES/LANDSCAPE_615/19SMmathrulady", "publishedAt": "2019-05-18T18:46:17Z", "content": "Dear Madam,\r\nI got one WhatsApp call yesterday from son in the U.S. It seems he lost his father in the hypermarket. They were searching and searching for two full hours before they finally managed to find Mathrubootham in the deep-sea fishing department. Than… [+3311 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Youyou Zhou", "title": "Winning the H-1B visa lottery is no longer enough", "description": "Now you get through the H-1B lottery, what's the chance of getting approved?", "url": "https://qz.com/1614743/winning-the-h-1b-visa-lottery-is-getting-more-and-more-difficult/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2019/05/RTR2A4TE.jpg?quality=75&strip=all&w=1400", "publishedAt": "2019-05-13T22:04:22Z", "content": "The road to US employment for a foreign national is only getting bumpier. This year, more than 200,000 people applied for an H-1B visa for skilled workers, only 85,000 of whom can be accepted. Roughly 42% of applicants were selected through the H-1B lottery, … [+3609 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sandeep Ashar", "title": "Simply put: 5,000 dry villages in Maharashtra, 6,500 tankers", "description": "Record number of tankers are sole source of water in large parts of state. Behind the crisis, late monsoon following a deficit year, depleting groundwater in 279 talukas, under 10% live storage in 13 key reservoirs.", "url": "https://indianexpress.com/article/india/simply-put-5000-dry-villages-in-maharashtra-6500-tankers-5777789/", "urlToImage": "https://images.indianexpress.com/2019/06/maha-water.jpg?w=759", "publishedAt": "2019-06-12T19:36:08Z", "content": "A parched area in Palghar district, where villagers often walk miles to fetch water. (Express photo by Amit Chakravarty)\r\nMaharashtra is facing a water emergency of unprecedented proportions. Following years of drought, the rivers currents have ebbed, water i… [+4923 chars]"}, {"source": {"id": null, "name": "Disneyfoodblog.com"}, "author": "AJ and the DFB Team", "title": "NEW Toy Story Friends, Food, and FUN at Disneyland Resort!", "description": "Gather 'round all your Toy Story pals in Disneyland Resort! From themed snacks to new meet and greets to classic attractions and more, there is no shortage of Toy Story FUN to be had this summer! Related posts: Breaking! NEW Dining Spots Coming to Disneyland’…", "url": "http://www.disneyfoodblog.com/2019/06/12/new-toy-story-friends-food-and-fun-at-disneyland-resort/", "urlToImage": null, "publishedAt": "2019-06-12T20:25:09Z", "content": "We’ve been having all sorts of Toy Story-themed fun in Walt Disney World in celebration of Toy Story 4coming to theaters on June 21st! And today we’re turning our focus to the west coast, where the Toy Story gang is also in full force! For instance\r\nBo Peep i… [+1475 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "MANOJ MORE", "title": "In Pune, 200 villages battle water scarcity, admin steps up efforts to extend assistance", "description": "District Collector Naval Kishore Ram on Wednesday said over 200 tankers are being used to provide water to these villages but the number of tankers is expected to rise.", "url": "https://indianexpress.com/article/cities/pune/in-pune-200-villages-battle-water-scarcity-admin-steps-up-efforts-to-extend-assistance-5730159/", "urlToImage": "https://images.indianexpress.com/2019/05/pune-water-scarcity.jpg?w=759", "publishedAt": "2019-05-16T02:29:27Z", "content": "The district administration is also installing handpumps in the affected villages. (Express)\r\nAS many as 200 villages in Pune district are facing a water scarcity and the administration said it was leaving no stone unturned to ensure that adequate amount of w… [+2273 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Pooja Pillai", "title": "Sun and Shade", "description": "In Beyond the Boulevard, Aditi Sriram offers a deeper look at this quaint little town — aspects of which, the average tourist might catch a glimpse of as she speeds down the narrow streets on a hired bike.", "url": "https://indianexpress.com/article/lifestyle/books/sun-and-shade-in-beyond-the-boulevard-aditi-sriram-5770282/", "urlToImage": "https://images.indianexpress.com/2019/06/book-talk-759.jpg?w=759", "publishedAt": "2019-06-07T19:55:27Z", "content": "In Beyond the Boulevard by Aditi Sriram\r\nIn Beyond the BoulevardAditi SriramAleph201 pagesRs 399\r\nIn most tourists experience, Puducherry is as pretty as a picture postcard and as flat as one, too. The typical tourist experience of the little coastal town, al… [+2239 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Mumbai: Rights panel pulls up civic body over dog bite cases", "description": "The directions were issued on June 5 by bench headed by Justice M A Sayeed. The commission had issued a suo motu notice in 2018, observing that there were multiple media reports on dog bite incidents in Badlapur and Kulgaon.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-state-human-rights-commission-stray-dog-bites-civic-body-5772643/", "urlToImage": "https://images.indianexpress.com/2019/03/stray-dogs-1200.jpg?w=759", "publishedAt": "2019-06-10T03:17:23Z", "content": "The commission also received multiple letters from Nerul-based Sea Wood Estate against dog feeders.\r\nTaking note of multiple incidents of dog bites, the Maharashtra State Human Rights Commission (MSHRC) has pulled up Kulgaon Badlapur Municipal Corporation ove… [+1985 chars]"}, {"source": {"id": null, "name": "Cbr.com"}, "author": "Sid Natividad", "title": "The 10 Most Powerful Alien Races in The Marvel Universe, Ranked", "description": "The Marvel universe, both in the comic books and the films, is highly populated and diverse. There is no shortage of alien races (both friendly and hostile) who also have their own versions of superheroes or supervillains. They may not be as clear-cut as Eart…", "url": "https://www.cbr.com/marvel-universe-alien-races-powerful-ranked/", "urlToImage": "https://static2.cbrimages.com/wordpress/wp-content/uploads/2019/05/The-Watchers-Skrull-feature.jpg", "publishedAt": "2019-05-31T12:05:57Z", "content": "The Marvel universe, both in the comic books and the films, is highly populated and diverse. There is no shortage of alien races (both friendly and hostile) who also have their own versions of superheroes or supervillains. They may not be as clear-cut as Eart… [+9403 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "North Korea says it's suffering worst drought in decades", "description": "SEOUL, South Korea (AP) — North Korea said Wednesday it is suffering its worst drought in nearly four decades amid reports of a food crisis in the country.", "url": "https://news.yahoo.com/north-korea-says-suffering-worst-drought-decades-092714971.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/FZPGnzYOUH_cIsG6HpZNqQ--~B/aD0yMDU4O3c9MzM0MjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/280f78cb8e9f4043b52ebe4604c29409.jpg", "publishedAt": "2019-05-15T10:26:05Z", "content": "SEOUL, South Korea (AP) North Korea said Wednesday it is suffering its worst drought in nearly four decades amid reports of a food crisis in the country.\r\nThe official Korean Central News Agency said an average of 54.4 millimeters (2.1 inches) of rain fell th… [+1420 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA", "title": "Immigrants Play Big Part in Caring for Older Adults, Disabled in US", "description": "Proposed limits on immigration to the United States may worsen the nation’s shortage of workers who care for old and disabled people, a new study finds. More than three million immigrants work within the U.S. healthcare system. That represents 18 percent of a…", "url": "https://learningenglish.voanews.com/a/immigrants-play-big-part-in-caring-for-older-adults-disabled-in-u-s/4948378.html", "urlToImage": "https://gdb.voanews.com/E62FA62C-785E-44D3-8D53-EDEA4C82E81C_w1200_s.jpg", "publishedAt": "2019-06-08T21:57:11Z", "content": "Proposed limits on immigration to the United States may worsen the nations shortage of workers who care for old and disabled people, a new study finds.\r\nMore than three million immigrants work within the U.S. healthcare system. That represents 18 percent of a… [+3364 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": "Ann Triger Kurland", "title": "At the Boston Pickle Fair, no shortage of briny curiosities", "description": "If you’re near the Seaport’s Innovation and Design Building on Saturday, June 22, you’ll no doubt notice a pungent, vinegary smell stoked with garlic filling the air.", "url": "https://www.bostonglobe.com/lifestyle/food-dining/2019/06/03/boston-pickle-fair-shortage-briny-curiosities/50RvC0RR6eq2NLGR8qhPSM/story.html", "urlToImage": "https://www.bostonglobe.com/resizer/BhnSkCgDVS_7rA4TzqR65YXo6hg=/506x0/arc-anglerfish-arc2-prod-bostonglobe.s3.amazonaws.com/public/E4ZNAIEDFYI6TH4BDKHTZHMHXY.jpg", "publishedAt": "2019-06-04T03:08:06Z", "content": "If youre near the Seaports Innovation and Design Building on Saturday, June 22, youll no doubt notice a pungent, vinegary smell stoked with garlic filling the air. Its the Boston Pickle Fair. The outdoor event returns for the third year. Its a chance to taste… [+964 chars]"}, {"source": {"id": null, "name": "Thediplomat.com"}, "author": "Shannon", "title": "What North Korea’s Markets Could Tell Us About Its Food Security", "description": "To really understand how food is distributed, and who gets to eat, we have to also understand precisely how the markets work.", "url": "https://thediplomat.com/2019/05/what-north-koreas-markets-could-tell-us-about-its-food-security/", "urlToImage": "https://thediplomat.com/wp-content/uploads/2017/05/thediplomat.com-2604211579_efb0cd117d_b-553x360.jpg", "publishedAt": "2019-05-24T11:15:32Z", "content": "In early May, the United Nations World Food Program (WFP) and the Food and Agriculture Organization warned that 40 percent of North Koreas population 10.1 million people are food insecure and in urgent need of food assistance. In findings based off a two-week… [+3823 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "TJ Hafer", "title": "Total War: Three Kingdoms Review", "description": "A turn-based grand strategy game on the scale of Total War: Three&amp;hellip;", "url": "https://ca.ign.com/articles/2019/05/16/total-war-three-kingdoms-review", "urlToImage": "https://assets1.ignimgs.com/2019/05/15/total-war-three-kingdoms-review-blogroll-1557959787681_1280w.jpg", "publishedAt": "2019-05-16T14:00:56Z", "content": "A turn-based grand strategy game on the scale of Total War: Three Kingdoms often struggles to present a consistent and meaningful challenge across hundreds of turns and dozens of battles. With this foray into ancient China, however, Creative Assembly seems to… [+8878 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Arielle Tschinkel", "title": "12 ways your skin can react to stress, according to a dermatologist", "description": "Stress can take a toll on your body. It can also take a toll on your skin. It may lead to acne. It may also lead to sweating. Visit INSIDER's homepage for more stories. As more and more of us face increasing demands at work and at home, it's no secret that fe…", "url": "https://www.insider.com/how-stress-hurts-your-skin-2019-5", "urlToImage": "https://amp.businessinsider.com/images/5ce4381ff2f479123f75f62b-2732-1366.jpg", "publishedAt": "2019-05-21T17:36:36Z", "content": "As more and more of us face increasing demands at work and at home, it's no secret that feeling chronically stressed can impact our health in many ways, affecting us both mentally and physically. \r\n Chronic stress messes with your body in several ways — from … [+920 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Olga Khazan", "title": "Prescription Drugs Get an Instagram Makeover", "description": "Sites such as Hers offer to send pills directly to women to help them feel better—and prettier.", "url": "https://www.theatlantic.com/health/archive/2019/06/hers-online-medicine/591121/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/mt/2019/06/RTX1BHLY/facebook.jpg?1559778563", "publishedAt": "2019-06-06T15:30:00Z", "content": "Instagram-friendly start-ups already offer to mail women the one swimsuit, suitcase, or mascara to rule them all. These sites aim to reduce decision paralysis : They may sell only a few versions of the thing, but trust them, the thing is explicitly superior—a… [+10574 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Louisa Burwood-Taylor, Contributor, Louisa Burwood-Taylor, Contributor https://www.forbes.com/sites/louisaburwoodtaylor/", "title": "4 Trends Driving FoodTech Innovation in China in 2019", "description": "Economists around the world have closely watched Chinese consumers for several years as indicators of global economic growth. Keep a close eye on the Chinese consumer because she can be fickle; trends frequently come and go.", "url": "https://www.forbes.com/sites/louisaburwoodtaylor/2019/06/04/4-trends-driving-foodtech-innovation-in-china-in-2019/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1126231505%2F960x0.jpg%3FcropX1%3D0%26cropX2%3D5320%26cropY1%3D316%26cropY2%3D3308", "publishedAt": "2019-06-04T14:25:28Z", "content": "Economists around the world have closely watched Chinese consumers for several years as indicators of global economic growth. As the largest population in the world this is, of course, no surprise, but even as Chinas economic growth slows its down to 6.6% per… [+19429 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Sex assault: new trial - Canada News - Castanet.net", "description": "Sex assault: new trial - Canada News Castanet.net Supreme Court orders new trial for manslaughter in Cindy Gladue death CTV News Supreme Court orders new trial for manslaughter in Cindy Gladue Edmonton motel death Global News Supreme Court orders new manslaug…", "url": "https://www.castanet.net/news/Canada/257010/Sex-assault-new-trial", "urlToImage": "https://www.castanet.net/content/2019/5/CPT50200174_p3388345.jpg", "publishedAt": "2019-05-24T13:55:00Z", "content": "Canada  \r\nConservative Leader Andrew Scheer says the economy has become such a mess under the Liberals that it would take a Conservative government five years to clean it up.\r\nHe accused the Liberal government of embarking on a \"deficit spree\" and spending $7… [+26632 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "High Level fire grows - Canada News - Castanet.net", "description": "High Level fire grows - Canada News Castanet.net Alberta government to provide emergency financial assistance to High Level wildfire evacuees Global News Emergency funds coming to High Level fire evacuees CBC.ca Acts of kindness make impressions on High Level…", "url": "https://www.castanet.net/news/Canada/257036/High-Level-fire-grows", "urlToImage": "https://www.castanet.net/content/2019/5/CPT141548863_p3388417.jpg", "publishedAt": "2019-05-24T17:39:00Z", "content": "Canada  \r\nConservative Leader Andrew Scheer says the economy has become such a mess under the Liberals that it would take a Conservative government five years to clean it up.\r\nHe accused the Liberal government of embarking on a \"deficit spree\" and spending $7… [+26632 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ben Sin, Contributor, Ben Sin, Contributor https://www.forbes.com/sites/bensin/", "title": "How The New Apple Watch Could Prove To Be An Actual Lifesaver", "description": "The Apple Watch’s ability to detect irregular heart rates has made it a potentially lifesaving device.", "url": "https://www.forbes.com/sites/bensin/2019/05/22/how-the-new-apple-watch-could-prove-to-be-an-actual-lifesaver/", "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fbensin%2Ffiles%2F2019%2F05%2F4_edit.jpg", "publishedAt": "2019-05-22T04:24:00Z", "content": "Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nThe Apple Watch Series 4 is equipped with an ECG app that captures the hearts rhythm.\r\nBen Sin\r\nApple has a tendency to pitch its products and services as either industry-changing or even life-changing. … [+5591 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Fast-Food Workers Have a New Job Perk: Finish a Shift, Get Cash to Go", "description": "Fast-Food Workers Have a New Job Perk: Finish a Shift, Get Cash to Go", "url": "https://finance.yahoo.com/news/fast-food-workers-job-perk-110018092.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/LD81lbldcNfrCKolKcsHEw--~B/aD0xOTIwO3c9Mjg4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/fortune_175/024b18ebe7ce1238c781e2b66c3096d9", "publishedAt": "2019-05-19T11:00:18Z", "content": "Workers at Churchs Chicken, Pizza Hut, and Checkers can now get expedited pay as U.S. restaurants grapple with a labor shortage thats not showing any signs of abating.\r\nRestaurant chains are pulling out all the stops to attract and retain cooks and cashiers a… [+3463 chars]"}, {"source": {"id": null, "name": "Treehugger.com"}, "author": "Melissa Breyer", "title": "Dirty golden milk has changed my mornings (recipe)", "description": "This vegan, sweet, and spicy drink with a caffeine kick is an eye-opening way to start the day.", "url": "https://www.treehugger.com/easy-vegetarian-recipes/dirty-golden-milk-has-changed-my-mornings.html", "urlToImage": "https://media.treehugger.com/assets/images/2019/06/dirty-golden-milk.jpg.600x315_q90_crop-smart.jpg", "publishedAt": "2019-06-12T16:56:33Z", "content": "This vegan, sweet, and spicy drink with a caffeine kick is an eye-opening way to start the day.\r\nIf you know what a dirty chai is, and you know what golden milk is, then you know what dirty golden milk is a name that I find amusingly unappetizing yet also kin… [+3107 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "newsfeedback@fool.com (Daniel B. Kline)", "title": "Will HealthHUBs Help CVS Survive the Retail Apocalypse?", "description": "The pharmacy chain hopes the ability to get personalized health advice from in-store experts will bring more customers through its doors.", "url": "https://www.fool.com/investing/2019/06/11/can-health-hubs-help-cvs-survive-the-retail-apocal.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/528368/cvs-health-exterior-shot-of-healthhub-location-at-cvs-pharmacy-store-promo-image.jpg", "publishedAt": "2019-06-11T10:05:00Z", "content": "Thanks to the rise of e-commerce, people no longer need to visit stores nearly as often -- if at all. Nearly anything can be delivered.\r\nOf course, that doesn't mean Americans are going to actually stop patronizing physical merchants. But the ones that thrive… [+2931 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Alexia Fernández Campbell", "title": "The May jobs report is a big disappointment for workers and bad news for Trump", "description": "Employers added a scant 75,000 new jobs to the US economy in May — far below last year’s monthly average of 223,000 positions, according to the latest jobs report from the Bureau of Labor Statistics. Wage growth slowed down too.", "url": "https://www.vox.com/2019/6/7/18656343/may-jobs-report-2019-wage-growth", "urlToImage": "https://cdn.vox-cdn.com/thumbor/elIZBiNZeedVH0RmzxivcAiZCCk=/0x247:3000x1818/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16325381/GettyImages_1140624512.jpg", "publishedAt": "2019-06-07T14:50:00Z", "content": "Weak job growth caught economists by surprise. Employers added a scant 75,000 new jobs to the US economy in May — far below last year’s monthly average of 223,000 positions, according to the latest jobs report from the Bureau of Labor Statistics. The sudden d… [+5027 chars]"}, {"source": {"id": null, "name": "Theatlantic.com"}, "author": "Nick Hanauer", "title": "Education Isn’t Enough", "description": "Like many rich Americans, I used to think better schools could heal the country’s ills—but I was wrong. Fighting inequality must come first.", "url": "https://www.theatlantic.com/magazine/archive/2019/07/education-isnt-enough/590611/", "urlToImage": "https://cdn.theatlantic.com/assets/media/img/2019/06/DIS_Lead_Hanauer_lead/facebook.jpg?1559572885", "publishedAt": "2019-06-10T12:00:00Z", "content": "Long ago, I was captivated by a seductively intuitive idea, one many of my wealthy friends still subscribe to: that both poverty and rising inequality are largely consequences of America’s failing education system. Fix that, I believed, and we could cure much… [+13656 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Raichur, a thirsty land between two rivers", "description": "Northern Karnataka is in the grip of a severe water shortage. As wells dry up, Serish Nanisetti reports on the struggle of the people in the region", "url": "https://www.thehindu.com/opinion/op-ed/raichur-a-thirsty-land-between-two-rivers/article27392398.ece", "urlToImage": "https://www.thehindu.com/opinion/op-ed/7xzo3q/article27392383.ece/ALTERNATES/LANDSCAPE_615/1THRAICHUR", "publishedAt": "2019-05-31T15:34:31Z", "content": "Every morning, Simalamma, 35, and her eight-year-old son, Ganesh, trek half a kilometre from their home in Janakiramnagar Camp on the outskirts of Raichur in northern Karnataka in search of water. The land is cracked and the sun is harsh. Their destination is… [+11858 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Leslie Patton, Bloomberg", "title": "Fast-Food Workers Have a New Job Perk: Finish a Shift, Get Cash to Go", "description": "A labor shortage is forcing some fast food chains to add benefits like an expedited pay system so employees can get same day, next day pay.", "url": "http://fortune.com/2019/05/19/fast-food-franchise-employees-pay-labor-shortage/", "urlToImage": "https://fortunedotcom.files.wordpress.com/2019/05/gettyimages-1146752607-e1558134139474.jpg", "publishedAt": "2019-05-19T11:00:18Z", "content": "Workers at Churchs Chicken, Pizza Hut, and Checkers can now get expedited pay as U.S. restaurants grapple with a labor shortage thats not showing any signs of abating.\r\nRestaurant chains are pulling out all the stops to attract and retain cooks and cashiers a… [+3463 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jeremy Berke and Erin Brodwin", "title": "Investors just launched the first VC dedicated exclusively to psychedelics, which they call the 'next wave' after the cannabis boom", "description": "Psychedelic drugs like psilocybin and ecstasy are starting to attract attention from investors. In an exclusive interview with Business Insider, the world's first psychedelic-focused VC firm shared its plan for seeding promising startups in the space. Based i…", "url": "https://www.businessinsider.com/first-vc-psychedelics-field-trip-ventures-canada-2019-6", "urlToImage": "https://amp.businessinsider.com/images/5d013adb6fc92005bd126139-1536-768.jpg", "publishedAt": "2019-06-13T13:00:00Z", "content": "As the legalization of medical cannabis has swept the globe, it's also paved the way for another new health frontier: psychedelic medicine. \r\n Once portrayed as an illegal way to \"drop out\" or \"tune in,\" psychedelic and semi-psychedelic drugs like psilocybin … [+5119 chars]"}]}