{"batchcomplete": "", "query": {"normalized": [{"from": "disability", "to": "Disability"}], "pages": {"56285": {"pageid": 56285, "ns": 0, "title": "Disability", "extract": "According to many definitions, a disability is an impairment that may be cognitive, developmental, intellectual, mental, physical, sensory, or some combination of these. Other definitions describe disability as the societal disadvantage arising from such impairments. Disability substantially affects a person's life activities and may be present from birth or occur during a person's lifetime.\nDisabilities is an umbrella term, covering impairments, activity limitations, and participation restrictions. An impairment is a problem in body function or structure; an activity limitation is a difficulty encountered by an individual in executing a task or action; while a participation restriction is a problem experienced by an individual in involvement in life situations. Disability is thus not just a health problem. It is a complex phenomenon, reflecting the interaction between features of a person’s body and features of the society in which he or she lives.\n\nDisability is a contested concept, with different meanings in different communities. It may be used to refer to physical or mental attributes that some institutions, particularly medicine, view as needing to be fixed (the medical model). It may refer to limitations imposed on people by the constraints of an ableist society (the social model). Or the term may serve to refer to the identity of disabled people. Physiological functional capacity (PFC) is a related term that describes an individual's performance level. It gauges one's ability to perform the physical tasks of daily life and the ease with which these tasks are performed. PFC declines with advancing age to result in frailty, cognitive disorders or physical disorders, all of which may lead to labeling individuals as disabled.The discussion over disability's definition arose out of disability activism in the United States and the United Kingdom in the 1970s, which challenged how the medical concept of disability dominated perception and discourse about disabilities. Debates about proper terminology and their implied politics continue in disability communities and the academic field of disability studies. In some countries, the law requires that disabilities are documented by a healthcare provider in order to assess qualifications for disability benefits."}}}}