{"batchcomplete": "", "query": {"normalized": [{"from": "forced marriage", "to": "Forced marriage"}], "pages": {"2277678": {"pageid": 2277678, "ns": 0, "title": "Forced marriage", "extract": "Forced marriage is a marriage in which one or more of the parties is married without their consent or against their will. A forced marriage differs from an arranged marriage, in which both parties presumably consent to the assistance of their parents or a third party such as a matchmaker in choosing a spouse. There is often a continuum of coercion used to compel a marriage, ranging from outright physical violence to subtle psychological pressure. Forced marriage is still practised in various cultures across the world, particularly in parts of South Asia and Africa. Some scholars object to use of the term \"forced marriage\" because it invokes the consensual legitimating language of marriage (such as husband/wife) for an experience that is precisely the opposite. A variety of alternative terms exist, including \"forced conjugal association\" and \"conjugal slavery\".The United Nations views forced marriage as a form of human rights abuse, since it violates the principle of the freedom and autonomy of individuals. The Universal Declaration of Human Rights states that a person's right to choose a spouse and enter freely into marriage is central to his/her life and dignity, and his/her equality as a human being.  The Roman Catholic Church deems forced marriage grounds for granting an annulment — for a marriage to be valid both parties must give their consent freely. The Supplementary Convention on the Abolition of Slavery also prohibits marriage without right to refuse of herself out of her parents', family's and other persons' will and requires the minimum age for marriage to prevent this.In 1969, the Special Court for Sierra Leone's (SCSL) Appeals Chamber found the abduction and confinement of women for \"forced marriage\" in war to be a new crime against humanity (AFRC decision). The SCSL Trial Chamber in the Charles Taylor decision found that the term 'forced marriage' should be avoided and rather described the practice in war as 'conjugal slavery' (2012).In 2013, the first United Nations Human Rights Council resolution against child, early, and forced marriages was adopted; the resolution recognizes child, early, and forced marriage as involving violations of human rights which “prevents individuals from living their lives free from all forms of violence and that has adverse consequences on the enjoyment of human rights, such as the right to education, [and] the right to the highest attainable standard of health including sexual and reproductive health\", and also states that \"the elimination of child, early and forced marriage should be considered in the discussion of the post-2015 development agenda.\""}}}}