{"batchcomplete": "", "query": {"normalized": [{"from": "military", "to": "Military"}], "pages": {"92357": {"pageid": 92357, "ns": 0, "title": "Military", "extract": "A military is a heavily-armed, highly-organised force primarily intended for warfare, also known collectively as armed forces. It is typically officially authorized and maintained by a sovereign state, with its members identifiable by their distinct military uniform. It may consist of one or more military branches such as an Army, Navy, Air Force and in certain countries, Marines and Coast Guard. The main task of the military is usually defined as defence of the state and its interests against external armed threats. Beyond warfare, the military may be employed in additional sanctioned and non-sanctioned functions within the state, including internal security threats, population control, the promotion of a political agenda, emergency services and reconstruction, protecting corporate economic interests, social ceremonies and national honor guards.\nA nation's military may function as a discrete social subculture, with dedicated infrastructure such as military housing, schools, utilities, logistics, hospitals, legal services, food production, finance, and banking services.\nIn broad usage, the terms \"armed forces\" and \"military\" are often treated as synonymous, although in technical usage a distinction is sometimes made in which a country's armed forces may include both its military and other paramilitary forces. There are various forms of irregular military forces, not belonging to a recognized state; though they share many attributes with regular military forces, they are less often referred to as simply \"military\".\n\nThe profession of soldiering as part of a military is older than recorded history itself. Some of the most enduring images of  classical antiquity portray the power and feats of its military leaders. The Battle of Kadesh in 1274 BC was one of the defining points of Pharaoh Ramses II's reign, and his monuments commemorate it in bas-relief. A thousand years later, the first emperor of unified China, Qin Shi Huang, was so determined to impress the gods with his military might that he had himself buried with an army of  terracotta soldiers.\nThe  Romans paid considerable attention to military matters, leaving to posterity many treatises and writings on the subject, as well as a large number of lavishly carved triumphal arches and victory columns."}}}}