{"batchcomplete": "", "query": {"normalized": [{"from": "aggression", "to": "Aggression"}], "pages": {"58687": {"pageid": 58687, "ns": 0, "title": "Aggression", "extract": "Aggression is overt or covert, often harmful, social interaction with the intention of inflicting damage or other unpleasantness upon another individual. It may occur either reactively or without provocation. In humans, frustration due to blocked goals can cause aggression. Human aggression can be classified into direct and indirect aggression; whilst the former is characterized by physical or verbal behavior intended to cause harm to someone, the latter is characterized by behavior intended to harm the social relations of an individual or group.In definitions commonly used in the social sciences and behavioral sciences, aggression is an action or response by an individual that delivers something unpleasant to another person. Some definitions include that the individual must intend to harm another person. Predatory or defensive behavior between members of different species may not be considered aggression in the same sense.\nAggression can take a variety of forms, which may be expressed physically, or communicated verbally or non-verbally: including anti-predator aggression, defensive aggression (fear-induced), predatory aggression, dominance aggression, inter-male aggression, resident-intruder aggression, maternal aggression, species-specific aggression, sex-related aggression, territorial aggression, isolation-induced aggression, irritable aggression, and brain-stimulation-induced aggression (hypothalamus). There are two subtypes of human aggression: (1) controlled-instrumental subtype (purposeful or goal-oriented); and (2) reactive-impulsive subtype (often elicits uncontrollable actions that are inappropriate or undesirable). Aggression differs from what is commonly called assertiveness, although the terms are often used interchangeably among laypeople (as in phrases such as \"an aggressive salesperson\")."}}}}