{"batchcomplete": "", "query": {"normalized": [{"from": "human trafficking", "to": "Human trafficking"}], "pages": {"19333662": {"pageid": 19333662, "ns": 0, "title": "Human trafficking", "extract": "Human trafficking is the trade of humans for the purpose of forced labour, sexual slavery, or commercial sexual exploitation for the trafficker or others. This may encompass providing a spouse in the context of forced marriage, or the extraction of organs or tissues, including for surrogacy and ova removal. Human trafficking can occur within a country or trans-nationally. Human trafficking is a crime against the person because of the violation of the victim's rights of movement through coercion and because of their commercial exploitation. Human trafficking is the trade in people, especially women and children, and does not necessarily involve the movement of the person from one place to another.According to the International Labour Organization (ILO), forced labour alone (one component of human trafficking) generates an estimated $150 billion in profits per annum as of 2014. In 2012, the ILO estimated that 21 million victims are trapped in modern-day slavery. Of these, 14.2 million (68%) were exploited for labour, 4.5 million (22%) were sexually exploited, and 2.2 million (10%) were exploited in state-imposed forced labour. The International Labour Organization has reported that child workers, minorities, and irregular migrants are at considerable risk of more extreme forms of exploitation. Statistics shows that over half of the world’s 215 million young workers are observed to be in hazardous sectors, including forced sex work and forced street begging. Ethnic minorities and highly marginalized groups of people are highly estimated  to work in some of the most exploitative and damaging sectors, such as leather tanning, mining, and stone quarry work.Human trafficking is thought to be one of the fastest-growing activities of trans-national criminal organizations.Human trafficking is condemned as a violation of human rights by international conventions. In addition, human trafficking is subject to a directive in the European Union. According to a report by the U.S. State Department, Belarus, Iran, Russia, and Turkmenistan remain among the worst countries when it comes to providing protection against human trafficking and forced labour."}}}}