{"batchcomplete": "", "query": {"normalized": [{"from": "protection", "to": "Protection"}], "pages": {"57827877": {"pageid": 57827877, "ns": 0, "title": "Protection", "extract": "Protection is any measure taken to guard a thing against damage caused by outside forces. Protection can be provided to physical objects, including organisms, to systems, and to intangible things like civil and political rights. Although the mechanisms for providing protection vary widely, the basic meaning of the term remains the same. This is illustrated by an explanation found in a manual on electrical wiring:\n\nThe meaning of the word 'protection', as used in the electrical industry, is no different to that in everyday use. People protect themselves against personal or financial loss by means of insurance and from injury or discomfort by the use of protective clothing. They further protect their property by the installation of security measures such as locks and/or alarms systems.\nSome kind of protection is a characteristic of all life, as living things have evolved at least some protective mechanisms to counter damaging environmental phenomena, such as ultraviolet light. Biological membranes such as bark on trees and skin on animals offer protection from various threats, with skin playing a key role in protecting organisms against pathogens and excessive water loss. Additional structures like scales and hair offer further protection from the elements and from predators, with some animals having features such as spines or camouflage serving exclusively as anti-predator adaptations. Many animals supplement the protection afforded by their physiology by burrowing or otherwise adopting habitats or behaviors that insulate them from potential sources of harm. Humans originally began wearing clothing and building shelters in prehistoric times for protection from the elements. Both humans and animals are also often concerned with the protection of others, with adult animals being particularly inclined to seek to protect their young from elements of nature and from predators.\nIn the human sphere of activity, the concept of protection has been extended to nonliving objects, including technological systems such as computers, and to intangible things such as intellectual property, beliefs, and economic systems. Humans seek to protect locations of historical and cultural significance through historic preservation efforts, and are also concerned with protecting the environment from damage caused by human activity, and with protecting the Earth as a whole from potentially harmful objects from space.\n\n"}}}}