{"batchcomplete": "", "query": {"normalized": [{"from": "amnesty", "to": "Amnesty"}], "pages": {"18940624": {"pageid": 18940624, "ns": 0, "title": "Amnesty", "extract": "Amnesty (from the Greek ἀμνηστία amnestia, \"forgetfulness, passing over\") is defined as: \"A pardon extended by the government to a group or class of people, usually for a political offense; the act of a sovereign power officially forgiving certain classes of people who are subject to trial but have not yet been convicted.\"\nIt includes more than pardon, inasmuch as it obliterates all legal remembrance of the offense. Amnesty is more and more used to express \"freedom\" and the time when prisoners can go free.\nAmnesties, which in the United Kingdom may be granted by the crown or by an act of Parliament, were formerly usual on coronations and similar occasions, but are chiefly exercised towards associations of political criminals, and are sometimes granted absolutely, though more frequently there are certain specified exceptions. Thus, in the case of the earliest recorded amnesty, that of Thrasybulus at Athens, the thirty tyrants and a few others were expressly excluded from its operation; and the amnesty proclaimed on the restoration of Charles II of England did not extend to those who had taken part in the execution of his father. Other famous amnesties include: Napoleon's amnesty of March 13, 1815, from which thirteen eminent persons, including Talleyrand, were exempt; the Prussian amnesty of August 10, 1840; the general amnesty proclaimed by the emperor Franz Josef I of Austria in 1857; the general amnesty granted by President of the United States, Andrew Johnson, after the American Civil War (April 12, 1861, to April 9, 1865), in 1868, and the French amnesty of 1905. Amnesty in U.S. politics in 1872 meant restoring the right to vote and hold office to ex-Confederates, which was achieved by act of Congress. Those were true amnesties, pardoning past violations without changing the laws violated.\nThe Immigration Reform and Control Act of 1986—signed into law by President Ronald Reagan on November 6, 1986—granted amnesty to about 3 million undocumented immigrants in the United States."}}}}