{"batchcomplete": "", "query": {"normalized": [{"from": "pregnancy", "to": "Pregnancy"}], "pages": {"1771587": {"pageid": 1771587, "ns": 0, "title": "Pregnancy", "extract": "Pregnancy, also known as gestation, is the time during which one or more offspring develops inside a woman. A multiple pregnancy involves more than one offspring, such as with twins. Pregnancy can occur by sexual intercourse or assisted reproductive technology. Childbirth typically occurs around 40 weeks from the start of the last menstrual period (LMP). This is just over nine months, where each month averages 31 days. When measured from fertilization it is about 38 weeks. An embryo is the developing offspring during the first eight weeks following fertilization, after which, the term fetus is used until birth. Symptoms of early pregnancy may include  missed periods, tender breasts, nausea and vomiting, hunger, and frequent urination. Pregnancy may be confirmed with a pregnancy test.Pregnancy is typically divided into three trimesters. The first trimester is from week one through 12 and includes conception, which is when the sperm fertilizes the egg. The fertilized egg then travels down the fallopian tube and attaches to the inside of the uterus, where it begins to form the embryo and placenta. During the first trimester, the possibility of miscarriage (natural death of embryo or fetus) is at its highest. The second trimester is from week 13 through 28. Around the middle of the second trimester, movement of the fetus may be felt. At 28 weeks, more than 90% of babies can survive outside of the uterus if provided with high-quality medical care. The third trimester is from 29 weeks through 40 weeks.Prenatal care improves pregnancy outcomes. Prenatal care may include taking extra folic acid, avoiding drugs and alcohol, regular exercise, blood tests, and regular physical examinations. Complications of pregnancy may include disorders of high blood pressure, gestational diabetes, iron-deficiency anemia, and severe nausea and vomiting among others. In the ideal childbirth labor begins on its own when a woman is \"at term. Babies born before 37 weeks are \"preterm\" and at higher risk of health problems such as cerebral palsy. Babies born between weeks 37 and 39 are considered \"early term\" while those born between weeks 39 and 41 are considered \"full term\". Babies born between weeks 41 and 42 weeks are considered \"late term\" while after 42 week they are considered \"post term\". Delivery before 39 weeks by labor induction or caesarean section is not recommended unless required for other medical reasons.About 213 million pregnancies occurred in 2012, of which, 190 million (89%) were in the developing world and 23 million (11%) were in the developed world. The number of pregnancies in women ages 15 to 44 is 133 per 1,000 women. About 10% to 15% of recognized pregnancies end in miscarriage. In 2016, complications of pregnancy resulted in 230,600 maternal deaths, down from 377,000 deaths in 1990. Common causes include bleeding, infections, hypertensive diseases of pregnancy, obstructed labor, and complications associated with miscarriage, ectopic pregnancy, or elective abortion. Globally, 44% of pregnancies are unplanned. Over half (56%) of unplanned pregnancies are aborted. Among unintended pregnancies in the United States, 60% of the women used birth control to some extent during the month pregnancy occurred."}}}}