{"batchcomplete": "", "query": {"normalized": [{"from": "gender", "to": "Gender"}], "pages": {"38076": {"pageid": 38076, "ns": 0, "title": "Gender", "extract": "Gender is the range of characteristics pertaining to, and differentiating between, masculinity and femininity. Depending on the context, these characteristics may include biological sex (i.e., the state of being male, female, or an intersex variation), sex-based social structures (i.e., gender roles), or gender identity. Most cultures use a gender binary, having two genders (boys/men and girls/women); those who exist outside these groups fall under the umbrella term non-binary or genderqueer. Some societies have specific genders besides \"man\" and \"woman\", such as the hijras of South Asia; these are often referred to as third genders (and fourth genders, etc).\nSexologist John Money introduced the terminological distinction between biological sex and gender as a role in 1955. Before his work, it was uncommon to use the word gender to refer to anything but grammatical categories. However, Money's meaning of the word did not become widespread until the 1970s, when feminist theory embraced the concept of a distinction between biological sex and the social construct of gender. Today, the distinction is followed in some contexts, especially the social sciences and documents written by the World Health Organization (WHO).In other contexts, including some areas of the social sciences, gender includes sex or replaces it. For instance, in non-human animal research, gender is commonly used to refer to the biological sex of the animals. This change in the meaning of gender can be traced to the 1980s. In 1993, the US Food and Drug Administration (FDA) started to use gender instead of sex. Later, in 2011, the FDA reversed its position and began using sex as the biological classification and gender as \"a person's self representation as male or female, or how that person is responded to by social institutions based on the individual's gender presentation.\"The social sciences have a branch devoted to gender studies. Other sciences, such as sexology and neuroscience, are also interested in the subject. The social sciences sometimes approach gender as a social construct, and gender studies particularly do, while research in the natural sciences investigates whether biological differences in males and females influence the development of gender in humans; both inform debate about how far biological differences influence the formation of gender identity. In some English literature, there is also a trichotomy between biological sex, psychological gender, and social gender role. This framework first appeared in a feminist paper on transsexualism in 1978."}}}}