{"batchcomplete": "", "query": {"normalized": [{"from": "homelessness", "to": "Homelessness"}], "pages": {"19394651": {"pageid": 19394651, "ns": 0, "title": "Homelessness", "extract": "Homelessness is defined as living in housing that is below the minimum standard or lacks secure tenure. People can be categorized as homeless if they are: living on the streets (primary homelessness); moving between temporary shelters, including houses of friends, family and emergency accommodation (secondary homelessness); living in private boarding houses without a private bathroom and/or security of tenure (tertiary homelessness). The legal definition of homeless varies from country to country, or among different jurisdictions in the same country or region. According to the UK homelessness charity Crisis, a home is not just a physical space: it also provides roots, identity, security, a sense of belonging and a place of emotional wellbeing. United States government homeless enumeration studies also include people who sleep in a public or private place not designed for use as a regular sleeping accommodation for human beings. People who are homeless are most often unable to acquire and maintain regular, safe, secure and adequate housing due to a lack of, or an unsteady income. Homelessness and poverty are interrelated.\nIn 2005, an estimated 100 million (1 in 65 at the time) people worldwide were homeless and as many as 1 billion people live as squatters, refugees or in temporary shelter, all lacking adequate housing. Historically in the Western countries, the majority of homeless have been men (50–80%), with single males particularly overrepresented. In 2015, the United States reported that there were 564,708 homeless people within its borders, one of the higher reported figures worldwide. These figures are likely underestimates as surveillance for the homeless population is challenging. \nWhen compared to the general population, people who are homeless experience higher rates of adverse physical and mental health outcomes, which renders them vulnerable to health conditions associated with changes in climate. Chronic disease severity, respiratory conditions, rates of mental health illnesses and substance use are all often greater in homeless populations than the general population. Homelessness is also associated with a high risk of suicide attempts. People experiencing homelessness have limited access to resources and are often disengaged from health services, making them that much more susceptible to extreme weather events (e.g., extreme cold or heat) and ozone levels. These disparities often result in increased morbidity and mortality in the homeless population.\nThere are a number of organizations who provide help for the homeless. Most countries provide a variety of services to assist homeless people. These services often provide food, shelter (beds) and clothing and may be organized and run by community organizations (often with the help of volunteers) or by government departments or agencies. These programs may be supported by the government, charities, churches and individual donors. Many cities also have street newspapers, which are publications designed to provide employment opportunity to homeless people. While some homeless have jobs, some must seek other methods to make a living. Begging or panhandling is one option, but is becoming increasingly illegal in many cities. People who are homeless may have additional conditions, such as physical or mental health issues or substance addiction; these issues make resolving homelessness a challenging policy issue.\nHomeless people, and homeless organizations, are sometimes accused or convicted of fraudulent behaviour. Criminals are also known to exploit homeless people, ranging from identity theft to tax and welfare scams. These incidents often lead to negative connotations on the homeless as a group."}}}}