{"batchcomplete": "", "query": {"normalized": [{"from": "socialism", "to": "Socialism"}], "pages": {"26847": {"pageid": 26847, "ns": 0, "title": "Socialism", "extract": "Socialism is a range of economic and social systems characterised by social ownership of the means of production and workers' self-management, as well as the political theories and movements associated with them. Social ownership can be public, collective or cooperative ownership, or citizen ownership of equity. There are many varieties of socialism and there is no single definition encapsulating all of them, with social ownership being the common element shared by its various forms.Socialist systems are divided into non-market and market forms. Non-market socialism involves the substitution of factor markets and money with engineering and technical criteria based on calculation performed in-kind, thereby producing an economic mechanism that functions according to different economic laws from those of capitalism. Non-market socialism aims to circumvent the inefficiencies and crises traditionally associated with capital accumulation and the profit system. By contrast, market socialism retains the use of monetary prices, factor markets and in some cases the profit motive, with respect to the operation of socially owned enterprises and the allocation of capital goods between them. Profits generated by these firms would be controlled directly by the workforce of each firm, or accrue to society at large in the form of a social dividend. The socialist calculation debate concerns the feasibility and methods of resource allocation for a socialist system.\nSocialist politics has been both internationalist and nationalist in orientation; organised through political parties and opposed to party politics; at times overlapping with trade unions, and at other times independent and critical of unions; and present in both industrialised and developing nations. Originating within the socialist movement, social democracy has embraced a mixed economy with a market that includes substantial state intervention in the form of income redistribution, regulation, and a welfare state. Economic democracy proposes a sort of market socialism where there is more decentralised control of companies, currencies, investments, and natural resources.\nThe socialist political movement includes a set of political philosophies that originated in the revolutionary movements of the mid-to-late 18th century and out of concern for the social problems that were associated with capitalism. By the late 19th century, after the work of Karl Marx and his collaborator Friedrich Engels, socialism had come to signify opposition to capitalism and advocacy for a post-capitalist system based on some form of social ownership of the means of production. By the 1920s, social democracy and communism had become the two dominant political tendencies within the international socialist movement. By this time, socialism emerged as \"the most influential secular movement of the twentieth century, worldwide. It is a political ideology (or world view), a wide and divided political movement\" and while the emergence of the Soviet Union as the world's first nominally socialist state led to socialism's widespread association with the Soviet economic model, some economists and intellectuals argued that in practice the model functioned as a form of state capitalism or a non-planned administrative or command economy. Socialist parties and ideas remain a political force with varying degrees of power and influence on all continents, heading national governments in many countries around the world. Today, some socialists have also adopted the causes of other social movements, such as environmentalism, feminism and progressivism. In 21st century America, the term socialism, without clear definition, has become a pejorative used by conservatives to taint liberal and progressive policies, proposals, and public figures."}}}}