{"batchcomplete": "", "query": {"normalized": [{"from": "food security", "to": "Food security"}], "pages": {"216361": {"pageid": 216361, "ns": 0, "title": "Food security", "extract": "Food security is a measure of the availability of food and individuals' accessibility to it, where accessibility includes affordability. There is evidence of food security being a concern over 10,000 years ago, with central authorities in ancient China and ancient Egypt being known to release food from storage in times of famine. At the 1974 World Food Conference the term \"food security\" was defined with an emphasis on supply. Food security, they said, is the \"availability at all times of adequate, nourishing, diverse, balanced and moderate world food supplies of basic foodstuffs to sustain a steady expansion of food consumption and to offset fluctuations in production and prices\". Later definitions added demand and access issues to the definition. The final report of the 1996 World Food Summit states that food security \"exists when all people, at all times, have physical and economic access to sufficient, safe and nutritious food to meet their dietary needs and food preferences for an active and healthy life\".Household food security exists when all members, at all times, have access to enough food for an active, healthy life. Individuals who are food secure do not live in hunger or fear of starvation. Food insecurity, on the other hand, is a situation of \"limited or uncertain availability of nutritionally adequate and safe foods or limited or uncertain ability to acquire acceptable foods in socially acceptable ways\", according to the United States Department of Agriculture (USDA). Food security incorporates a measure of resilience to future disruption or unavailability of critical food supply due to various risk factors including droughts, shipping disruptions, fuel shortages, economic instability, and wars. \nIn the years 2011–2013, an estimated 842 million people were suffering from chronic hunger. The Food and Agriculture Organization of the United Nations, or FAO, identified the four pillars of food security as availability, access, utilization, and stability. The United Nations (UN) recognized the Right to Food in the Declaration of Human Rights in 1948, and has since noted that it is vital for the enjoyment of all other rights.The 1996 World Summit on Food Security declared that \"food should not be used as an instrument for political and economic pressure\"."}}}}