{"batchcomplete": "", "query": {"normalized": [{"from": "justice", "to": "Justice"}], "pages": {"16369": {"pageid": 16369, "ns": 0, "title": "Justice", "extract": "Justice, in its broadest context, includes both the attainment of that which is just and the philosophical discussion of that which is just. The concept of justice is based on numerous fields, and many differing viewpoints and perspectives including the concepts of moral correctness based on ethics, rationality, law, religion, equity and fairness. Often, the general discussion of justice is divided into the realm of social justice as found in philosophy, theology and religion, and, procedural justice as found in the study and application of the law.\nThe concept of justice differs in every culture. Early theories of justice were set out by the Ancient Greek philosophers Plato in his work The Republic, and Aristotle in his Nicomachean Ethics. Throughout history various theories have been established. Advocates of divine command theory argue that justice issues from God. In the 1600s, theorists like John Locke argued for the theory of natural law. Thinkers in the social contract tradition argued that justice is derived from the mutual agreement of everyone concerned. In the 1800s, utilitarian thinkers including John Stuart Mill argued that justice is what has the best consequences. Theories of distributive justice concern what is distributed, between whom they are to be distributed, and what is the proper distribution. Egalitarians argued that justice can only exist within the coordinates of equality. John Rawls used a social contract argument to show that justice, and especially distributive justice, is a form of fairness. Property rights theorists (like Robert Nozick) also take a consequentialist view of distributive justice and argue that property rights-based justice maximizes the overall wealth of an economic system. Theories of retributive justice are concerned with punishment for wrongdoing. Restorative justice (also sometimes called \"reparative justice\") is an approach to justice that focuses on the needs of victims and offenders."}}}}