{"batchcomplete": "", "query": {"normalized": [{"from": "capitalism", "to": "Capitalism"}], "pages": {"5416": {"pageid": 5416, "ns": 0, "title": "Capitalism", "extract": "Capitalism is an economic system based on the private ownership of the means of production and their operation for profit. Characteristics central to capitalism include private property, capital accumulation, wage labor, voluntary exchange, a price system, and competitive markets. In a capitalist market economy, decision-making and investment are determined by every owner of wealth, property or production ability in financial and capital markets, whereas prices and the distribution of goods and services are mainly determined by competition in goods and services markets.Economists, political economists, sociologists and historians have adopted different perspectives in their analyses of capitalism and have recognized various forms of it in practice. These include laissez-faire or free market capitalism, welfare capitalism and state capitalism. Different forms of capitalism feature varying degrees of free markets, public ownership, obstacles to free competition and state-sanctioned social policies. The degree of competition in markets, the role of intervention and regulation, and the scope of state ownership vary across different models of capitalism. The extent to which different markets are free as well as the rules defining private property are matters of politics and policy. Most existing capitalist economies are mixed economies, which combine elements of free markets with state intervention and in some cases economic planning.Market economies have existed under many forms of government and in many different times, places and cultures. Modern capitalist societies—marked by a universalization of money-based social relations, a consistently large and system-wide class of workers who must work for wages, and a capitalist class which owns the means of production—developed in Western Europe in a process that led to the Industrial Revolution. Capitalist systems with varying degrees of direct government intervention have since become dominant in the Western world and continue to spread. Over time, capitalist countries have experienced consistent economic growth and an increase in the standard of living.\nCritics of capitalism argue that it establishes power in the hands of a minority capitalist class that exists through the exploitation of the majority working class and their labor; prioritizes profit over social good, natural resources and the environment; and is an engine of inequality, corruption and economic instabilities. Supporters argue that it provides better products and innovation through competition, disperses wealth to all productive people, promotes pluralism and decentralization of power, creates strong economic growth, and yields productivity and prosperity that greatly benefit society."}}}}