{"batchcomplete": "", "query": {"normalized": [{"from": "refugee camp", "to": "Refugee camp"}], "pages": {"438046": {"pageid": 438046, "ns": 0, "title": "Refugee camp", "extract": "A refugee camp is a temporary settlement built to receive refugees and people in refugee-like situations. Refugee camps usually accommodate displaced persons who have fled their home country, but there are also camps for internally displaced people. Usually refugees seek asylum after they've escaped war in their home countries, but some camps also house environmental- and economic migrants. Camps with over a hundred thousand people are common, but as of 2012, the average-sized camp housed around 11,400. They are usually built and run by a government, the United Nations, international organizations (such as the International Committee of the Red Cross), or NGOs. There are also unofficial refugee camps, like Idomeni in Greece or the Calais jungle in France, where refugees are largely left without support of governments or international organizations.Refugee camps generally develop in an impromptu fashion with the aim of meeting basic human needs for only a short time. Facilities that make a camp look or feel more permanent are often prohibited by host country governments. If the return of refugees is prevented (often by civil war), a humanitarian crisis can result or continue.\nAccording to UNHCR, the majority of refugees worldwide do not live in refugee camps. At the end of 2015, some 67 percent of refugees around the world lived in individual, private accommodations. This can be partly explained by the high number of Syrian refugees renting apartments in urban agglomerations across the Middle East. Worldwide, slightly over a quarter (25.4%) of refugees were reported to be living in managed camps. At the end of 2015, about 56 percent of the total refugee population in rural locations resided in a managed camp, compared to the 2 percent who resided in individual accommodation. In urban locations, the overwhelming majority (99 percent) of refugees lived in individual accommodations, compared with less than 1 percent who lived in a managed camp. A small percentage of refugees also live in collective centers, transit camps and in self-settled camps.In spite of the fact that 74 percent of refugees are in urban areas, the service delivery model of international humanitarian aid agencies remains focused on the establishment and operation of refugee camps."}}}}